[
  {
    "theme": "youtube",
    "frequencies": [
      {
        "freq": 34,
        "name": "frequency",
        "topComments": [
          "Here&#x27;s a link to a video of the talk. It&#x27;s quite good.<p><a href=\"https://www.youtube.com/watch?v=lY6Fy570J_8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=lY6Fy570J_8</a>",
          "For those wondering: Both Go and Clojure are modern languages that heavily use the concepts Tony Hoare described in this book to manage concurrency and parallelism.<p>Rich Hickey (Clojure): <a href=\"http://www.infoq.com/presentations/core-async-clojure\" rel=\"nofollow\">http:&#x2F;&#x2F;www.infoq.com&#x2F;presentations&#x2F;core-async-clojure</a><p>Rob Pike (Go): <a href=\"https://www.youtube.com/watch?v=cN_DpYBzKso\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=cN_DpYBzKso</a>",
          "Co-author here. Thanks for the review!<p>I actually started exploring this book topic in late 2009 through an initial series of open-ended interviews that were discussed on HN quite extensively (when it was much more startup focused). Here is that set: <a href=\"https://www.youtube.com/channel/UC6r4nAnkQO3VpddRSVwUVDg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;channel&#x2F;UC6r4nAnkQO3VpddRSVwUVDg</a> (e.g. patio11 <a href=\"https://www.youtube.com/watch?v=wuzNs-LhC_8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=wuzNs-LhC_8</a>, Alexis <a href=\"https://www.youtube.com/watch?v=enEqAq1x9UQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=enEqAq1x9UQ</a>, Garry Tan <a href=\"https://www.youtube.com/watch?v=8Win0moC4cA\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=8Win0moC4cA</a>).<p>I started angel investing around the same time and I quickly came to the conclusion that the pursuit of getting traction needed much more structure more akin to product development frameworks. I also got increasingly busy with DuckDuckGo, and so it took finding a co-author and many years to actually get this book across the finish line.<p>Here&#x27;s the announcement post from my blog: <a href=\"http://www.gabrielweinberg.com/blog/2014/08/get-traction-today.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.gabrielweinberg.com&#x2F;blog&#x2F;2014&#x2F;08&#x2F;get-traction-tod...</a><p>Happy to take any questions.",
          "This quote specifically:<p>&quot;This was followed by a dimly lit museum corridor with a T-rex coming around the corner and slowly but menacingly approaching me. The model was very detailed and well animated, which really sold it. It wasn’t scary per se, but when it got close and roared right at me, I was definitely teetering on the edge of feeling like I was near a living creature. Why take kids to museums when they can travel back to the era of dinosaurs? VR in education is going to be huge.&quot;[0]<p>Reminds me so much of this clip: <a href=\"http://www.youtube.com/watch?v=l1_bp8YKUPU\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=l1_bp8YKUPU</a><p>[0]<a href=\"http://www.roadtovr.com/hands-on-oculus-rift-crescent-bay-prototype/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.roadtovr.com&#x2F;hands-on-oculus-rift-crescent-bay-pr...</a>",
          "See <a href=\"http://www.youtube.com/watch?v=zsXP8qeFF6A\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=zsXP8qeFF6A</a> for a video that made me build this.<p>Google for &quot;ayumu chimp&quot; for a number of articles on the subject.",
          "The Ableton Push has several different configurations. I think you can use patterns based on any scale you want (including chromatic). Jordan Rudess did a little video series exploring the push: <a href=\"https://www.youtube.com/watch?v=cz39lPgqfhE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=cz39lPgqfhE</a>",
          "tl;dr: The only competition (IMO) is the LG G3, and IOS makes the difference (IMO).<p>I&#x27;ve owned a Nexus One, Samsung Galaxy S2, Moto X and LG G2.<p>Only the G2&#x27;s camera was decent, but it seems a fairly broad opinion that the iPhone 5&#x27;s camera is the better of the two.<p>Aside from the original iPhone&#x27;s lack of video recording, I&#x27;ve found iPhone cameras to consistently be best of breed.<p>As far as MicroSD: I rarely felt a pinch at 64GB. With higher resolution video (and bigger apps&#x2F;games over time) I think 128GB will probably serve pretty well.<p>It used to be that the MicroSD expansion on Androids was pretty limited. I&#x27;ve been told that&#x27;s changed, but I wouldn&#x27;t know since my last Android didn&#x27;t have it.<p>As far as battery goes: I much prefer an all-day battery over swapping. I found the iPhone 5&#x27;s battery to last quite a bit longer than the Moto X or G2 with similar usage patterns. It&#x27;s also smaller and much quicker to charge. Sort of like trickle-charging a Tesla vs a Leaf I guess. Bigger isn&#x27;t necessarily always better. If your battery is twice the size, but your phone consumes twice the power under active use, then all things being equal you&#x27;re going to double your charge time.<p>All things aren&#x27;t equal though as the 12w charger will take an iPhone from empty to 80% in what... 30 minutes? The G2 might recover 30% of it&#x27;s charge in that time if I&#x27;m lucky.<p>And no swappable battery.<p>So what does have a swappable battery, a really good camera, has 128GB of storage (or can be expanded to it), and runs Android? That&#x27;s a very short list I think.<p>The Moto X had a terrible camera at launch. After patching it was much improved, but still feel far short of the iPhone. The X+1 only has 32GB of storage (that I can figure out) and no MicroSD.<p>No Nexus device qualifies. Terrible cameras, no SD, no battery replacement.<p>Off the top of my head that leaves the G3, HTC One M8 and Samsung Galaxy S5 (might as well throw in the Note 3&#x2F;4 as well?).<p>Personal tastes and all, and I&#x27;m definitely in the vast majority of opinion on this, but I think the HTC is one of the uglier phones I&#x27;ve seen. Just don&#x27;t care for it at all.<p>The S5&#x27;s shots in the camera reviews I could find seem pretty consistently over saturated and blow out detail, especially in faces. It&#x27;s admittedly one of the best Android cameras I&#x27;ve seen. The 5S camera OTOH does seem less exposed in shaded shots. Maybe it&#x27;s just personal preference, but I feel like I&#x27;d rather preserve the detail and let Google Plus Photos Automagic Enhancement, or iPhoto Enhancement make a photo more punchy if necessary, than losing detail.<p>Plus I don&#x27;t take my kids to a lot of bars. So it&#x27;s important that under sunlight at the zoo the shots aren&#x27;t blown out. Under normal interior lighting conditions the iPhone seems to take the best pictures of people by far from the reviews I could find.<p>The G3 comes closest to meeting the requirements and earning the bonus of &quot;best out-of-box experience&#x2F;least crapware&quot;. Maybe that&#x27;s moving the goal-post a bit, but it&#x27;s still important to me in the same way it&#x27;s important to Nexus users. The Samsung... meh.<p>My biggest frustration with the G2 was slow charging and that <i>STUPID F</i>CKING MENU BUTTON*. I think the G3 is a definite improvement on both counts.<p>That&#x27;s my trouble with Android phones I guess. Lots of them have compelling features. But very few offer the whole package. It&#x27;s not so much Android vs iPhone at this point. It&#x27;s an LG G3 vs iPhone 6.<p>In that case, I think an iPhone 6 Plus with IOS8 wins on everything but price (it&#x27;s easily $300+ more expensive). For me. Simpler interface. Similar storage. Faster. Longer battery life. Quicker charging.<p>Don&#x27;t get me wrong, the G3 seems like a great value, and a legit alternative IMO. But I think the iPhone is the better package overall. I definitely prefer IOS&#x27;s navigation over the app-drawer&#x2F;menu in Android, I can count on 1 hand the number of times I found Google Now relevant or compelling over just using a Weather widget (I use Yelp, not Google, Passbook is better for Airlines IMO, but Google Now had the occasional suggestion for parks&#x2F;museums for the kids on the weekend, which was a nice surprise a few times).<p>This is just me. I&#x27;m a flip-flopper. ;-) But I figure others like myself might find talkin&#x27; it out useful. Or at least consider the LG G3. Which seems like the most Nexus-like device with the most complete package that I&#x27;ve seen on the Android side of the fence.<p>I also like the Day-1 software updates for iPhones though. They age much better IMO, and they&#x27;re supported much better. If you&#x27;re an off-contract user like myself, it might also be nice to know that the $300 price differential probably goes away when it&#x27;s time to trade it in. I just sold a G2 for $160 last night. That&#x27;s a 12 month old phone. I can sell my temporary backup iPhone 4S for the same price. A phone three times it&#x27;s age! Crazy.<p>Also, I&#x27;ve owned a Jeep Grand Cherokee, Nissan Leaf, and now Mazda 3. The iPhone Bluetooth or USB always works flawlessly with them. I&#x27;m lucky to get any Android phone I&#x27;ve used to connect 50% of the time. It feels like I have to reboot the phone more often than not.<p>Apparently this isn&#x27;t a problem for some people. But across different vehicles and different Androids I&#x27;ve found Bluetooth connections to be very flaky. So much that I don&#x27;t bother half the time unless I know I want to make a call on the drive home when I get in the car. Once a connection is established I&#x27;ve never had it disconnect that I can recall. It&#x27;s just that it won&#x27;t make the initial connection without a reboot. Turning on&#x2F;off Bluetooth or Airplane mode seems to have no effect. This is with a Moto X and LG G2.<p>Oh, but one thing I mentioned previously: iMessage. It&#x27;s hard to overstate how superior an experience it is forwarding the video you just recorded to another iPhone user. Hangouts is clunkier than iMessage and while I have a couple Android users in my family, getting them to figure out Hangouts so I can initiate a conversation with the right protocol so I can actually forward a video is something I haven&#x27;t been successful at yet. So I have to upload to Youtube instead and forward them a link. Which takes a minute or two instead of a few seconds. The difference in user-experience is night and day for a parent on the run...",
          "It&#x27;s less automated data analytics and more chart drawing and semantic knowledge base management tied to a federated search system.<p>Their principle competitor is <a href=\"http://www-03.ibm.com/software/products/en/analysts-notebook\" rel=\"nofollow\">http:&#x2F;&#x2F;www-03.ibm.com&#x2F;software&#x2F;products&#x2F;en&#x2F;analysts-notebook</a><p>They used to have a free trial you could run via java webstart on their website, but they&#x27;ve taken it down.<p>Here&#x27;s a video <a href=\"https://www.youtube.com/watch?v=f86VKjFSMJE\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=f86VKjFSMJE</a><p>It&#x27;s big data in the sense that using google&#x27;s search box is big data. But from my time using their demo a couple years ago, the actual tool is fairly small in focus. I don&#x27;t even think the chart view can show more than a few hundred things.",
          "Gas stations do advertise.  Fill in the blank &#x27;___ with Techron&#x27;.  You also see a list of gas stations at an interstate exit sign.  <a href=\"http://www.kentucky.com/2011/09/05/1869947/ads-at-interstate-exits-mean-revenue.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.kentucky.com&#x2F;2011&#x2F;09&#x2F;05&#x2F;1869947&#x2F;ads-at-interstate...</a>  (third immage bottom right.)<p>Anyway, there are lot&#x27;s of forms of advertizing.  From informative &quot;talk to your doctor about ED&quot;  to simply memorable. <a href=\"https://www.youtube.com/watch?v=pVcbasIb8lQ\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=pVcbasIb8lQ</a><p>However, the cultural inception idea is not about some sort of Pavlovian response. You don&#x27;t actually get to taste what&#x27;s for sale in a supermarket, so it&#x27;s an abstract choice.   And with little to no information to work off of you make a split second decision after split second decision which is draining.  In that situation simple familiarity is worth a lot.  Similarly, your not actually going to test drive every car in your price range on the market.<p>That said, signaling is a big part of advertising.  If nobody knows you just spent 20k on a watch it&#x27;s harder to justify the purchase.",
          "Groupon and YouTube are printing money now that they are public. Pinterest, Snapchat &amp; Instagram haven&#x27;t even tried to make money (ie, they are doing what I explained). Most or all of those small ones never grew fast enough to matter."
        ]
      },
      {
        "freq": 26,
        "name": "frequency",
        "topComments": [
          "I feel like Tom Scott did a great job summing up the frustrations dealing with time (zones) in his Computerphile video:<p><a href=\"https://www.youtube.com/watch?v=-5wpm-gesOY\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=-5wpm-gesOY</a>",
          "And to really drive the problem home, distributing binary packages for Linux is a complete nightmare. Linus Torvalds just laid out a whole bunch of the problems at DebConf14.\n<a href=\"http://www.youtube.com/watch?v=5PmHRSeA2c8\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=5PmHRSeA2c8</a><p>Go watch it. But some of the highlights:<p>- .deb vs .rpm misses the whole point. The problem is application writers just want to ship an application binary for &quot;Linux&quot;, but it is a nightmare.<p>- Except for the kernel which strives for ABI stability, everything else in the Linux distros constantly break binary compatibility, including the most important library, glibc.<p>- Package maintainers are forced to use shared libraries for everything, even packages that are unstable and not well used which means apps will break<p>- You can&#x27;t install packages under these systems as non-root<p>- He ships binaries for his SCUBA diving app for Windows and OS X. He only ships source for Linux. That&#x27;s sad.<p>As somebody who has to ship binaries for multiple platforms, including Linux, I agree it is sad, and I often have to do the rough equivalent of static linking. (I dynamically link and ship copies of the libraries.) This also allows my users to install without root access. But whenever I&#x27;m asked to look at using a native packager, I made to cry trying to figure out all the idiosyncrasies of each packaging system, and then all the variations between each distro release. (Fedora vs Debian vs Ubuntu, and 12.04 LTS is different than 13.10 and 14.04.)<p>As far as Apple development tools go. Heard of clang and llvm? A lot of Linux users have.",
          "We have been running a similar setup (Postgres -&gt; Foreign Data Wrappers -&gt; LLVM) at AdRoll for over a year. We keep 100TBs+ of raw data in memory, compressed.<p>We managed to build our solution mostly in Python(!) using Numba for JIT and a number of compression tricks. More about it here:<p><a href=\"http://tuulos.github.io/pydata-2014/#/\" rel=\"nofollow\">http:&#x2F;&#x2F;tuulos.github.io&#x2F;pydata-2014&#x2F;#&#x2F;</a><p><a href=\"https://www.youtube.com/watch?v=xnfnv6WT1Ng\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=xnfnv6WT1Ng</a>",
          "Well, 1968 was almost half a century ago.<p>And USSR is not the same thing as Russia. (Ukraine was unfortunately a part this godforsaken union, and was forced to fight on the side of the empire.) Needless to say, Russia did not invade Czechoslovakia by itself. USSR invaded Czechoslovakia. (If you want to put Russia in the subject, perhaps: Russia invaded Czechoslovakia with the help of its USSR union members.)<p>Again, Russia ≠ USSR.<p>Putin realizes this difference, which is why he employs these dirty tactics by lying that &quot;soldiers on vacation&quot; are volunteering to fight along side the terrorists in Ukraine. How these Russian soldiers on T-72 tanks entered Ukraine&#x27;s territory 20km in is beyond me. <a href=\"http://www.newsweek.com/2014/09/19/russian-soldiers-reveal-truth-behind-putins-secret-war-269227.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.newsweek.com&#x2F;2014&#x2F;09&#x2F;19&#x2F;russian-soldiers-reveal-t...</a> Kremlin claims they were lost. If they were indeed lost, this proves Russian army&#x27;s incompetence, otherwise it is another case against Putin and his imperialistic ambitions. Over time the pile of lies and lies gets bigger, and it starts to crumble. This pile of lies has grown and overgrown Putin (~&gt; 1.7m), and it is starting to lean towards him, and he has to pile some more and more lies to keep it from crumbling. But it is falling apart.<p>As Obama pointed out, Russia is only a &quot;regional power.&quot;\nThat region ends where Russian border begins, and this is what we are seeing in Eastern Ukraine: a failing Russian invasion along with a pile of &quot;bullshit&quot; to compensate for incompetence.<p>&gt; That&#x27;s bullshit. Quoting Euromaidan sourced &quot;news&quot; is worse than quoting RT.<p>As per Euromaidan, if you are not happy, perhaps I can entertain you with Ukraine&#x27;s own RT alternative: Ukraine Today (UT). You can watch it directly on youtube. (a little spoiler: it&#x27;s not funded by Kremlin nor by the CIA)<p><a href=\"https://www.youtube.com/ut\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;ut</a><p>It is quite impressive how quickly they sprung up as a functioning international TV channel. I didn&#x27;t know you could have a fully functional news station within a couple of months. But then again, we live in a new era, year 2014; not 1968.",
          "The Youtube video made by the guy who bends the 6 Plus with his hands shows that the weak point is at the volume slot. I think its a bit disappointing that ConsumerReports didn&#x27;t go into more detail.",
          "I mean, there are many ways to be satisfying in music. I am very satisfied by the exploration of texture and improvisation in modern music, for instance, and I am very grateful that we live in such an exciting time for musical experimentation. But at the same time, in a way that&#x27;s hard to describe, the moment where the theme returns in the third movement in Beethoven&#x27;s 5th[1] just absolutely trumps any musical moment I&#x27;ve heard in popular music. I&#x27;m talking Schindler&#x27;s List level goosebumps. There are plenty of long pieces in popular music, too — prog is big on that. But the techniques of Beethoven and ilk just aren&#x27;t getting used, which I think is a great shame. I don&#x27;t think it&#x27;s &quot;magic&quot; or &quot;genius&quot;. I really do think it&#x27;s a matter of harnessing the medium to its full potential, which might require more education in music theory than (in my experience) many musicians feel comfortable with.<p>I don&#x27;t think you need a long piece to develop motif. Look at something like &quot;Vocalise&quot;[2], or, heck, any of Bach&#x27;s Well-Tempered Klavier.<p>One of my teachers used to stress the original meaning of the word &quot;sublime&quot;. I think that&#x27;s what&#x27;s missing in modern music. A feeling of awe that leaves you speechless.<p>Zappa&#x27;s been on my to-do list for a while, I&#x27;ll have to give him a listen soon!<p>[1]: <a href=\"https://www.youtube.com/watch?v=jdvsRJL4Mtw\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=jdvsRJL4Mtw</a><p>[2]: <a href=\"https://www.youtube.com/watch?v=iBVkYGLEUpg\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=iBVkYGLEUpg</a>",
          "There&#x27;s a great little animation inspired by &quot;The Mysterious Stranger&quot;,[0] which is apparently part of a film called &quot;The Adventures of Mark Twain&quot;.[1]<p>[0] - <a href=\"https://www.youtube.com/watch?v=BpaRouocBes\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=BpaRouocBes</a><p>[1] - <a href=\"https://en.wikipedia.org/wiki/The_Adventures_of_Mark_Twain_%281985_film%29\" rel=\"nofollow\">https:&#x2F;&#x2F;en.wikipedia.org&#x2F;wiki&#x2F;The_Adventures_of_Mark_Twain_%...</a>",
          "I have seen youtubers who live off youtube with average video views of 20-30k per upload.<p>If an ad plays on 1&#x2F;10 videos, and each ad makes the person 0.1 cent its still (30 million * 0.1 * 0.1) &#x2F; 100 = 3 thousand dollars. Now take into account the added subscribers this adds which will make all future videos more profitable, and that I&#x27;m probably underestimating ad revenue, it is worth it.",
          "(For others that want to know more) An example of what a four point load test looks like: <a href=\"http://www.youtube.com/watch?v=thd01MjOTeA\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=thd01MjOTeA</a><p>With this type of test, it may have been able to show if the volume or SIM card slots create structure weak points.",
          "Leslie Lamport&#x27;s <i>Thinking for Programmers</i>:<p><a href=\"http://www.youtube.com/watch?v=4nhFqf_46ZQ\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=4nhFqf_46ZQ</a>"
        ]
      },
      {
        "freq": 24,
        "name": "frequency",
        "topComments": [
          "Agreed, the part where he says, &quot;... Piracy doesn’t pay artists a penny – nothing, zilch, zero.&quot; - I involuntarily muttered, &quot;Bullshit.&quot; out loud.<p>He should probably listen to Neil Gaiman&#x27;s story on how piracy can, indeed, make artists money:<p><a href=\"http://www.youtube.com/watch?v=0Qkyt1wXNlI\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=0Qkyt1wXNlI</a>",
          "Here is the making of:  <a href=\"https://www.youtube.com/watch?v=Ud9ON2CzYYM\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Ud9ON2CzYYM</a><p>&quot;You can&#x27;t scientific or Civilizational progress without impossible challenges&quot;<p>Also, awesome line:<p>&quot;The actual campaign idea is certainly well targeted, ... I&#x27;m very surprised you need something like this at all now.    Mankind sends a probe into space to catch a comet and land on it and we need a great director, film and actors to convince people this is interesting.&quot;",
          "There was a short documentary made about this: <a href=\"https://www.youtube.com/watch?v=4Q7FTjhvZ7Y\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=4Q7FTjhvZ7Y</a>",
          "Why is this so hard? They were the by the book power-geek company, measure, iterate, profit.<p>Search is more like a platform, not a product, so let&#x27;s look at GMail the first product that comes to mind, with the many gigabytes and proper IMAP&#x2F;POP3 access they went all in. Filtering and search, labels and labs, plus it meant people were always logged in even while searching and looking at ads on 3rd party sites (and even though Blogger is and older Google product, not everyone had a blogger account, and I don&#x27;t know how well integrated that was back in 2002-2003).<p>Then Maps, with all the bells and whistles. Analytics, you still can do arbitrary dimensions and metrics with it, drive it from a simple API, etc. Calendar, boldly supports ICAL, XML, RSS and so on.<p>And compared to these Google+ is <i>still</i> a trainwreck speeding ahead by the sheer force of will of Google. (Even Facebook switched back from the multi-column layout fast, because it&#x27;s unreadable.)<p>The overarching theme used to be making something very powerful for average users and cater to the power-users&#x2F;developers (who will then happily evangelize&#x2F;integrate-with the product). Lately Google does none of that. At least Google Wave had a nice API on launch day to write robots, G+ was just a HTML5 slideshow for months. (Now, even on 1440p when reading comments, even after clicking to show more than one, I have to scroll the comment section in a 518x430 box. Why?)<p>They have thousands of very capable engineers, and it&#x27;s great that now I can see the curvature of Earth in all its glory thanks to WebGL in Maps, but simply measuring distance just recently made a comeback.<p>RSS with PubSubHubbub, microformats and organic evolution of de facto standards would have been completely adequate for almost anything they wanted in this new sharing economy.<p>Though, to think of it, it sort of started when they elegantly neglected to make the profile (user data) path customizable in Chrome, and continued with the Real Name policy blunders on G+, and now YouTube subscriptions by default are completely useless too. (Because if you are not a simple user, but a channel of some sorts, your likes are not visible on your profile&#x2F;channel page - nor anywhere else as far as I can tell - but subscribers by default get notified of new content on the channel, then proceed to visit it, and find none. At least users can then tweak this in the well hidden clickable gear menu!)<p>It doesn&#x27;t take top pro exec Vic (or anyone) to fix bugs or provide more configurability. (In 2014, just 8 years after You were the person of the year, how fast You just became a wallet to milk.) Or if it does, then all the more power to the startups.",
          "Even if we don&#x27;t get an interview, going through the application process was a good exercise for us (<a href=\"https:&#x2F;&#x2F;www.morphmail.com&#x2F;\" rel=\"nofollow\">https:&#x2F;&#x2F;www.morphmail.com&#x2F;</a>). From the analytics report, it looks like 4 people from YC viewed our demo (YC-specific URL) and 1 actually sent a test message. YouTube says that the 1 minute video was viewed 8 times for 8 minutes total. So far good signs, but the real question is how many great applicants were at the top of the list. We&#x27;ll keep our fingers crossed!",
          "Their Youtube channel [0] is excellent, they really grab the attention of someone young about a large variety of topics, and they really make you want to keep watching their videos.<p>[0] <a href=\"https://www.youtube.com/user/Kurzgesagt\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;Kurzgesagt</a>",
          "It really seems like your complaint is more with the types of movements recommended vs. the duration.<p>At least.. it should be: I&#x27;ve seen and done many exhausting HIIT&#x2F;Crossfit-style workouts that last only 7 minutes yet wipe out even the most athletic people.<p>E.g.: here&#x27;s a 3 minute workout <a href=\"https://www.youtube.com/watch?v=pz9pXeLsmQk\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=pz9pXeLsmQk</a>",
          "While you might be &quot;technically&quot; correct...  <a href=\"https://www.youtube.com/watch?v=90qpDg5y7Lo\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=90qpDg5y7Lo</a>",
          "You know, at first, I really was like &quot;yee yee&quot; when I heard the news about reclassification of broadband as a regulated common carrier. YAH, we&#x27;re really stickin it to the man in the suit at Comcast and TWC!<p>It got me thinking... this is like, the nuclear option. Innovation around telephony stagnated. Since everyone and everything was the exact same, there was no need for innovation and competition was pretty much illegal. I&#x27;m not so sure I want the same for broadband. I&#x27;m starting to think it&#x27;s not such a good idea.<p>Ideally, we need some middle ground. TWC shouldn&#x27;t be able to slow youtube down because it competes with their cable business. Actually no one should be able discriminate based on content, period. We should maybe think about classifying ISPs and Transit providers as official legal terms, and the types of contracts you&#x27;re allowed to enter depend on what type of business you are.<p>Anyway, flame away, I know this won&#x27;t be a popular opinion. But that&#x27;s my thoughts on the subject currently",
          "It will be interesting seeing Uber like services go up against the Australian Taxi cartel. I would expect similar antics...<p><a href=\"http://www.youtube.com/watch?v=_7WdSFS3SFI\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=_7WdSFS3SFI</a>"
        ]
      },
      {
        "freq": 29,
        "name": "frequency",
        "topComments": [
          "If there is a kernel privilege escalation then SELinux can be disabled as Spender loves to demonstrate <a href=\"https://www.youtube.com/watch?v=WI0FXZUsLuI\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=WI0FXZUsLuI</a> GRSec does includes it&#x27;s own MAC system as an alternative to SELinux but that is only a small part.<p>PaX&#x2F;grsec is in a different class of mitigation. I don&#x27;t really know any competitors besides other implementations of small subsets by different operating systems or hardware manufacturers.<p>To your other point, I don&#x27;t think anyone who has been following Linux security for any amount of time thinks that Spender or PaX are in need of proving themselves.",
          "Even if you ignore JFK, a good case can be made that the security agencies (probably FVEY?) currently seem to have at least <i>de facto</i> control basically anywhere they want. Exercising that control got a lot easier - and less obvious - as technology became available. Traditional informants and enforcers sometimes get noticed, but JOIN...WHERE user.id=foo across phone location data is very hard to discover.<p>The key part, I think, is that COINTELPRO ended in name only. Worse, as the use of the internet increased, the number of times I&#x27;ve had to consider &quot;JTRIG-style disruption, paid corporate shill, or useful idiot&quot; has increased dramatically.<p>While a &quot;silent coup&quot; is one possibility, I have been liking how Dan Geer&#x27;s described[1] the high-level picture of our situation as a <i>Cold Civil War</i>. Cold wars are fought by proxy, and there has been a lot of pointer-chasing to trace in the modern political situation.<p>[1] <a href=\"https://www.youtube.com/watch?v=nT-TGvYOBpI\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=nT-TGvYOBpI</a> ( <a href=\"http://geer.tinho.net/geer.blackhat.6viii14.txt\" rel=\"nofollow\">http:&#x2F;&#x2F;geer.tinho.net&#x2F;geer.blackhat.6viii14.txt</a> )",
          "+1  This is a better answer... if they could do the CTA in Chicago first that would be great:<p><a href=\"https://www.youtube.com/watch?v=elMXt00xyIU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=elMXt00xyIU</a>",
          "Agreed, i was just about to say the same thing with this vid:\n<a href=\"https://www.youtube.com/watch?v=qkA0YdNEsqU\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=qkA0YdNEsqU</a>",
          "YouTube targeting is a lot more accurate than TV targeting...",
          "It&#x27;s also how they tried to mislead the public by saying NSA only collects &quot;4 percent&quot; of the world&#x27;s data&quot; or something - but &quot;forgot&quot; to mention that data could be emails, chats and urls (essentially the content itself), while the majority of the data is stuff like Youtube&#x2F;Netflix content and torrents.",
          "People generally learn English as a second language early in school in non-anglophone developed countries, and put it to use right away. That&#x27;s the #1 language for web content, games, movies&#x2F;youtube, music etc. Also lets you access jobs and education  ouside your own country.",
          "Ok, on a PC so here&#x27;s a little more detail:<p>In theory, aerospike engines are pretty efficient at nearly any altitude. It has to do with the pressure and temperature variations as the rocket travels through the atmosphere. (There are pockets of isothermal regions, or regions where the temperature is the same in the atmopshere, and there are pockets where the temperature varies; therefore the Mach number varies). The atmospheric pressure and temperature affect the flame of the aerospike and act like a &quot;variable&quot; nozzle.<p>Aerospikes aren&#x27;t as popular because,<p>1) they&#x27;re heavy. more deadweight mass on a launch vehicle is a big no no. By deadweight I mean everything on the launch vehicle that doesn&#x27;t contain the a) payload b) propellant. Because once you burn out (or run out of propellant), usually that&#x27;s when you stage (or separate) your payload from the launch vehicle. At that point, the launch vehicle is useless; deadweight.<p>2) they require a massive amount of cooling: you&#x27;re basically heating up a piece of metal to launch temperatures during the launch sequence. You have to make sure your &quot;spike&quot; doensn&#x27;t melt.<p>3) There is a bunch of research and development into other cheaper alternatives, and we already <i>have</i> cheaper and efficient alternatives. This basically pushed aerospikes to the &quot;novelty&quot; category. I&#x27;m sure if there was a big technological &quot;push&quot; for aerospikes I&#x27;m sure we could get something that&#x27;s more efficient but that research and time will cost more than to just use the rockets we have now.<p>ADDENDUM; here&#x27;s a video from Rocketdyne explaining aerospike engines: <a href=\"https://www.youtube.com/watch?v=EWf4iOMSPNc\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=EWf4iOMSPNc</a>",
          "Remarkably, YouTube makes scripting downloads very easy.  The script below needs only sed and some http client and it has worked for years.  I have only had to change it once when there was a change at YouTube; the change was very small.<p><pre><code>   # this script uses sh, sed, awk, tr and some http client\n   # here, some http client = tnftp\n   # awk and tr are optional\n   \n   \n   # wrapper for tnftp to accept urls from stdin\n   ftp1(){\n   while read a;do \n   ftp ${@--4vdo-} &quot;$a&quot; \n   done;}\n   \n   \n   # uniq\n   awk1(){ awk &#x27;!($0 in a){a[$0];print}&#x27; ;}\n   \n   \n   # some url decoding\n   f1(){\n   sed &#x27;\n   s,%3D,=,g;\n   s,%3A,:,g;\n   s,%2F,&#x2F;,g;\n   s,%3F,?,g;\n   s&#x2F;^M      \n   &#x2F;&#x2F;g;\n   #  ^ thats Ctrl-V then Ctrl-M in vi   \n   &#x27; \n   }\n   \n   # remove redundant itags\n   f0(){\n   sed -e &#x27;\n   s&#x2F;&amp;itag=5&#x2F;&#x2F;;t1\n   s&#x2F;&amp;itag=1[78]&#x2F;&#x2F;;t1\n   s&#x2F;&amp;itag=22&#x2F;&#x2F;;t1\n   s&#x2F;&amp;itag=3[4-8]&#x2F;&#x2F;;t1\n   s&#x2F;&amp;itag=4[3-6]&#x2F;&#x2F;;t1\n   s&#x2F;&amp;itag=1[346][0-9]&#x2F;&#x2F;;t1\n   &#x27; -e :1\n   }\n   \n   # separate urls \n   f2(){\n   sed &#x27;\n   s,http,\\\n   &amp;,g&#x27; \n   }\n   \n   # remove unneeded lines\n   f3(){\n   sed &#x27;\n   #&#x2F;^http%3A%2F.*c.youtube.com&#x2F;!d;\n   &#x2F;^http%3A%2F.*googlevideo.com&#x2F;!d;\n   &#x2F;crossdomain.xml&#x2F;d;\n   s&#x2F;%25&#x2F;%&#x2F;g;\n   s,sig=,\\&amp;signature=,;\n   s,\\\\u0026,\\&amp;,g;\n   &#x2F;&amp;author=.*&#x2F;d;\n   &#x27; \n   }\n   \n   \n   \n   # separate cgi arguments for debugging\n   f4(){\n   sed &#x27;\n   s,%26,\\\n   ,g;\n   s,&amp;,\\\n   ,g;\n   &#x27; \n   }\n   \n   # remove more unneeded lines\n   f5(){\n   sed &#x27;\n   &#x2F;.&#x2F;!d;\n   &#x2F;quality=&#x2F;d;\n   &#x2F;type=&#x2F;d;\n   &#x2F;fallback_host=&#x2F;d;\n   &#x2F;url=&#x2F;d;\n   &#x2F;^http:&#x2F;!s&#x2F;^&#x2F;\\&amp;&#x2F;\n   &#x2F;^[^h].*:&#x2F;d;\n   &#x2F;^http:.*doubleclick.net&#x2F;d;\n   &#x2F;itag.*,&#x2F;d;\n   &#x27;\n   }\n   \n   # print urls \n   f6(){\n   sed &#x27;s&#x2F;^http:&#x2F;\\\n   &amp;&#x2F;&#x27; | tr -d &#x27;\\012&#x27; \\\n   |sed &#x27;\n   s&#x2F;http:&#x2F;\\\n   &amp;&#x2F;g;\n   &#x27; \n   }\n   \n   f8(){\n   sed &#x27;s&#x2F;https:&#x2F;http:&#x2F;&#x27;\n   }\n   \n   FTPUSERAGENT=&quot;like OSX&quot;\n   \n   case $# in\n   0) \n   echo|$0 -h \n    ;;\n   [12345])\n   case $1 in\n   \n   -h|--h)\n   echo &quot;url=http[s]:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=...........&quot;\n   echo usage1: echo url\\|$0 -F \\(get itag-no\\&#x27;s\\)\n   echo usage2: echo url\\|$0 -g \\(get download urls\\)\n   echo usage3: echo url\\|$0 -fitag-no -4o video-file\n   echo N.B. no space permitted after -f\n   \n    ;;\n   -F)\n   $0 -g \\\n   |tr &#x27;&amp;&#x27; &#x27;\\012&#x27; \\\n   |sed &#x27;\n   &#x2F;,&#x2F;d;\n   &#x2F;itag=[0-9]&#x2F;!d;\n   s&#x2F;itag=&#x2F;&#x2F;;\n   &#x2F;^17$&#x2F;s&#x2F;$&#x2F; 3GP&#x2F;;\n   &#x2F;^36$&#x2F;s&#x2F;$&#x2F; 3GP&#x2F;;\n   &#x2F;^[56]$&#x2F;s&#x2F;$&#x2F; FLV&#x2F;;\n   &#x2F;^3[45]$&#x2F;s&#x2F;$&#x2F; FLV&#x2F;;\n   &#x2F;^18$&#x2F;s&#x2F;$&#x2F; MP4&#x2F;;\n   &#x2F;^22$&#x2F;s&#x2F;$&#x2F; MP4&#x2F;;\n   &#x2F;^3[78]$&#x2F;s&#x2F;$&#x2F; MP4&#x2F;;\n   &#x2F;^8[2-5]$&#x2F;s&#x2F;$&#x2F; MP4&#x2F;;\n   s&#x2F;.*?&#x2F;&#x2F;;\n   &#x27;|awk1\n    ;;\n\n   -g)\n   while read a;do\n   n=1\n   while [ $n -le 10 ];do\n   echo $a|f8|ftp1||\n   echo $a|f8|ftp1 &amp;&amp;\n   break\n   n=$((n+1))\n   done \\\n   |f2|f3|f1|f0|f4|f5|f6|f1|sed &#x27;&#x2F;itag=&#x27;&quot;$2&quot;&#x27;&#x2F;!d&#x27;\n   done\n    ;;\n\n   -f*)\n   while read a;do\n   n=1\n   while [ $n -le 10 ];do\n   echo $a|$0 -g ${1#-f} |ftp1 $2 $3 $4 $5 ||\n   echo $a|$0 -g ${1#-f} |ftp1 $2 $3 $4 $5  &amp;&amp; \n   break\n   n=$((n+1))\n   done\n   done\n    ;;\n\n   esac\n   esac\n\n</code></pre>\nThere are separate scripts for extracting www.youtube.com&#x2F;watch?v=........... urls from web pages to feed to this script.",
          "Love this visualization. Ben usually references it every day on <a href=\"https://www.youtube.com/user/Suspicious0bservers\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;user&#x2F;Suspicious0bservers</a>"
        ]
      },
      {
        "freq": 34,
        "name": "frequency",
        "topComments": [
          "I thought that was just a technical limitation to prevent abuse of resources, rather than a deliberate part of the concept of YouTube.",
          "You might be surprised how fake the real thing can look:<p><a href=\"https://www.youtube.com/watch?v=Ow-dDfarZuY\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Ow-dDfarZuY</a><p>I&#x27;d say without a doubt that shots like 0:25 or 3:00 were CGI...",
          "Strictly speaking, GoGo&#x27;s service isn&#x27;t capable of handling streaming, but it&#x27;s not clear to what extent bandwidth is the limiting factor. Really bad bufferbloat does horrible things to goodput. With proper QoS, it&#x27;s likely that they could sustain at least one or two low-resolution YouTube streams, just not a whole plane full. Terrestrial ISP&#x27;s can&#x27;t handle everyone watching video at the same time, either.<p>Jim Gettys reported on the CeroWrt-devel list that he tried to benchmark the in-flight Internet connection on a United flight to Hawaii last November, and it apparently crashed the connection. The routers and accompanying software being used for these systems are probably of exceedingly low quality.",
          "In much of the developed world the fertility (children per woman) is barely the (slightly over) 2.0 required to sustain the population. Countries where, say, 1.0 children are born per woman is having a rapidly shrinking population, but more seriously a rapidly <i>aging</i> population where a smaller number of working people supports a larger and larger number of elderly.<p>If a country wanted to have a shrinking population, it would likely want a fertility rate of just below 2. Japan has 1.41 (!) and barely any immigration.<p>The solution to global population issues is making sure that poor countries with high fertility rate (4-7) are brought down to 2-2.5, something which is already happening very quickly. See e.g. Hans Rosling&#x27;s famous talks: <a href=\"https://www.youtube.com/watch?v=GeXJnOE-1gw\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=GeXJnOE-1gw</a><p>The solution to the low fertility rate is likely hard to change short term (cultural), but comparing countries in europe for example, it seems likely that making children reforms such as subsidized day-care, free higher education etc. would help.",
          "The Mozilla-Yahoo deal could turn out to be mutually beneficial in that regard. Yahoo for example has started to recommend Firefox to its users [1].<p>And Yahoo&#x27;s market share should not be underestimated. On the list of most popular destinations, according to traffic rankings yahoo.com is number 4, being beaten only by google.com, facebook.com and youtube.com. And somehow Marissa Mayer has been turning the tide and I&#x27;ve seen positive things happening. For example I&#x27;m happy that they started developing Flickr again. Perceptions can change overnight and Google can certainly lose some more market share.<p>I just hope that Yahoo! &#x2F; Bing will improve their search for non-US users. Sadly for me Google provides the best search results and it&#x27;s not even a competition. And it makes me sad, because while search engines are easily configurable in Firefox, I would have liked to support Mozilla indirectly with my searches and those of my acquaintances to which I&#x27;m recommending Firefox (pennies I know, but they add up).<p>[1] <a href=\"http://techcrunch.com/2014/12/12/yahoo-starts-prompting-chrome-users-to-upgrade-to-firefox/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;12&#x2F;12&#x2F;yahoo-starts-prompting-chro...</a>",
          "Discussion about the YouTube video: <a href=\"https://news.ycombinator.com/item?id=8793773\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8793773</a> (5 points, 1 hour ago, 0 comments)<p>Discussion about the googleblog post: <a href=\"https://news.ycombinator.com/item?id=8793575\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8793575</a> (77 points, 1 hour ago, 26 comments)",
          "The PC version they used to give out in cereal boxes was a lot of fun. I can&#x27;t tell if it was &quot;Monopoly 3&quot; or &quot;Monopoly New Edition&quot;, but I still remember the intro: <a href=\"https://www.youtube.com/watch?v=7DuXg9kP0do\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=7DuXg9kP0do</a><p>My brother and I played it together for hours. The computer opponents put up a challenge and were quite smart—you could do trades with them, which they would accept or reject depending on the situation; sometimes they would even offer you a trade on their own. Each piece had its own personality, animations, and voice clips. I think it might have had online play, too.",
          "What projects on the scale&#x2F;complexity of Photoshop are implemented in Python?  Possibly large chunks of Youtube or Dropbox?<p>I love Python for small scripts, and even don&#x27;t regret it too much for programs with mild complexity (~5000 lines of Python), but the lack of explicit typing makes figuring out what any given function&#x2F;class does pretty hard.  What are the arguments?  What do they do?  What does the return type do?  Where is this thing initialized?  Finding the answers to those kinds of questions are greatly aided by an IDE&#x2F;source code browsing that is anchored by types.",
          "Would you mind sharing the reason why YouTube shut you down or a list of rules that are easy to break?<p>My boss is adamant to move some of our video (days of footage per project, multiple projects per year) to YouTube and I couldn&#x27;t find a hard reason not to do it. \nSupposedly YouTube won&#x27;t display ads if the videos are unlisted or private.",
          "I would also add listening to music, browsing Reddit (default subs, not technical ones), watching YouTube (viral videos and similar things, again, not technical videos) to the list of things that one can do before taking the leap and moving to an English speaking country."
        ]
      },
      {
        "freq": 35,
        "name": "frequency",
        "topComments": [
          "Basically, yes. She points it out pretty clearly in <a href=\"http://zoekeating.tumblr.com/post/108898194009/what-should-i-do-about-youtube\" rel=\"nofollow\">http:&#x2F;&#x2F;zoekeating.tumblr.com&#x2F;post&#x2F;108898194009&#x2F;what-should-i...</a><p>There are some additions:<p>2a) … The release on Youtube must happen at the same time and in a specified quality.<p>2b) … Everything that has been uploaded by her before will be deleted.<p>The obligation to release on Youtube is of course completely unacceptable. I like to think it would be quite illegal in many countries outside the US as well.",
          "Wikipedia defines a monopoly as &quot;when a specific person or enterprise is the only supplier of a particular commodity&quot;<p>If YouTube is a monopoly, what is the commodity in question?",
          "The Oblique Strategies cards get a mention in this cartoon about Bowie and Eno recording Low:<p><a href=\"https://www.youtube.com/watch?v=FODvjYoVEi8\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=FODvjYoVEi8</a>",
          "This isn&#x27;t how it will happen.  The basic package will give you access to these sites, but crappy access.  Youtube, Netflix, et. al. will skip, webpages will load more slowly, etc.  Meanwhile sites owned by the parent company of the ISP will be as smooth as butter.<p>That way it&#x27;s not people calling up their ISPs saying &quot;Why can&#x27;t I access youtube?&quot; instead it&#x27;s people saying &quot;I watch  comvericastTube since it&#x27;s so much faster than youtube&quot;",
          "OP&#x27;s video doesn&#x27;t really have anything to do with drones as such, just loads an mp4 of drone footage. The fact that it&#x27;s drone footage is completely incidental.<p>But lots of people are doing real computer vision and object tracking on drones and robots, and have been doing for years.<p><a href=\"https://www.youtube.com/watch?v=Gj-5RNdUz3I\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=Gj-5RNdUz3I</a><p><a href=\"https://www.youtube.com/watch?v=HqzMSxBOV-U\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=HqzMSxBOV-U</a><p><a href=\"https://www.youtube.com/watch?v=C95bngCOv9Q\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=C95bngCOv9Q</a>",
          "I think the value proposition of Disqus is just comparatively low maintenance. You include a snippet of JS and you get a minimally functional commenting system that includes antispam and requires running no backend server software or security risks. In return Disqus gets analytics and a little bit of ad space. It&#x27;s not imo going for discussion, it&#x27;s meant to be flypaper for readers who get a good-feelings boost thinking they&#x27;re being heard, so it&#x27;s a monetization tool more than anything. The extreme end of this is Youtube comments, which accumulate so fast and so voluminously that actual discussion is near impossible, and the limited nesting actively fights replying. You can&#x27;t follow anything. But millions of people pile their worthless comments into the void because it feels good to have your say. Old, crusty ugly forums are better for conversation than new, shiny JS comment systems because they were actually made for conversation, that was their raison d&#x27;etre.<p>Have you tried Discourse? It&#x27;s almost as good as the hype.<p>So this is kind of related. I&#x27;ve been reading OSNews since the very beginning, and I really, really love it. It used to beat out Slashdot for me, which is about the highest praise I could give a site. In large part it&#x27;s because it covered stuff I couldn&#x27;t see anywhere else and the commenters were positive and knowledgeable. But in the last few years there are so many articles about non-OS political stuff, which in turn causes fighting in the comments. Don&#x27;t underestimate that the types of articles published determines the type of commenters :-(",
          "Heya, sorry for the delay. I got swamped with messages :(<p>I suppose your points about Opera are fair. It&#x27;s just that even the Opera team made it very clear to me that I should only be providing screenshots using the newer version of Opera. I figured that the old version was all but dead, so why mention it?<p>That said, I&#x27;ll throw it in on future publications + add it to the website when the user is browsing w&#x2F; Opera.<p>You can import playlists by going opening the left-side panel, clicking &#x27;Create Playlist&#x27; and then copy&#x2F;pasting a YouTube URL into the 2nd input which says &#x27;URL&#x27;. However, I&#x27;ve come to learn that this is totally not intuitive from the number of times I&#x27;ve had to answer that in the past few days. I&#x27;ve logged a GitHub issue to rework it and make it more intuitive and obvious. Sorry about that.",
          "I run <a href=\"https://sysadmincasts.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;sysadmincasts.com&#x2F;</a>, which is a weekly bite sized screencast for sysadmins. Also posted to Show HN a while ago [1]. I can tell you that my inbox is flooded with &quot;Thank You&quot; messages, and requests to put out more content, I am struggling to keep up! As patio11 put it, if you can say: <i>&quot;I&#x27;ll save you 12 hours of Googling and reading Free Information On The Internet (TM) and it will cost you $50&quot;</i> [2], you can make money. There is just so much text content out there, and not very many high quality videos, so there is a major void in the market. Shane Smith (creator of VICE) talks about how he is creating tons of video content, and text is pretty much toast [3], well worth a watch, just think about how this applies to the tech education space.<p>I am not doing anything unique or novel though, there are countless sites that I have learned from, railscasts.com, railstutorial.org, egghead.io, laracasts.com, gorails.com, etc. Granted, so far this has all been free, and I have not started to monetize yet, but I do have traction, and see a clear need. So, take that for what it&#x27;s worth. Very happy to have any feedback, or answer questions, just shoot me an email (see profile). Also, if you have a talent in a particular area, I would highly suggest thinking about how to share that via video with other people.<p>[1] <a href=\"https://news.ycombinator.com/item?id=8011081\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8011081</a><p>[2] <a href=\"https://news.ycombinator.com/item?id=8508187\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=8508187</a><p>[3] <a href=\"https://www.youtube.com/watch?v=3qHjln3yZFs\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=3qHjln3yZFs</a>",
          "You&#x27;re confusing Firefox Hello with WebRTC. Let me explain by analogy with a video codec:<p>For video, Firefox contains a video codec. Surfing to YouTube lets the YouTube <i>web page</i> play video. Firefox does not contain a &quot;Youtube Player&quot;.<p>That&#x27;s exactly the opposite of what they have done here. They have added basically added a &quot;Telefonica WebRTC Player&quot;. That&#x27;s wrong. They should have added WebRTC generically so that you go to a web page at Telefonica to use it. Or better yet, use it with a server you trust.",
          "&gt;This seems to be strong evidence that government is better at keeping trade free than an &#x27;unregulated free market&#x27;?<p>X isn&#x27;t perfect, so Y must be better?  That makes no sense.<p>I&#x27;m pro-free market because I go into the grocery store and see an entire row of bread.  In communism, there is an entire row of people waiting for bread.  Free market == abundance, government == rationing.<p>I use communism as the example because it is the opposite of free-market and highlights the historical (not ideological) differences between the two systems.  Free markets have a triage effect.  When supplies are limited, prices go up, and if you really need something you can still get it (but you&#x27;ll pay more).<p>The opposite of that system is one of price fixing and rationing.  You may need something more than me, but the price is fixed at X, so there needs to be a lottery to decide who gets the limited supply.  If I win, I get to watch fail videos on youtube all day.  If you win, you get to run your online business that day.<p>ISPs are struggling to keep up with demand.  They&#x27;ve been trying to price their services in a way to triage demand while they build more capacity (which is mostly held up by local governments).  Now the FCC will step in and make sure that I can watch my youtube videos all day and make it illegal for the ISP to favor your clearly more important traffic."
        ]
      }
    ],
    "positive": 0.5581395348837209,
    "negative": 0.046511627906976744,
    "neural": 0.3953488372093023
  },
  {
    "theme": "google translate",
    "frequencies": [
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.9214500784874,
    "negative": 0.07854986935854,
    "neural": 0
  },
  {
    "theme": "google scholar",
    "frequencies": [
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.86889636516571,
    "negative": 0.13110360503197,
    "neural": 0
  },
  {
    "theme": "google map",
    "frequencies": [
      {
        "freq": 6,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 7,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 4,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.5333333333333333,
    "negative": 0.06666666666666667,
    "neural": 0.4
  },
  {
    "theme": "google glass",
    "frequencies": [
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 3,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 3,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.5,
    "negative": 0,
    "neural": 0.5
  },
  {
    "theme": "google docs",
    "frequencies": [
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.3333333333333333,
    "negative": 0.08333333333333333,
    "neural": 0.5833333333333334
  },
  {
    "theme": "google car",
    "frequencies": [
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.3333333333333333,
    "negative": 0,
    "neural": 0.6666666666666666
  },
  {
    "theme": "google cache",
    "frequencies": [
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 0,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 1,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.2,
    "negative": 0,
    "neural": 0.8
  },
  {
    "theme": "gmail",
    "frequencies": [
      {
        "freq": 20,
        "name": "frequency",
        "topComments": [
          "&gt; somehow if you login to Gmail you are logged in to the browser<p>What do you mean? Can you be more explicit?",
          "Existing setups are okay, I think - it&#x27;s only for new email accounts.<p>In general it seems like a huge change - gmail was a useful email client",
          "better coverage: <a href=\"http://googleonlinesecurity.blogspot.com/2014/09/cleaning-up-after-password-dumps.html\" rel=\"nofollow\">http:&#x2F;&#x2F;googleonlinesecurity.blogspot.com&#x2F;2014&#x2F;09&#x2F;cleaning-up...</a><p>(slate also has better coverage if you still need the clickbait headline[1])<p>[1] <a href=\"http://www.slate.com/blogs/future_tense/2014/09/10/gmail_password_hack_russian_bitcoin_forum_leaks_credentials_but_most_google.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.slate.com&#x2F;blogs&#x2F;future_tense&#x2F;2014&#x2F;09&#x2F;10&#x2F;gmail_pas...</a>",
          "I think your UX and other unique features should be so compelling that customers <i>want</i> to use your system (over than Adium or Pidgin).<p>Think GMail for example. It&#x27;s got full IMAP and POP3 support, and people who want to use a mail client are free to do so. If they do (and I assume many people do), then Google doesn&#x27;t get to serve ads to them. But Google still gives you the freedom to choose. And they&#x27;ve succeeded in alluring even the nerdiest of people to their web app.<p>In short, let your users decide. Make your UI so awesome that they want to use it. Having XMPP support will actually <i>draw many customers</i> to your service, since it&#x27;s something that not all competing services offer.",
          "Is it? I used to use it, but one day it mysteriously switched from &quot;you can place phone calls through gmail!&quot; to &quot;oh, you want to make a phone call? You need to install our browser extension&quot;, which I never did.",
          "For many years, i have tried many things:<p>- Apps such as Wonderlist, Clear...<p>- Entries in my GMail Calender<p>- Notes App on my Phone<p>- Post-it notes<p>- Writing reminder emails to myself<p>At the end of the day, nothing really worked for me.\nWhat DID work for me: a Whiteboard on my front door.<p>I have all my project ideas, to-do lists and appointments on there.",
          "In 2011 I created a JavaScript to do exactly what CSS Shapes do: <a href=\"https://github.com/Ivanca/Creative-Text-Boxes\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;Ivanca&#x2F;Creative-Text-Boxes</a>, it even works in IE6+. It had a domain but due to lack of interest is now gone but there is still a copy here: <a href=\"http://nyudvik.com/ctb/\" rel=\"nofollow\">http:&#x2F;&#x2F;nyudvik.com&#x2F;ctb&#x2F;</a> , it has a GUI tool to generate the code for any shape: <a href=\"https://www.youtube.com/watch?v=iZ0_wxz5WQM\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=iZ0_wxz5WQM</a><p>Off-topic: I&#x27;m looking for a remote part-time job as JavaScript Developer, if anyone is interested write me an email (ivanca@gmail)",
          "SEEKING WORK - Remote, based in Los Angeles<p>Hi, I am a successful startup co-founder, ex-CTO, full stack developer. I can help you to quickly build or scale your MVP.<p>Skills:\nApp Development - Ruby on Rails, RSpec, TDD, Angular.js, Node.js, D3.js, Jasmine, Bootstrap, Foundation, HTML5, CSS3. \nBig Data - Hadoop, HBase, Cassandra, Storm, Kafka, Machine Learning. \nMarketing and growth hacking. \nStartup advisement.<p>Availability through October is 15-20 hours&#x2F;week.<p>Rate - $150&#x2F;hr.<p><a href=\"http://www.linkedin.com/in/bennettneale/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.linkedin.com&#x2F;in&#x2F;bennettneale&#x2F;</a><p>bennett.neale at gmail.com<p>Cheers,\nBennett",
          "Location: San Francisco Bay Area<p>Remote :No.<p>Willing to Relocate : Yes.<p>Technologies: Java,C++, C#, Python,JavaScript,PostgreSQL, Cassandra.<p>Email :kodeseeker@gmail.com<p>Experienced software engineer with a master&#x27;s degree in Computer Science. Have both Startup and professional world experience  in Java, PostgreSQL and JS. Im looking for challenging engineering opportunities.<p>Resume : Available upon Request.",
          "I am still in Berlin, but couldn&#x27;t find your e-mail address.<p>Entra em contato comigo, meu endereço é adelgado1313arrobagmailpontocom."
        ]
      },
      {
        "freq": 12,
        "name": "frequency",
        "topComments": [
          "Google Now does the same with commute times, and seems to automatically work out where you live and work. Same with appointment reminders, assuming you added a specific location to your calendar event - it&#x27;s a bit hit and miss for me whether these reminders actually come up, but sometimes it tells me &quot;Leave now to get to this appointment on time&quot;.<p>Things like these are a much more useful part of it than voice detection, I very rarely interact with it via voice, and tend to just do searches through my normal browser. It also hooks into Gmail and can give you reminders about things like flights you&#x27;ve booked, although that raises questions about privacy, and whether you really want Google to be trawling through your emails.",
          "I&#x27;d like to beta test your app as well! meng.tan [at] gmail. Thanks in advance!",
          "It&#x27;s stated pretty clear on the page, isn&#x27;t it? But if you are asking if there is an approval screen, than yes, there is. It&#x27;s a regular OAuth2 token, and I make use of Google Contacts API. Naturally, I don&#x27;t really have access to your Gmail...",
          "&quot;jtfairbank+hn&quot; &#x2F;at&#x2F; gmail &#x2F;dot&#x2F; com",
          "While Gmail sessions are fairly long-lived, I wouldn&#x27;t say that this is an example of a site with low security demands. Email is pretty sensitive.",
          "Maybe allowing users to have multiple API tokens, that way you have one for IFTTT and another for each service you set up. Gmail does something similar to this btw.<p>Although I agree with you, there&#x27;s a good chance that people who reuse passwords do so because they don&#x27;t want to remember usernames&#x2F;passwords everywhere and by forcing the user to go get their API-token it&#x27;s just making things harder for them again. But, maybe this just isn&#x27;t a problem for Pinboard users.<p>Too bad about OAuth, it does solve both problems above. :)",
          "Paul, Conspire co-founder and CTO, here. Thanks a lot for the feedback.<p>I understand granting &quot;manage my email&quot; access is a big step. Unfortunately, Gmail&#x2F;Google Apps IMAP access is currently all-or-nothing. All we need to understand the network is read-only access to message headers--not including subject line--but we&#x27;re forced to ask for everything.<p>The new Gmail API, <a href=\"https://developers.google.com/gmail/api/\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;gmail&#x2F;api&#x2F;</a>, adds a read-only (but not a read-only-headers) permission. We&#x27;re looking forward to making the switch, but right now the performance difference between the Gmail API and plain IMAP is prohibitive. More on that here: <a href=\"http://blog.conspire.com/post/100016691078/why-we-arent-using-the-gmail-api-yet\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.conspire.com&#x2F;post&#x2F;100016691078&#x2F;why-we-arent-usin...</a>.",
          "This is a cost saving measure with a good PR component to it. Its expensive to comply with requests and uses up important resources. By taking the technical ability out of the equation for getting into the device itself Apple is saving itself time money and resources and looking good to the public for doing so with no legal damages.<p>This does not actually fully protect any ones data though. Government has full access to the cell phone companies that can with warrant provide location information including dates and times, SMS information, and can still monitor any un-encrypted traffic from a users phone. At worst Apple is providing a false sense of security to individuals that do not understand the other part of the equation, which is the Cell Phone companies and the Interweb can monitor and log stuff. But I do believe Apple that iMessage, FaceTime and the device itself is not intentionally open for spying on. But what about the other apps. Whatapp, and Blackberry messenger and Skype and all the other apps that sends data to 3rd parties. None of that is protected. But Apple only ever talks about itself not 3rd party. Take a iPhone and use only Apple software on it you will probably have the best protection in the industry for consumers. But its limited to that.<p>END OF REPLY -------------------------------------<p>----Start of slightly off topic but still on topic rant -----<p>Apples business model isn&#x27;t based on data either. So when they say they don&#x27;t scan your emails to profit from it I believe them. They are probably the only major ecosystem that does not need to do that. Yahoo Mail, Outlook (hotmail) mail, Gmail all have business models that provide a free service in exchange for your information. Its rooted into how they make money. Apple makes money from the sale of Hardware and direct cost services.<p>At the end of the day anything NOT in your head is exposed and a potential security risk. Even writing something on paper creates something to be discovered. Not putting thoughts into a tangible readable and accessible form is the first line of personal security. Followed by absolute control of what ever you do put those thoughts onto. Paper, paper goes in pocket. Paper is burned when no longer needed.<p>Computer, no wifi, no blue-tooth, no always on connection in your physical possession is as secure as you will get with encryption in case you lose physical possession. A smart phone can reach this level of security but defeats all of the abilities it which makes it a smart phone. You can disable data and wifi and use the phone only as a phone but at that point why do you even bother owning it.<p>As the CEO of Google once said, if its something that can hurt you don&#x27;t do it. In this case don&#x27;t make a record of it. Dont take pictures, dont text about it, don&#x27;t use a calender to plan it out. Keep it in your head. No one ever takes responsibility for there own stupidity when it comes to security. Go back to a book and pen if you are worried. But that can be seized and read if arrested.<p>Technology used right can offer better protection then ever before.",
          "RAM really doesn&#x27;t matter for most people, IME, at least after Project Svelte. For example, here&#x27;s a video [0] of the Moto E (not G, but lower-class, 125$ E) outpacing a Samsung S5 at simple tasks like opening Facebook, etc.<p>With 1GB of RAM, I&#x27;ve noticed the Moto G can multi-task between low-RAM apps (Chrome, SMS, Drive, Dropbox, Twitter, GMail, etc) just as well as a Note III (3GB RAM). The only time I&#x27;ve noticed a difference is context switching with a high-RAM app, like sending messages while gaming. This is actually an excruciating experience on a 1GB phone, because the game needs to reload every time one switches back to it.<p>&gt;&gt;Is RAM not a worthy technical specification to list?\nI&#x27;d say yes, but it is a grossly overvalued spec. With modern RAM compression and multitasking, I suspect very few people will notice the difference between 1GB and 3.<p>[0] <a href=\"https://www.youtube.com/watch?v=3P9vDAY0U0A\" rel=\"nofollow\">https:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=3P9vDAY0U0A</a>",
          "Practically every bank I do business with has these limitations. By contrast, my gmail password is 24 characters long, and contains capital and lowercase letters and punctuation. It makes me wonder what their back-end systems look like that they can&#x27;t handle passwords longer than that."
        ]
      },
      {
        "freq": 25,
        "name": "frequency",
        "topComments": [
          "Continuing in your rant: technically, you still expect the server to behave correctly and ask your browser for the encrypted text through a special &lt;textarea&gt;. If the server doesn&#x27;t want to send the it, it won&#x27;t.<p>What I see is going the other way around: have the browser detect a standard &lt;textarea&gt; and provide control to automatically encrypt what you typed. Something ala <a href=\"https://www.mailvelope.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.mailvelope.com&#x2F;</a>. No changes in the websites. You can do it today (well, if you have the good plugin&#x2F;browser).<p>Now I think the real hard problem is not encryption itself but key distribution. You need to find a way to reliably tell other people &quot;This is my key&quot;, but you need some interactive way so that I don&#x27;t need to wait for you manually sending me your key in order for me to send you something encrypted... I believe XMPP is much better suited for that (there are ways to exchange content between people, even when they are not connected, for instance through services), so maybe Gmail could build something on top of SMTP+XMPP to exchange keys. And that still wouldn&#x27;t be truly authenticated, only optimistically, because in the end trust is something only users can set.",
          "You consider this &quot;impressive?&quot;<p>What&#x27;s impressive about it? Simple lists, a chat view, some text filter. Are you kidding me? Plus, just try &quot;command-+&quot; 2-3 times to enlarge the text, and see everything break down terribly.<p>But if you insist on web apps with more impressive UX work, anything in the list is better done: Twitter, Basecamp, Wunderlist, ..., hack even Gmail.",
          "To do the trick, you have to add the account as &quot;not an alias&quot; (you will have to add the gmail smpt and so) and later, select the reply &quot;Reply from the same address to which the message was sent&quot;.",
          "Yes. Things marked as done in Inbox (including marking many things as Done by sweeping) are shown as archived in Gmail (and vice versa).",
          "ericmarcos.p at gmail",
          "Why is this so hard? They were the by the book power-geek company, measure, iterate, profit.<p>Search is more like a platform, not a product, so let&#x27;s look at GMail the first product that comes to mind, with the many gigabytes and proper IMAP&#x2F;POP3 access they went all in. Filtering and search, labels and labs, plus it meant people were always logged in even while searching and looking at ads on 3rd party sites (and even though Blogger is and older Google product, not everyone had a blogger account, and I don&#x27;t know how well integrated that was back in 2002-2003).<p>Then Maps, with all the bells and whistles. Analytics, you still can do arbitrary dimensions and metrics with it, drive it from a simple API, etc. Calendar, boldly supports ICAL, XML, RSS and so on.<p>And compared to these Google+ is <i>still</i> a trainwreck speeding ahead by the sheer force of will of Google. (Even Facebook switched back from the multi-column layout fast, because it&#x27;s unreadable.)<p>The overarching theme used to be making something very powerful for average users and cater to the power-users&#x2F;developers (who will then happily evangelize&#x2F;integrate-with the product). Lately Google does none of that. At least Google Wave had a nice API on launch day to write robots, G+ was just a HTML5 slideshow for months. (Now, even on 1440p when reading comments, even after clicking to show more than one, I have to scroll the comment section in a 518x430 box. Why?)<p>They have thousands of very capable engineers, and it&#x27;s great that now I can see the curvature of Earth in all its glory thanks to WebGL in Maps, but simply measuring distance just recently made a comeback.<p>RSS with PubSubHubbub, microformats and organic evolution of de facto standards would have been completely adequate for almost anything they wanted in this new sharing economy.<p>Though, to think of it, it sort of started when they elegantly neglected to make the profile (user data) path customizable in Chrome, and continued with the Real Name policy blunders on G+, and now YouTube subscriptions by default are completely useless too. (Because if you are not a simple user, but a channel of some sorts, your likes are not visible on your profile&#x2F;channel page - nor anywhere else as far as I can tell - but subscribers by default get notified of new content on the channel, then proceed to visit it, and find none. At least users can then tweak this in the well hidden clickable gear menu!)<p>It doesn&#x27;t take top pro exec Vic (or anyone) to fix bugs or provide more configurability. (In 2014, just 8 years after You were the person of the year, how fast You just became a wallet to milk.) Or if it does, then all the more power to the startups.",
          "Any invites left for me? If possible please send at rajivs.iitkgp@gmail.com",
          "I have to imagine that this relies on an enormous amount of backend processing - and that it is a lot easier to do this with one Gmail backend.",
          "They did something similar with the hangouts gchat replacement in gmail. You cannot log out. You are always signed in. This annoyed me to no end.",
          "I disagree.  At the end of the day, Google&#x27;s business is selling ads to the highest bidder.  Gmail is an ad conduit, but Google Reader was not.<p>Gmail isn&#x27;t going anywhere anytime soon."
        ]
      },
      {
        "freq": 17,
        "name": "frequency",
        "topComments": [
          "This article leaves a lot to be desired. No perspective from a security expert on how law enforcement backdoors are also backdoors for others. Mention of non-existent end-to-end encryption for Gmail and Yahoo email (might be referring to the end-to-end project, but that&#x27;s not even close to done). They probably meant to say server-to-server email communications.  Also refer to Silent Circle as &quot;in development.&quot;  Finally, the title demonstrates a fundamental misunderstanding of the past year and a half of disclosures.  This is Verizon doing what Verizon does: find something they can charge extra for and slap together a poorly thought out and inadequately engineered app for it.",
          "I don&#x27;t think inbox is meant to replace Gmail&#x27;s current UI. It&#x27;s meant to be a simple interface for a specific workflow. That will probably be fine for the average gmail user, but I can&#x27;t see it replacing Gmail.",
          "I&#x27;m logged into gmail and see the captcha in another tab regardless. Perhaps because I refuse 3rd party cookies but never-the-less it pokes a hole in your theory.",
          "It seems to me that you want to be involved in startups that have just got traction in the B2C market, AkA created that &#x27;wow&#x27; factor that you mentioned.<p>Your long track record in a fortune 50 company might be the thing that steers you away from getting accepted to such companies. If I was hiring you, the first red flag I&#x27;d get is &#x27;this guys experienced&#x27; - how much is this going to cost me?<p>Likely, the jobs at small disruptive companies probably work on recommendations. I see your options like this if you want to make the change:<p>Option 1: Get a recommendation to a company your interested in and expect a pay cut.<p>Option 2: Find a startup that you&#x27;re interested in, offer to help them out, make connections; or, join one.<p>Option 3: Start your own B2C startup, do it as a side project, build a team and quit your day job when you&#x27;re ready.<p>There is nothing worse than doing a job that you&#x27;re no longer interested in. I know your pain, everybody has been in your shoes at one stage in their life.<p>This is my email, your welcome to email if you want any advice, lukejamesfitzpatrick@gmail.com",
          "Or people being locked out of their GMail account<p>This is the problem, and customer service in Google barely solves anything.",
          "fascinating stuff. I&#x27;m still amazed at how many username&#x2F;passwords are freely available via github search:<p><a href=\"https://github.com/search?p=96&amp;q=gmail+password&amp;ref=searchresults&amp;type=Code&amp;utf8=%E2%9C%93\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;search?p=96&amp;q=gmail+password&amp;ref=searchre...</a><p>even if they have 2-step auth setup, people choose &quot;complete the email address&quot; as a form of authentication which you can most likely get from their github profile.<p>the moral of the story here is - if you do not want someone to find it - do not publish it online",
          "Location: San Diego<p>Remote: Yes<p>Willing to relocate: No<p>Technologies: Javascript, Typescript, Android&#x2F;Java, Actionscript, Haxe, Flask&#x2F;Django, Python, a tiny bit of Haskell<p>Resume: www.linkedin.com&#x2F;in&#x2F;jeremydagorn&#x2F;\nGithub: <a href=\"https://github.com/jrm2k6\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;jrm2k6</a>\nBlog: <a href=\"http://www.flask-blog.jeremydagorn.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.flask-blog.jeremydagorn.com&#x2F;</a><p>Email: jeremy.dagorn@gmail.com<p>I am a programmer with mostly front-end experience. I worked on really dynamic UI, shipped to millions of users in the last two years. I am someone curious, caring about testing and quality code, with attention to details. On my spare time, I work on some Android apps, and other projects using Python and Haskell.<p>I am looking for any kind of full-stack position, where I could be learning a lot and get challenged. I am a fast-learner. Working using some functional language could be fun as I have an increasing interest in Haskell. I am also interested in the backend world, but don&#x27;t have any experience yet, thus the full-stack position interest.",
          "Location: Costa Rica\nRemote: Yes\nWilling to relocate: Probably \nTechnologies: Python&#x2F;Django, HTML&#x2F;CSS&#x2F;JS Linux\nEmail: manuelchaves at gmail<p>I don&#x27;t like making CV&#x27;s, I find it hard to make it sound important as I don&#x27;t know what buzzwords to put or can&#x27;t say much about my degree as I have none, or work experience as I&#x27;ve only had short lived jobs.<p>But I can say this, I live on the computer, I know my way around it. I&#x27;ve also done many projects by myself.<p>You can check my github account I have some of my open source projects there. \n<a href=\"http://github.com/madprops\" rel=\"nofollow\">http:&#x2F;&#x2F;github.com&#x2F;madprops</a><p>Most notably you could check Lindora, a code editor I made using JS heavily on the frontend and Django on the backend.<p>I&#x27;ve made dozens of projects, most of them using Django, I&#x27;ve also made some Android apps.<p>I&#x27;m not an expert on anything, but I know how to google my questions.<p>You can write me back at manuelchaves at gmail",
          "Location: Pakistan<p>Remote: Yes<p>Willing to Relocate: No<p>Technology: LAMP Stack, Python,C#, Browser Extensions, API integrations, MVC Frameworks in different languages.<p>Résumé&#x2F;CV: <a href=\"http://justpaste.it/adnanprofile\" rel=\"nofollow\">http:&#x2F;&#x2F;justpaste.it&#x2F;adnanprofile</a><p>Email: kadnan at gmail.com",
          "I was thinking much the same - the Gmail backend surely has scaling issues, but the frontend should be relatively simple.  Afterall, you can still use the basic html view if you want, the ajax view is just some icing on the cake; it can&#x27;t be <i>that</i> resource hungry unless there are bugs."
        ]
      },
      {
        "freq": 11,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 14,
        "name": "frequency",
        "topComments": [
          "Why is top-posting still something to avoid?<p>It took me a while to get used to it, but at this point I consider the war to be won in favour of top-posting, due to Gmail embracing it.",
          "Data Science, Vector Space, Machine Learning, Predictive Analytics, Data Acquisition, Dataset development, Data Interpretation, Visualization (experimental as opposed to formal methods preferred)<p>Languages: Tcl<p>Intern, Full-Time, Contract<p>Email: genopharmix@gmail.com",
          "Location: Karachi, Pakistan<p>Remote: Yes<p>Willing to relocate: No.<p>Technologies: PHP(Laravel, CodeIgnitor, Core), Python(core, Flask, Django),Java,C#&#x2F;MvC4,jQuery, JavaScript, Browser Extensions, APIs(Fb, Google, Youtube,Twitter etc), Web&#x2F;Data Scrapping.<p>Résumé&#x2F;CV: <a href=\"http://justpaste.it/adnanprofile\" rel=\"nofollow\">http:&#x2F;&#x2F;justpaste.it&#x2F;adnanprofile</a><p>Email: kadnan(@)gmail<p>BTW, I recently started a new series on blog called <i>LxD</i>. Check [here](<a href=\"http://blog.adnansiddiqi.me/lxd/\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.adnansiddiqi.me&#x2F;lxd&#x2F;</a>)",
          "The court order is the bar, not the second employee.<p>Google&#x27;s keyservers also don&#x27;t have single employee control.  The ones used for encrypting gmail behind the scenes, and other Google services.  This is just table stakes for any large system.<p>This is in contrast to something like Azure Key Vault, which is HSM backed.  A court order should not be sufficient to compel Microsoft to turn over a key from Azure Key Vault; it <i>should</i> be impossible for them (or for nCipher) to do so.",
          "Yep, Google had the foresight to hire the best security people and it&#x27;s paid off for them and the community.<p>Another example: privacy activists were saying we should all move to Firefox after the Snowden leaks but ignore how Chrome is very far ahead of Firefox in terms of security and exploit mitigation. So agreed, we shouldn&#x27;t entirely dismiss Google.<p>Although I think the centralization and incentive structure that has been a result of Gmail&#x2F;Google and the ad-based software economy are the big reason why the NSA is so powerful regardless of crypto&#x2F;tech-breaking capabilities.<p>All they need is a warrant - handed out via secret courts - and they get everything on any persons life, from anywhere in in the world. This results in a greater risk over IMO, but Google is not entirely to blame for that.",
          "Of course not. I think all of the developers agreed on finishing the project and focus on the &#x27;new generation&#x27; m0n0wall like the OPNsense.<p>These guys were the main contributors:<p>Andrew White (awhite) &lt;andywhite at gmail dot com&gt;\nLennart Grahl (lgrahl) &lt;lennart.grahl at gmail dot com&gt;\nManuel Kasper (mkasper) &lt;mk at neon1 dot net&gt;\nPierre Nast (pnast) &lt;pierre at coldev dot org&gt;",
          "I&#x27;d take his comment with a pinch of salt, that is years before ajax applications were even mainstream.<p>gmail wasn&#x27;t even released until 2004, and that was probably the first mass-market application that really unleashed the full power of ajax and made people stand up and notice.",
          "OAuth is implemented for products that support it, such as Google and Gmail accounts. Exchange doesn&#x27;t support OAuth. See <a href=\"https://www.acompli.com/privacy-policy/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.acompli.com&#x2F;privacy-policy&#x2F;</a>.",
          "That&#x27;s what happened when GMail offered 2 GB inboxes.  The competition got serious.",
          "I use Thunderbird and have filters for most things, even for myself. I have many e-mail addresses I use for different things.<p>In my gmail, I have folders and subfolders. I have a folder with my name, emails I sent to myself go there.<p>I use [&lt;tag&gt;] in subject so that they go to the proper subfolder in my folder, etc.<p>I use <a href=\"http://hnnotify.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;hnnotify.com&#x2F;</a> to get notifications when someone replies to my comments on Hacker News, by the way."
        ]
      }
    ],
    "positive": 0.5714285714285714,
    "negative": 0,
    "neural": 0.42857142857142855
  },
  {
    "theme": "firefox",
    "frequencies": [
      {
        "freq": 20,
        "name": "frequency",
        "topComments": [
          "It means 6 weeks have passed since the last Firefox release, and they are releasing a snapshot of whatever features they were able to make stable in that time. Also, it will not be an extended support release, because 32 % 7 != 3 (every 7th release is an ESR starting at version 10).",
          "Only the webpage&#x27;s footer loaded for me.<p>Here is a link to google&#x27;s cache: <a href=\"https://webcache.googleusercontent.com/search?q=cache:_EV1X5QwQsgJ:firstround.com/article/What-I-Learned-As-Pandoras-First-Data-Scientist+&amp;cd=1&amp;hl=en&amp;ct=clnk&amp;gl=us&amp;client=firefox-a\" rel=\"nofollow\">https:&#x2F;&#x2F;webcache.googleusercontent.com&#x2F;search?q=cache:_EV1X5...</a>",
          "Turn your cookies off. \nFWIIW, if you turn off cookies and Javascript, pretty much all &quot;subscription only&quot; content becomes available. This probably makes me an evil hacker who should be dragged away and beaten with rubber hoses, but I noticed it when trying to get Firefox to run reasonably quickly.<p>TLDR: many American megacorps, like FedEx and Wallyworld, insist on calling their employees &quot;contractors&quot; so they don&#x27;t have to give them as many benefits.",
          "And I hope we won&#x27;t have it (although I know they are working on it and it&#x27;s on the roadmap, so I have no illusion).<p>Given the number of tabs I have constantly open, I know that Chrome cannot handle it (I guess IE is the same here) and a multiprocess firefox won&#x27;t either.",
          "You haven&#x27;t understand a single damn thing about it, did you?\nNonetheless you&#x27;d be somehow right.\nThe phone is sold with android and then it is up to you to install another OS that goes along with it, may it be WebOS, Ubuntu Touch or Firefox OS.<p>So I guess not as many are sold with Firefox OS rather than Android, because ALL OF THEM ARE SOLD WITH ANDROID AND NONE WITH FIREFOX OS!<p>Other than that, instead of talking trash all over the place about Firefox OS, did you even try it? And if it wasn&#x27;t good enough for you, did you contribute to it? Because you know that half of it is written by volounteers, right? And if you can&#x27;t code, did you file bugs in Bugzilla, right? Because certainly you are not just badmouthing Firefox OS without a clue of what it is and how it works and doing the best to improve it in order to have a better smartphone ecosystem that would benefit everyone, right?",
          "Is there a reason any other devs want it to be relevant??<p>On the consumer side, IE is great(ish) with low power usage, good font rendering, tie-in with other MS services, native features, etc.<p>For developers, um no, I can attest to absolutely detesting IE in every way. Its web dev tools are slow and clunky, they are getting beat over the head in features by Chrome, Firefox and even Safari, IE11 just got prefetch and pre rendering, something the other browsers have had for years; IE looks like it will always be playing catch up. Good thing they put an auto updater in their browser, but has there been any significant upgrades to IE&#x27;s feature set in the past year (implementing features over a time other than every year is important as well)?<p>The worst part is that Microsoft always gives the previous version a reason to exist and be a pain. With Google and Firefox, the auto updater takes care of itself. With IE11, it has just gotten an auto updater and there&#x27;s no telling if Microsoft will pull an IE10&#x2F;Windows 8 and stop updating IE for Windows 8.1. Already I can envision in a year or two at work we&#x27;ll have to support IE10 at the least, even though it should be dead. The fact that Microsoft skipped Windows 8 (which you cannot upgrade Windows 8.1 if you have the Enterprise or education edition) really burned me. At least Apple always updates its browser one version back if you don&#x27;t decide to upgrade OS X.",
          "Chrome&#x2F;Firefox.  Not AOSP stock browser.",
          "Anywhere for bug reports to go?<p>If I add many skills to a skill list and attempt to delete the skills, a skill further down the list is deleted instead of the one I am clicking. If I delete all the skills in that list, finish and wait for the &quot;Saving...&quot; dialog, upon refresh half (if not more) of the list that I deleted will reappear.<p>Also, on that note, it seems counter-intuitive to me to have the check (for confirmation) to the left of the x (for decline to save changes) when dealing with the dialog to add specifics to a group (in my case, skills to a skill list). Many times I meant to save changes, and hit the X on the right rather than the checkmark instead of the check on the right, because for some reason I was stuck mentally with thinking &#x27;confirm dialog on the right&#x27;. X on the right is intuitive for closing a window, but less so when accompanied with a confirmation checkmark (of course, opinion)<p>Linux x64, Firefox 32.0<p>P.S. tried this in another browser (Chromium), same behavior. Account was effectively broken til I deleted the skill list itself which contained the problem container.",
          "works poorly in firefox",
          "I&#x27;m using Firefox 3.5, and a helluva lot of stuff doesn&#x27;t work properly any more. For instance, I notice that reddit broke a few weeks ago and I can no longer vote or comment. Why? I have no idea.<p>&quot;Why don&#x27;t you just get a new browser?&quot; you might ask. Because new versions of browsers don&#x27;t work on OS 10.4.<p>&quot;So why don&#x27;t you upgrade your OS?&quot; Because as far as I can tell, no upgraded OS that will work on this machine is still available. There&#x27;s no upgrade path from here to there. OS 10.6 would run on this machine, and OS 10.6 would run the latest Chrome, but you can&#x27;t get OS 10.6 any more.<p>So I&#x27;m stuck in a bind, with no other option than to throw this (perfectly good) machine out completely. I do have a newer machine, but I keep it in the office, and this one <i>ought</i> to be capable of doing everything I want from it, but web devs keep breaking things that used to work fine."
        ]
      },
      {
        "freq": 13,
        "name": "frequency",
        "topComments": [
          "Most PDF readers have a presentation&#x2F;full screen mode for this (even pdf.js in Firefox does). The nice thing about them is that PDFs work nearly everywhere (if they are made that way, which in this case appears to be true).",
          "Unfortunately, it looks awful in Firefox.",
          "Wow. I had no idea that Firefox lacked support for &lt;input type=&quot;date|datetime|datetime-local|time&quot;&gt;. I was just assuming that it did, simply because &quot;it&#x27;s not IE&quot;.<p>Thank you for pointing that out.",
          "Hi guys, author here, as far as I have tested it is working with Chrome and Firefox in desktop (where you can drag and drop)\nIt really depends on if the subtitle is in the Open Subtitles API or not, it tries to search for the best suitable subtitle there.\nI&#x27;ve only tested with spanish and english languages but I am planning on improving the localization of the app.<p>Thanks for the feedback and glad some of you are finding use in it.",
          "This is another great example of the difference between Chromium (free and open source browser) and Chrome (proprietary, branded fork of Chromium).<p>Amusingly, the previous workaround for running Netflix on Linux used Firefox (running under a patched version of Wine)[0], though it looks like Netflix is unlikely to come to Linux for Firefox in the near future[1]<p>[0] <a href=\"http://www.compholio.com/netflix-desktop/\" rel=\"nofollow\">http:&#x2F;&#x2F;www.compholio.com&#x2F;netflix-desktop&#x2F;</a><p>[1] At least until Netflix switches over to DRM-ed HTML5 video, and Firefox implements HTML5 DRM.",
          "So, that&#x27;s not Tor being exploited, that&#x27;s just a Firefox bug that was used to get at Tor users because they&#x27;re more interesting targets. It wasn&#x27;t a case of JavaScript making Tor less private or less secure except in that it was JavaScript making <i>everything</i> less private and secure, and Tor doesn&#x27;t protect you from that because Tor isn&#x27;t a security tool.",
          "Multiprocess Firefox currently only uses one process for all tabs (plus a browser UI process). The tab process will be sandboxed, so users will get some of the security benefits of multiple tabs without the memory overhead of tab-per-process.<p>If you want to experiment with more than one tab process, you can tweak the about:config pref &quot;dom.ipc.processCount&quot;.",
          "&gt; I assumed that Firefox periodically downloaded something from Google that let Firefox check a given URL against a list of known-bad hashes.<p>Yes, that&#x27;s basically how it works.  Firefox periodically downloads a database of blocked URLs.  Before loading a web page, it checks this database.  If the check is negative then Firefox displays the page normally.  If the check is positive, Firefox will also send a hashed URL to the Safe Browsing server to double-check whether to block the page or not.<p>This page has more documentation, including a link to the API specification:<p><a href=\"https://support.mozilla.org/en-US/kb/how-does-phishing-and-malware-protection-work\" rel=\"nofollow\">https:&#x2F;&#x2F;support.mozilla.org&#x2F;en-US&#x2F;kb&#x2F;how-does-phishing-and-m...</a>",
          "Is there even a stable, published API for this that a desktop app could use? I always believed that Chromecast support was a platform thing handled by the Chromecast API which is effectively a binary blob.<p>Regardless, I imagine that Firefox will end up with some sort of support for pushing streams when the MatchStick is released, but whether it supports Chromecast is a question yet unanswered.",
          "I use the &quot;Tree Style Tab&quot; extension, available here:\n<a href=\"https://addons.mozilla.org/en-US/firefox/addon/tree-style-tab/\" rel=\"nofollow\">https:&#x2F;&#x2F;addons.mozilla.org&#x2F;en-US&#x2F;firefox&#x2F;addon&#x2F;tree-style-ta...</a><p>If you haven&#x27;t used it before, and if you&#x27;re prone to having 10+ tabs open at a time, I highly recommend it. Although I warn you that you may never wish to use Safari or Chrome again...<p>Chrome used to have a similar feature built-in but they removed it ages ago."
        ]
      },
      {
        "freq": 29,
        "name": "frequency",
        "topComments": [
          "Firefox was great, but the performance was sub-par around version 3, and the time between releases was measured in years, not weeks. Chrome definitely gave Mozilla a nice kick in the backside, which I am very thankful for. These days Firefox is now close to, if not faster and less memory hungry than Chrome.",
          "Just to add, Firefox announced two weeks ago that SSLv3 would be disabled by default in Firefox v34[1], around late November.<p>[1] <a href=\"https://blog.mozilla.org/security/2014/10/14/the-poodle-attack-and-the-end-of-ssl-3-0/\" rel=\"nofollow\">https:&#x2F;&#x2F;blog.mozilla.org&#x2F;security&#x2F;2014&#x2F;10&#x2F;14&#x2F;the-poodle-atta...</a>",
          "What happens if firefox starts shipping with yahoo as it&#x27;s default search engine?\n<a href=\"http://mashable.com/2014/11/19/firefox-default-yahoo-search/?utm_cid=mash-com-Tw-main-link\" rel=\"nofollow\">http:&#x2F;&#x2F;mashable.com&#x2F;2014&#x2F;11&#x2F;19&#x2F;firefox-default-yahoo-search&#x2F;...</a>",
          "The developer browser also includes Firefox Tools Adaptor which supports remote device debugging of mobile browsers like Chrome on Android and Safari on iOS:<p><a href=\"https://hacks.mozilla.org/2014/09/firefox-tools-adapter/\" rel=\"nofollow\">https:&#x2F;&#x2F;hacks.mozilla.org&#x2F;2014&#x2F;09&#x2F;firefox-tools-adapter&#x2F;</a>",
          "I got a 4,690 on Firefox Nightly so there&#x27;s so big improvements coming down the pipeline.",
          "&quot;Sorry, but something went wrong and your connection was interrupted. Please check your internet connection and reload the game.&quot;<p>Couldn&#x27;t get it to work on my Firefox, but I was able to drive around fine with IE9 (yuck)... There weren&#x27;t any other players though.",
          "I&#x27;m rather annoyed with mozilla&#x2F;firefox pushing for ubiquitous usage of their authentication platforms. I prefer my decentralized, modular, and personally controllable account information. The reason I don&#x27;t &quot;Sign in with Google&quot; or &quot;Login with Facebok&quot; is the same reason I don&#x27;t want a Firefox Persona or Account.\nAlso, let me sign up without a damn e-mail.",
          "&gt; Of course, the dream would be to have all Firefox clients run Tor relay nodes out of the box<p>Even the Tor Project themselves recommend against running an exit node on a home computer.  Too many risks of investigation and seizure of assets.",
          "Works fine with Firefox 33.0 on Debian",
          "&gt; I feel this point is slowly becoming disingenuous. If someone goes through the trouble of compiling their application to asm.js, they obviously really care about performance, because &quot;normal&quot; javascript wasn&#x27;t good enough for them.<p>...what? asm.js is a compiler target for C code. It&#x27;s not intended to be hand-written. It&#x27;s also the <i>default</i> compiler target for C code on the web. You wouldn&#x27;t really want to compile to anything else, except NaCl I suppose (though that requires more porting effort).<p>I don&#x27;t get what you mean by &quot;going through the trouble of compiling their application to asm.js&quot; versus &quot;&quot;normal&quot; javascript wasn&#x27;t good enough for them.&quot;. Why would they compile to normal JS? There&#x27;s no reason to: Their codebase is in C, C++, or some other native code language. If they compile to asm.js, they get a free performance boost. If they compile to JS, they just get horrible slowness. The only difference between them, here, is a single compiler flag. I don&#x27;t understand.<p>&gt; Hell, elm&#x2F;cljs&#x2F;scala.js&#x2F;js_of_ocaml&#x2F;etc wasn&#x27;t good enough. How many asm.js developers do you know that will go through the trouble of compiling a codebase to asm.js, without putting up an alert(&#x27;This app works best on Firefox&#x27;);?<p>Why would normal JS developers be writing in asm.js? Do you even understand why asm.js exists?<p>&gt; Unless the barriers to entry for compiling to asm.js can be very significantly reduced, it will become a Mozilla-only ecosystem.<p>What barriers to entry? You download the emscripten SDK and you compile your existing C&#x2F;C++ app to asm.js.<p>&gt; I&#x27;m a huge Mozilla fanboy, but I feel like they bit off more than they could chew here, and I think the effort would be better spent on standardizing a spec for a true VM instead of trying to back-compat-hack one into javascript.<p>It&#x27;s not a VM, there&#x27;s no JIT involved."
        ]
      },
      {
        "freq": 20,
        "name": "frequency",
        "topComments": [
          "That is my best guess. I could be wrong. Should people refrain from publishing their guesses on HN?<p>None of the programs I have used that lack threads, including lynx, have this kind of glitchiness. (Also, I think early versions of X lacked threads and at least when paired with certain video cards, were free of glitchiness -- or more precisely, a user could learn to operate X in such a way as to avoid glitchiness.)<p>In particular, my guess is that although it is theoretically possible to write huge multi-threaded programs that do not exhibit glitchiness, in reality it is too hard for even very skilled human programmers to do it, and that is why Firefox has the glitchiness property.<p>I am willing to listen to arguments to the contrary.<p>P.S. I would have supposed that those who disagree with my conclusion would simply deny that Firefox is glitchier than Emacs or would simply conclude that the difference in glitchiness is irrelevant.  Do you agree with me that it is glitchier and that the glitchiness matters?<p>(Again, I realize the glitches are rare -- maybe only a few a day. They do affect my experience of the app, though.)",
          "Same here. Safari 8.0.2 on Yosemite 10.10.2. It worked in Firefox though, but unfortunately didn&#x27;t make me any good at the game. I couldn&#x27;t get ILS. Maybe I didn&#x27;t understand the landing part.",
          "A lot of people outside of the US don&#x27;t want to use translated software. I grew up on English software and prefer it that way, so I never download the Danish translated version of Firefox.<p>This is not uncommon at all.<p>So given the broad usage of the US version of Firefox around the globe there need to be some level of localization in the services that are more sophisticated than simply assuming that a Yahoo search from the search bar must originate from the US.",
          "they could release a firefox with gecko that works on jail broken ios ( or maybe it exists?)",
          "Hmm, the thread for Firefox accepting Bitcoin was ranking high on reddit, and one of the top comments was mentioning that Wikipedia is also accepting Bitcoin. All I can think of.",
          "Firefox for iOS won&#x27;t be part of the main Firefox repos because it won&#x27;t be using the Firefox underpinnings. It can&#x27;t use the gecko engine due to Apple&#x27;s restrictions. Since it&#x27;s Firefox mostly in name only, it makes sense to have it in an entirely separate repo.",
          "I use w3m from Emacs all the time. It is not my primary browser, but I do like it for reading documentation while hacking. It is ridiculously fast and uses very little memory when compared to Firefox.<p>It is very convenient for copying snippets of code and pasting them in whatever file you are editing (or a REPL), too.<p>The same, to a lesser degree, goes for Dillo. It is amazing how Dillo can have dozens of tabs open and never use more thant 50-100 MB of RAM... :)",
          "Phoenix dropped XPFE in favor of lighter XUL that relied more directly on OS widgets. Here&#x27;s a message talking about it:<p><a href=\"http://sourceforge.net/p/xul/mailman/message/1494849/\" rel=\"nofollow\">http:&#x2F;&#x2F;sourceforge.net&#x2F;p&#x2F;xul&#x2F;mailman&#x2F;message&#x2F;1494849&#x2F;</a><p>I think Firefox mostly started out from an urge to make a &quot;Browser product&quot;, rather than whatever the hell the suite had become. It shows in the release notes:<p><a href=\"http://website-archive.mozilla.org/www.mozilla.org/firefox_releasenotes/en-US/firefox/releases/0.1.html\" rel=\"nofollow\">http:&#x2F;&#x2F;website-archive.mozilla.org&#x2F;www.mozilla.org&#x2F;firefox_r...</a><p>A bunch of stuff about convenience and fast and fixing problems and usability is in there.",
          "To give it some credit, Firefox is pretty damn good in the past few months after the multi-process updates they&#x27;ve been making.",
          "Major points: donations are used for projects working on things like web literacy, rather than on large engineering projects like Firefox. The more Mozilla get from donations, the less dependent on Google&#x2F;Yahoo they have to be and thus they can be more independent - even fairly small absolute amounts will &#x27;push the needle&#x27; here.<p>Minor point: I strongly contest that Mozilla is a wasteful company - salaries are low by large-tech-firm standards and spending (on travel, equipment, etc.) is fairly frugal. I have never heard of employees having almost work to do - it is nearly always the opposite. Travel is nearly always for coordinated team work since many employees and volunteers work remotely. For a (relatively) small budget, Mozilla produce an awful lot of results - the entire company is run on vastly less than the marketing budget (!) for Chrome, for example (sorry, can&#x27;t find a source though)."
        ]
      },
      {
        "freq": 17,
        "name": "frequency",
        "topComments": [
          "The source didn&#x27;t get published until long afterwards. Firefox got broken because of this - and also because the previews had several other bugs that prevented it from starting up in the first place and detecting more problems.",
          "Look at the code in Firefox that handles certificate failures, presents user interface to end users to resolve the ambiguity, and then completes the operation once that happens. Then look at the sample code I linked to. The code I have there is a decent approximation of &quot;idiomatic&quot;. The code I&#x27;m referring to in browsers is larger by a factor of, what, 100? 1000?<p>Browsers and operating systems aren&#x27;t going to add full DNSSEC resolving caches. They&#x27;re going to use stub resolvers and delegate this problem to &quot;DNS servers&quot; (caches), like they always did. DNSSEC does not protect the last mile. You can dodge this point by redefining the concept of &quot;last mile&quot;, but that&#x27;s not a persuasive argument.<p>The US NSA controls both the CA hierarchy and .COM. It is amusing to see people try to rescue DANE from criticism by evoking the CA system to protect it.",
          "The Mozilla-Yahoo deal could turn out to be mutually beneficial in that regard. Yahoo for example has started to recommend Firefox to its users [1].<p>And Yahoo&#x27;s market share should not be underestimated. On the list of most popular destinations, according to traffic rankings yahoo.com is number 4, being beaten only by google.com, facebook.com and youtube.com. And somehow Marissa Mayer has been turning the tide and I&#x27;ve seen positive things happening. For example I&#x27;m happy that they started developing Flickr again. Perceptions can change overnight and Google can certainly lose some more market share.<p>I just hope that Yahoo! &#x2F; Bing will improve their search for non-US users. Sadly for me Google provides the best search results and it&#x27;s not even a competition. And it makes me sad, because while search engines are easily configurable in Firefox, I would have liked to support Mozilla indirectly with my searches and those of my acquaintances to which I&#x27;m recommending Firefox (pennies I know, but they add up).<p>[1] <a href=\"http://techcrunch.com/2014/12/12/yahoo-starts-prompting-chrome-users-to-upgrade-to-firefox/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;12&#x2F;12&#x2F;yahoo-starts-prompting-chro...</a>",
          "This Firefox add-on is kick ass!<p>Full Disclosure:\nI&#x27;m a 10fastfingers.com addict so I&#x27;ll be replacing that addiction with this.  This add-on should save me some time since it combines my typing sessions with my regular reading.  It also makes typing interesting since I&#x27;ll always be typing articles that I would have read anyway.<p>ps. I noticed a bug where sometimes I can&#x27;t backspace but overall it&#x27;s awesome!",
          "Hey Folks,<p>I&#x27;ve created an add-on for Firefox and Chrome as an attempt to address the problem of password fatigue across websites. There is detailed documentation about the internals at:<p><a href=\"http://manzdagratiano.github.io/gobbledygook/\" rel=\"nofollow\">http:&#x2F;&#x2F;manzdagratiano.github.io&#x2F;gobbledygook&#x2F;</a><p>Download links are available at the bottom of the README from the Firefox add-ons page or the Chrome Web Store. It is currently in the review process for Firefox.<p>The next step is to port it to Android as a standalone app (since Chrome does not have extensions on Android, and the Firefox add-on API for mobile is very limited).<p>The documentation page addresses some concerns that may be raised about JavaScript cryptography.<p>I hope you find it useful. Constructive criticism is welcome. Please raise an issue on GitHub if you find there are any gaping flaws in the design that would leave the user vulnerable.",
          "Regarding 1, although a single data point does not a trend make, I will say that I switched away from Firefox due to multiple UI changes and removing customization options. I switched to Pale Moon.<p>In other words, personally, you are incorrect. FF no longer &quot;still offers the most customizable UI of any browser you&#x27;ve heard of&quot;. (Simple enough: FF removed options that PM kept. Hence, FF is not more customizable than PM.)",
          "Same for firefox:\n<a href=\"http://www.bing.com/search?q=firefox&amp;qs=n&amp;form=QBLH&amp;pq=firefox&amp;sc=8-7&amp;sp=-1&amp;sk=&amp;ghc=1&amp;cvid=7126bd3c0163490285b6cfb4e78365ff\" rel=\"nofollow\">http:&#x2F;&#x2F;www.bing.com&#x2F;search?q=firefox&amp;qs=n&amp;form=QBLH&amp;pq=firef...</a><p>Top link will be:  \n&gt; Firefox - Download Latest Version. 100% Free.  \n&gt; Firefox.freegogo-download.com<p>Which is InstallCore infected.",
          "Astounding - this small feature dramatically improves my results with google.<p>This is the first time I&#x27;ve even heard of this mode. As with the original article, I think this speaks to the massive power of the &quot;default&quot;. Once upon a time Google&#x27;s &quot;default&quot; was excellent for my use case, but it&#x27;s slowly degraded over the years, and rather than dig through all of its options trying to make Google useful again, I just whined about it and started looking at competing services.<p>Changes in default behavior should be embarked upon with extreme caution. This is especially true when considering the way google does this (with many incremental changes that are totally invisible individually). I feel like if they more prominently highlighted 1) what they were changing and 2) how to work around it they could avoid much backlash from &quot;power&quot; users.<p>Firefox, in contrast, makes it very clear what they&#x27;re doing when they change the default search engine, and it&#x27;s pretty easy to switch back to google. But clearly for a large number of users, that &quot;default&quot; will be good enough.",
          "This article is full of inaccuracies, alarmist FUD and sensationalism. If I could downvote an article, I would this one.<p><i>&gt;I was always under the impression they were just pretending that they owned large blocks of public IP space from a networking perspective, blocking everything and selectively turning on outbound traffic via access control lists. Apparently not</i><p>It was always public knowledge that NK has more or less one publicly routed &#x2F;22. That&#x27;s far removed from &quot;large blocks of public IP space&quot;.<p><i>&gt; This microtime is easily enough information to decloak people, which is presumably the same reason Google built it into the browser</i><p>I doubt that was Google&#x27;s intention behind the Safe Browsing API (<a href=\"https://developers.google.com/safe-browsing/developers_guide_v3\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;safe-browsing&#x2F;developers_guide...</a>)<p><i>&gt;So every time the browser fails for some reason they get information about it. Useful for debugging and also for finding exploits in Firefox, without necessarily giving that information back to Mozilla – a U.S. company</i><p>Or if could be that most of the users of the browser in question do not in fact have full internet access and thus no reports would be sent anyways. Also, FF 3.6 is long out of support, so by getting access to these crash reports, the people behind Naenara get a chance at fixing issues (I&#x27;m not saying they do or don&#x27;t, but getting the crash reports directly is the only way for remaining crashes to actually be fixed)<p><i>&gt;. Could the mothership be acting as a proxy? Is that how people are actually visiting the Internet – through a big proxy server?</i><p>very likely, but not because of the way the URL for the startpage is formatted. That&#x27;s just a convenience thing I guess where they ran wget or any other crawler against the original site and then they could just prepend their internal server to to URL and keep the patch to Firefox minimal.<p><i>&gt;it’s still very odd that they haven’t bothered using HTTPS internally</i><p>They just don&#x27;t care if &quot;normal&quot; people could potentially sniff each other calendars. If the government wants access to the calendar, they just look the data up I guess and because this is all a big intranet, the traffic doesn&#x27;t cross any non-goverment-owned routers anyways.<p><i>&gt;This one blew my mind. Either it’s a mistake or a bizarre quirk of the way DPRK’s network works but the wifi URL for GEO still points to <a href=\"https://www.google.com/loc/json*\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;loc&#x2F;json*</a><p>Likely none of the sites the browser is actually able to visit actually use the geolocation API, so they just forgot to change the URL. It&#x27;s an interesting bug, but far removed from mind-blowing IMHO.<p></i>&gt;That’s actually a good security measure, but given how old this browser is, I doubt they use it often, and therefore it’s probably not designed to protect the user, but rather allow the government to quickly install malware should they feel the need. Wonderful.*<p>I&#x27;m sure they have other methods of installing malware that then would run as a privileged account, not the unprivileged user account running Firefox itself (their OS doesn&#x27;t officially allow root access as we&#x27;ve seen in yesterdays article).<p><i>&gt;It is odd that they can do all of this off of one IP address. Perhaps they have some load balancing but ultimately running anything off of one IP address for a whole country is bad for many reasons.</i><p>when you have fewer than 10000 total users, that doesn&#x27;t seem like such a bad idea - it&#x27;s certainly convenient.",
          "Pretty much the only reason I use Chrome over Firefox is because there is only one bar to type things into in Chrome, and it &#x27;knows what I mean&#x27;, where as Firefox has two and it never knows what I mean."
        ]
      },
      {
        "freq": 35,
        "name": "frequency",
        "topComments": [
          "At one point, the post-crash session restore on Firefox actually single handedly made me move to Chrome. Another reason was the fact that I needed to kill its process because the UI became unresponsive.\nChrome was fresh and snappy, not a fair comparison at that point but it was definitely fast. I never <i>wanted</i> to switch away from Firefox but I felt like I had to because it had become unusable.\nI&#x27;ve switched back to Firefox since and all the previous problems were gone. It&#x27;s been very reliable and if it did crash (which can still happen like with all software) it would restore my tabs just fine. I just like it better than I ever did Chrome and I certainly like the organization behind Firefox better than that behind Chrome. :)",
          "Other distributions favored Gnome, like Fedora and RedHat, which has been dominating the enterprise. And maybe I&#x27;m wrong, but compared to other distros, Kubuntu was always in good shape. Back in the day when Canonical was distributing CDs, I got one as well with Kubuntu on it, so it was officially supported.<p>For me I used to prefer Gnome because of the apps I was using. OpenOffice or Firefox seemed to be out of place in KDE. Plus I preferred a simpler environment, of course nowadays they&#x27;ve gone overboard.",
          "Not sure which you mean. I have a 3200x1800 13&quot; display + Firefox and the practicaltypography font looks amazing. I basically had to read the whole article just because of the joy of the typography. Medium looks washed out in comparison.",
          "Firefox gets nearly $1mn&#x2F;day from Google...they&#x27;re using your browsing history to target new tab page ads to you...they&#x27;re not a good choice if you care about privacy.  They have, though, pressured Yahoo to do some good stuff -- they have zero leverage over google, in fact google has tons of leverage over them.  Try the Epic Privacy Browser if you care about privacy!",
          "I&#x27;m so glad that I&#x27;m not the only one asking for this.<p>I don&#x27;t understand what the use-case is. Why expend all that energy to make a custom native UI platform when all you end up doing is breaking the standards for my native OS? On Windows, Internet Explorer is the only browser that just gives a simple native window. Chrome and Firefox both cause issues because of their custom drawn windows. I don&#x27;t see any reason to use Vivaldi if they&#x27;re going to follow the same path.",
          "This must be some strange definition of OS. Phones already run on a Linux kernel - and are already capable of running a GNU&#x2F;Ubuntu yserland in parallel with an Android userland. Clearly the Android userland works quite well for mobile use, and the desktop userland could work quite well for docked use. It seems odd to claim that the two modes of userland couldn&#x27;t be more tightly coupled (allowing a single app to expose multiple UIs, like a browswr exposes both a command line interface (firefox www.google.com) and a GUI?",
          "The argument at hand is that <i>Firefox</i> shouldn&#x27;t support it, not that W3C shouldn&#x27;t. (The argument is conditioned on it having been spec&#x27;d and adopted by the W3C, and concerns what Firefox&#x27;s response should be.) Is it more wrong for Firefox to support an open interface to proprietary plugins, than a proprietary interface to proprietary plugins (the &quot;N&quot; in &quot;NPAPI&quot; literally means Netscape; this is something they deployed unilaterally and other people copied)?",
          "You&#x27;re confusing Firefox Hello with WebRTC. Let me explain by analogy with a video codec:<p>For video, Firefox contains a video codec. Surfing to YouTube lets the YouTube <i>web page</i> play video. Firefox does not contain a &quot;Youtube Player&quot;.<p>That&#x27;s exactly the opposite of what they have done here. They have added basically added a &quot;Telefonica WebRTC Player&quot;. That&#x27;s wrong. They should have added WebRTC generically so that you go to a web page at Telefonica to use it. Or better yet, use it with a server you trust.",
          "On the user end, this can be controlled to a fine degree with the RefControl extension<p><a href=\"https://addons.mozilla.org/en-US/firefox/addon/refcontrol/\" rel=\"nofollow\">https:&#x2F;&#x2F;addons.mozilla.org&#x2F;en-US&#x2F;firefox&#x2F;addon&#x2F;refcontrol&#x2F;</a>",
          "I also have better luck with tabs in Chrome. Overall CPU usage is lower, and the in-browser task inspector makes it trivial to ID bad tabs and close them.<p>Firefox is a lot better than it used to be, but it can still be brought to its knees across the board by a bad script, at least in my experience, and it&#x27;s hard to find the one bad tab to kill."
        ]
      }
    ],
    "positive": 0.4945054945054945,
    "negative": 0.08791208791208792,
    "neural": 0.4065934065934066
  },
  {
    "theme": "chrome",
    "frequencies": [
      {
        "freq": 28,
        "name": "frequency",
        "topComments": [
          "I&#x27;m using chrome on a Mac, at the moment. <a href=\"http://aboutbrowser.com/view/6lXX4\" rel=\"nofollow\">http:&#x2F;&#x2F;aboutbrowser.com&#x2F;view&#x2F;6lXX4</a><p>I&#x27;m interested in helping, if you&#x27;re interested in outsourcing some of the changes and fixes.  Shoot me a line—my contact info is in my HN profile.",
          "It&#x27;s still a copy of the browser code that comes with the base OS, even if it dodges the bullet on this bug. The Chromium-based WebView doesn&#x27;t receive updates like the Chrome app so will generally contain unpatched vulnerabilities, so the system level issue remains.<p>(Note that the rare-to-nonexsistent OS updates are still a problem, this WebView issue nonwithstanding. They are running old vulnerable Linux kernels which compromises the app sandbox)",
          "The Android Runtime for Chrome (ARC) beta is available for Linux&#x2F;OSX&#x2F;Windows too: <a href=\"http://dfiles.eu/files/i565k9sv8\" rel=\"nofollow\">http:&#x2F;&#x2F;dfiles.eu&#x2F;files&#x2F;i565k9sv8</a> (CRX file)",
          "And I hope we won&#x27;t have it (although I know they are working on it and it&#x27;s on the roadmap, so I have no illusion).<p>Given the number of tabs I have constantly open, I know that Chrome cannot handle it (I guess IE is the same here) and a multiprocess firefox won&#x27;t either.",
          "My understanding is that if you prevent Chromecast form reaching Google&#x27;s DNS servers it will allow you to provide an alternate address. Haven&#x27;t had a need to try that myself, though.",
          "Problems with Macbooks are not just limited to the graphics card. Many of my colleagues have had either hardware or software problems with theirs. I am not trying to start a flame war, I am just making an observation.<p>The Macbook I bought in 2007 was the best computer I&#x27;ve ever owned, and it still works! I wish I could say the same about my wife&#x27;s new Macbook purchased last year. It will freeze for minutes at a time, the app store won&#x27;t load, and safari will not open no matter how long we wait, so we have to use chrome.",
          "Is there a reason any other devs want it to be relevant??<p>On the consumer side, IE is great(ish) with low power usage, good font rendering, tie-in with other MS services, native features, etc.<p>For developers, um no, I can attest to absolutely detesting IE in every way. Its web dev tools are slow and clunky, they are getting beat over the head in features by Chrome, Firefox and even Safari, IE11 just got prefetch and pre rendering, something the other browsers have had for years; IE looks like it will always be playing catch up. Good thing they put an auto updater in their browser, but has there been any significant upgrades to IE&#x27;s feature set in the past year (implementing features over a time other than every year is important as well)?<p>The worst part is that Microsoft always gives the previous version a reason to exist and be a pain. With Google and Firefox, the auto updater takes care of itself. With IE11, it has just gotten an auto updater and there&#x27;s no telling if Microsoft will pull an IE10&#x2F;Windows 8 and stop updating IE for Windows 8.1. Already I can envision in a year or two at work we&#x27;ll have to support IE10 at the least, even though it should be dead. The fact that Microsoft skipped Windows 8 (which you cannot upgrade Windows 8.1 if you have the Enterprise or education edition) really burned me. At least Apple always updates its browser one version back if you don&#x27;t decide to upgrade OS X.",
          "Chrome&#x2F;Firefox.  Not AOSP stock browser.",
          "It&#x27;s probably something with my browser, but a weird line appears on your page, which I haven&#x27;t seen anywhere else.\n<a href=\"http://awesomescreenshot.com/0753f9w38b\" rel=\"nofollow\">http:&#x2F;&#x2F;awesomescreenshot.com&#x2F;0753f9w38b</a><p>(I&#x27;m on Chrome 37 on Mac 10.9)",
          "An emulator is a dev tool that recreates the whole OS.  \nIt is very useful for devs since that way you can test your app on multiple architectures or Android versions.  \nYou can even use it to run automatic tests after each commits (or each day) in order to control your app quality.<p>On the other hand, what we have in ChromeOS (and soon Chrome) is a reproduction of the Dalvik&#x2F;ART runtime. As a runtime, its only job is to allow Android apps to run.<p>It probably was an huge amount of work for the Chrome team (apparently, they have been working on it for quite some time but now that it is here, it means that with it installed you can run Android apps on your desktop computer.<p>so, it is both a matter of features, speed and convenience.  \nI am an Android dev. In the startup I work for, we have mobile apps (Android, iOS and even Windows Phone), a website and are even working on desktop versions of our product.  \nI don&#x27;t know what this will mean for us though. Sure, we can use this new runtime to make our Android app run on the desktop but it has been thought out for mobile UX so a huge amount of work would be necessary to make it work nicely with the mouse+keyboard combo.  \nIt is very nice that we now have that option though, especially with Material Design looming in the corner."
        ]
      },
      {
        "freq": 31,
        "name": "frequency",
        "topComments": [
          "&quot;Thanks for all of your feedback on this bug. We’ve heard you loud and clear.&quot;<p>Kudos to Google for hearing loud and clear the 127 people in that thread and potentially helped the numerous chromeOS community!<p>And here [1] are the cries of few thousands of souls that lost full access to their android sdcard. Hope you also hear their feedback louder and clearer! On the upside we learned how &quot;Bring it back&quot; is written in multiple languages.\n[1] <a href=\"https://code.google.com/p/android/issues/detail?id=67570\" rel=\"nofollow\">https:&#x2F;&#x2F;code.google.com&#x2F;p&#x2F;android&#x2F;issues&#x2F;detail?id=67570</a>",
          "GitHub: <a href=\"https://github.com/vladikoff/chromeos-apk/blob/master/archon.md\" rel=\"nofollow\">https:&#x2F;&#x2F;github.com&#x2F;vladikoff&#x2F;chromeos-apk&#x2F;blob&#x2F;master&#x2F;archon...</a>",
          "The article and comments ITT suggest that it is not like the existing &quot;Creative Cloud&quot;, but instead works like VNC, or perhaps renders UI locally while doing all the actual image editing on a server. If it was all client code, there&#x27;s no way it would run acceptably on cheapo Chromebooks (because Photoshop is a behemoth, mind, not because it&#x27;s inherently impossible to edit graphics on a low-end device).",
          "&quot;Also, I wonder how this affects bandwidth. Are you just constantly streaming HD? Are there latency issues? What about if the network gets congested? It sounds pretty terrible.&quot;<p>I can imagine, given experience with VNC or even some crappy RDP implementations, it sounds like it would be terrible.  But those are pretty old and bad technologies for remote desktop usage, with known issues.  You can do better.<p>I&#x27;m sure there are situations where the experience is not ideal.<p>But remember that you are talking about people using chromebooks here. They are computers basically built with the expectation that you have good internet, and they are targeting the education market here.<p>I would point out that neither Adobe, nor Google, would want people in <i>the education market</i> (one of Adobe&#x27;s prime targets) to have a crappy experience with Photoshop, as it would be really bad for both parties (if Google makes a bad first impression with chromebooks, people write them off and never try them again. If Adobe makes a bad impression with photoshop, people won&#x27;t pay hundreds later on to buy it).<p>So one would imagine they would not release a terrible experience :)",
          "I&#x27;ll try it out with chrome when I&#x27;m home. 😃",
          "Yeah but if you want to watch online stuff on your tv at this point you probably have about 6000 things that can run netflix etc, including the other google tv boxes, the amazon box, generic android boxes, the rokus, the apple tv, ps3&#x2F;ps4, xbox360&#x2F;xbox one, ps tv, chromecast, a hdmi cable or htpc etc.",
          "&gt; So unlike the graphs you typically see in chrome network inspector where one resource request ends and another begins, frames (the unit of data) from multiple streams are sent in parallel.<p>Connections are already processed in parallel whenever they can. That is, when the browser knows what to request, and it fits in the execution model. If there&#x27;s a huge number of assets on a single hostname, this has been a limiting factor because the browsers have limited the number of requests to a single hostname to avoid overloading the server. But that will remain an issue even if the requests are multiplexed over a single connection.<p>Most of the time when I see graphs in the network inspector that aren&#x27;t massively parallel it&#x27;s because nobody have spent time optimizing where&#x2F;how assets are requested in ways that will make them just as bad with connection multiplexing.<p>There certainly <i>can</i> be benefits to reap from it, but the worst offenders are already ignoring best practices.",
          "On my MacBook Pro (2.66GHz i7, early 2010), just starting Chrome causes the graphics to switch from the integrated Intel HD Graphics to the NVIDIA GeForce GT 330M, which incurs a substantial battery life penalty.<p>(I discovered this quite by accident when investigating why my display would flicker when starting&#x2F;quitting Chrome if I was also using f.lux.)",
          "I find I often have to go to chrome:&#x2F;&#x2F;components and redownload everything.",
          "Hi guys, author here, as far as I have tested it is working with Chrome and Firefox in desktop (where you can drag and drop)\nIt really depends on if the subtitle is in the Open Subtitles API or not, it tries to search for the best suitable subtitle there.\nI&#x27;ve only tested with spanish and english languages but I am planning on improving the localization of the app.<p>Thanks for the feedback and glad some of you are finding use in it."
        ]
      },
      {
        "freq": 33,
        "name": "frequency",
        "topComments": [
          "Firefox was great, but the performance was sub-par around version 3, and the time between releases was measured in years, not weeks. Chrome definitely gave Mozilla a nice kick in the backside, which I am very thankful for. These days Firefox is now close to, if not faster and less memory hungry than Chrome.",
          "That&#x27;s due to hardware acceleration so really Chrome is buggy. I don&#x27;t really know what to do about that.",
          "I looked in the logs on my public web server I host different sites on. I only found one UIDH record in my modsec_audit logs, but most worryingly it was it was for a personal injury trial lawyer. Made some records semi-anonymous.<p>--eee7b544-A--\n[25&#x2F;Sep&#x2F;2014:15:33:19 --0500] VCR8D6wUChkAAG-HuKQAAAAH 70.209.73.XXX 32675 X.X.X.X 80\n--eee7b544-B--\nGET &#x2F;wp-content&#x2F;uploads&#x2F;2012&#x2F;07&#x2F;XXXXXXXXXXX.jpg HTTP&#x2F;1.1\nX-UIDH: MTU4NTI5Mjg3AKafKcbQqnDdCMuP+UbmoCyKvEu8MnDsqV0I+AQ2K&#x2F;M+\nUser-Agent: Mozilla&#x2F;5.0 (Linux; Android 4.4.4; XT1030 Build&#x2F;SU4.21) AppleWebKit&#x2F;537.36 (KHTML, like Gecko) Version&#x2F;4.0 Chrome&#x2F;33.0.0.0 Mobile Safari&#x2F;537.36 GSA&#x2F;3.4.16.1149292.arm\nHost: www.XXXXXXXXX.com\nConnection: Keep-Alive\nAccept-Encoding: gzip",
          "&gt; The best way to predict the future is to invent it. Nobody has a crystal ball, so it&#x27;s really up to you.<p>In a sense you&#x27;re right, it usually takes a few people doing something different, and if it&#x27;s better, others will follow suit. However, by following current trends and looking at how past trends played out, I&#x27;m sure we can have a reasonable idea of what will decline and what will gain favor.<p>As the OP already noted, we can already notice a move towards web apps. Based on that one might conclude that we&#x27;ll all be using web browsers as our OS and Chrome OS is a perfect example of that. However, we should also notice that demand for desktop apps didn&#x27;t suddenly die out as web apps gained popularity. Desktop apps are still in demand, so the previous conclusion is too hasty. One conjecture I want to make based on current trend is that developers will start developing more for mobile platforms (phones and tablets), rather than the desktop because this is where consumer demand and use is moving to.<p>In both cases we can use current trends to strengthen or weaken hypotheses. It&#x27;s not like the future happens in a crystal ball either, yesterday was another day that contributed to the future.",
          "The developer browser also includes Firefox Tools Adaptor which supports remote device debugging of mobile browsers like Chrome on Android and Safari on iOS:<p><a href=\"https://hacks.mozilla.org/2014/09/firefox-tools-adapter/\" rel=\"nofollow\">https:&#x2F;&#x2F;hacks.mozilla.org&#x2F;2014&#x2F;09&#x2F;firefox-tools-adapter&#x2F;</a>",
          "Author, I&#x27;ll tell you what the #1 barrier for me to sign up for anything is going to be...<p>I&#x27;m probably going to get spammed if I do.\nBecause I have to implicitly provide email or social network details, and then I&#x27;m inviting myself to be hounded with email newsletters or asked to like your posts, whatever.<p>Even worse, if your company isn&#x27;t doing so hot in 3 months, you may decide to sell your contact list to a 3rd party. Your privacy policy for information I provide you may allow for this in a weasel-worded paragraph legal suggested you add somewhere buried in there that I don&#x27;t care to read, even if that was never your intention.<p>I invite myself to be bothered by your business (or others) in this way, in perpetuity, in exchange for a service that I&#x27;m not sure is even worth the annoyance yet. Again, I&#x27;m not even sure if I should bother reading through all your FAQs yet, let alone any EULAs.<p>This is a difficult value proposition.<p>Is there some way that a startup can convince me that they will not treat me as a commodity to be sucked up and spat out, but instead a precious potential partner to hold closely and want to serve in exchange for money and&#x2F;or feedback?<p>Can you word that into your TOS or EULAs to let us know that you are committed to not jerking me around?<p>That&#x27;s what I want before I sign up.<p>Call it &quot;Sign up&quot;, &quot;Try it free&quot;, &quot;First Hit&#x27;s On the House&quot;, wording is irrelevant. I&#x27;m looking for a commitment and some kind of indicator that the risk to my already at-limit information overload is low.<p>Oh and for the love of god, please don&#x27;t make me install another fucking app if you could just as easily do the job with a web page that looks good in mobile chrome or safari.\nIt&#x27;s insulting.",
          "Here&#x27;s the description from chromestatus: <a href=\"https://www.chromestatus.com/features/5169444246519808\" rel=\"nofollow\">https:&#x2F;&#x2F;www.chromestatus.com&#x2F;features&#x2F;5169444246519808</a>",
          "Yeah because those who are aware how those things work can totally waste their time downloading addons to do basic things.<p>Common sense: you don&#x27;t know what this control is for? DON&#x27;T touch it. Or touch it and face the consequences (learning&#x27;s got to start somewhere, right?).<p>This article seems to encourage apple&#x27;s way of thinking (&#x27;simple&#x27;, &#x27;just works&#x27;) and this is one of the main reasons for me (and many other people, I reckon) to ignore all their products completely. You want to go this way? fine. Don&#x27;t expect anyone technically-literate to use your thingie though (because it becomes harder to use for debugging and all those things than, say, Chrome). Also:<p>&gt; <i>Is it really worth having a preference panel that benefits fewer than 2% of users overall?</i><p>and then<p>&gt; <i>Even 1% of a few hundred million isn’t a trivial number of people.</i><p>Decide on it already :)",
          "Yup, I&#x27;ve been using that - but it&#x27;s not really a slideshow. Each picture is visible for 20+ seconds, and there&#x27;s no music. I haven&#x27;t tested if you play music that the backdrop is still visible though.<p>Google+ and Chromecast are like 85% of the way there. I just want to open up the Google+ app on my phone, go to an album and &quot;cast slideshow&quot; and have that be a great experience. Right now it&#x27;s horrible.",
          "Made this for my daughter this evening. Incredibly simple but got her hooked for a couple hours practicing the alphabet in three languages :)<p>(only tested in Chrome &amp; Safari &amp; iOS7+)"
        ]
      },
      {
        "freq": 32,
        "name": "frequency",
        "topComments": [
          "Hi, AppGyver dev here. Our platform expands on the web view approach, allowing you to leverage existing web development experience when getting started.<p>Yeah, it&#x27;s HTML and JS - but whereas Cordova provides you with one web view to build your app in, Steroids applications have multiple views joined together with native navigation. We ship with a lovely CSS framework by default to make building UIs a snap. The command line features livereload, so your changes can be reflected instantly on the device. And because it&#x27;s Javascript, you can debug using the tools in Chrome and Safari - a vast improvement over printlns.<p>You might find this page illustrative: <a href=\"http://www.appgyver.com/supersonic/ui\" rel=\"nofollow\">http:&#x2F;&#x2F;www.appgyver.com&#x2F;supersonic&#x2F;ui</a>",
          "Thanks, huge improvement! Was using Chrome in Windows 7, on a rather old Dell monitor at work. After working on WCAG 2.0 compliance on my own sites I have ironically gotten more sensitive to poor contrast ratios everywhere.",
          "I am a front-end developer, so my history grows a lot every single day. After a few weeks, my history is a culmination of documentation links, testing links, StackOverflow posts and more. I actually did some testing a little while ago and could see the bottleneck taking place. My CPU usage would spike up to 100% whenever I would type something into the Omnibox when I had a few weeks worth of history. I spotted this on a clean install of Chrome, I signed into my Google account, but disabled all plugins and it still occurred. Weirdly enough, not everyone seems to experience this issue.",
          "Yeah but once VGA&#x2F;SVGA and Adlib&#x2F;SoundBlastaer cards came out, it broke the Tandy 1000 series.<p>Still early games like Bard&#x27;s Tale 1 played better on the Tandy 1000 than an IBM PC Clone with Monochrome&#x2F;CGA and the PC Speaker beeping.<p>I had a friend with an IBM PCJr, had to do some work to get it over 512K by modifying some expansion packs, and the PCJr also had a cartridge slot.<p>I think the PCJr was aimed at home use to fight Commodore and Atari, then Apple entered with the Apple &#x2F;&#x2F;c to enter the home market. Eventually Atari and Commodore won the home computer wars with cheaper systems that got upgraded ala cart. When the Atari ST and Commodore Amiga came out both Commodore and Atari had switched management but lost to Microsoft and Windows on PC Clones with VGA&#x2F;SVGA and Adlib&#x2F;Soundblaster cards. Windows 95&#x2F;98 was the final nail in the coffin.",
          "PGP&#x27;s lack of forward secrecy seems like a <i>major</i> flaw, unless they can somehow make it easier to have the benefits of PFS while keeping the current design. But didn&#x27;t they already say they intend to use elliptic curve keys instead of RSA for much better performance? Wouldn&#x27;t that already break compatibility with PGP?<p>The only real downside I see from breaking PGP compatibility is that then the new system will need a few years before it can really be &quot;trusted&quot;.<p>However:<p>1) it already won&#x27;t be very trusted since it happens in the browser, and it will be quite hard for Google to <i>absolutely guarantee without a shadow of a doubt</i> that they can&#x27;t change any settings themselves (even though they own the Chrome browser and the Chrome store, on which the extension will live).<p>2) being new doesn&#x27;t mean it can&#x27;t be better. We already have better secure messaging crypto protocols such as Axolotl, so it is possible to make one that&#x27;s both new and better. (I actually wonder why we can&#x27;t just use Axolotl for an email interface, and call it a day?!).",
          "One could use chrome&#x27;s incognito mode to get around such irritations if one were so inclined.",
          "Tiling for Emacs: <a href=\"http://www.emacswiki.org/emacs/tiling.el\" rel=\"nofollow\">http:&#x2F;&#x2F;www.emacswiki.org&#x2F;emacs&#x2F;tiling.el</a><p>(I use it rather rarely, because I have a small screen and generally have no more than 3 windows open at the same time; I jump between Emacs&#x27; &quot;workspaces&quot; with help of Elscreen)<p>OTOH I use urxvt with tmux for most command line stuff because it works better with zsh completions and colors and such. So I have three WM-level windows open (on separate virtual desktops, each maximized): urxvt, chrome and emacs with urxvt and emacs being further split into windows organized in a tiling manner. Works great for me :)",
          "Wow, talk about perfect timing!<p>I&#x27;ve been thinking of writing a cross-platform desktop-app for a while but lately I realized that there are only 2 stable cross-platform UI: CLI and HTML&#x2F;CSS&#x2F;JS. Because of that, I&#x27;m planning to spend a year using FreeBSD and to limit myself only to use CLI tools, Emacs, and Chrome (I definitely will limit the usage of Chrome as well).<p>I wanted to test the idea of &quot;Focus&quot; by eliminating distraction.<p>I noticed a few patterns of <i>NIX tools: .&lt;something&gt;rc for personal configuration, .&lt;something&gt; (folder) for local data, and a few other things that I forgot. Can anyone recommend books&#x2F;references for writing classic </i>NIX tools? (C, best practices, effective-java-like book, POSIX compliant, utilizing build tools, x86&#x2F;x64, etc).",
          "Well, not everything seems to show up for me on Chrome.",
          "Firebug is basically built to extend default FF dev tool capabilities.  Its comparable to running chrome nightlies."
        ]
      },
      {
        "freq": 20,
        "name": "frequency",
        "topComments": [
          "1. Yes, because I like to know where my time goes (hint: now always where it should!)<p>2. I like very much automated solutions, that simply tracks focused apps. I tried several apps (chrometa, rescuetime and paymoplus) and I found that Paymoplus (not basic paymo!) it really suits my needs: it tracks window titles, which basically means that I can simply search for a project name to see how many hours I had on that in a specific day (however, it has its own downsides; i.e. you can&#x27;t make advanced stats or see working hours on a more than one day span)",
          "The Mozilla-Yahoo deal could turn out to be mutually beneficial in that regard. Yahoo for example has started to recommend Firefox to its users [1].<p>And Yahoo&#x27;s market share should not be underestimated. On the list of most popular destinations, according to traffic rankings yahoo.com is number 4, being beaten only by google.com, facebook.com and youtube.com. And somehow Marissa Mayer has been turning the tide and I&#x27;ve seen positive things happening. For example I&#x27;m happy that they started developing Flickr again. Perceptions can change overnight and Google can certainly lose some more market share.<p>I just hope that Yahoo! &#x2F; Bing will improve their search for non-US users. Sadly for me Google provides the best search results and it&#x27;s not even a competition. And it makes me sad, because while search engines are easily configurable in Firefox, I would have liked to support Mozilla indirectly with my searches and those of my acquaintances to which I&#x27;m recommending Firefox (pennies I know, but they add up).<p>[1] <a href=\"http://techcrunch.com/2014/12/12/yahoo-starts-prompting-chrome-users-to-upgrade-to-firefox/\" rel=\"nofollow\">http:&#x2F;&#x2F;techcrunch.com&#x2F;2014&#x2F;12&#x2F;12&#x2F;yahoo-starts-prompting-chro...</a>",
          "If you are using Chrome, there should be color pickers etc, which you can access by going into the Components Tab.<p>Then click one of the color pickers, and choose a color. Then it should update the demo interface on the left (you may need to scroll to find the right section)<p>If your using chrome you need to manually enter the values, like #000.<p>What sort of tutorial do you think, perhaps one of the ones which displays popovers next to each section, and guides you through it ?",
          "Just out of curiosity, what do you do with 16GB of RAM? I&#x27;m running OS X 10.10 on 4GB Macbook Air and I have faced no issues whatsoever. My general usage includes Chrome with ~20 tabs open, a Vagrant VM, terminal and text editor.",
          "Sure it does. I asked why Chrome, not being open sourced, is &quot;bad&quot; for the ecosystem. Unfortunately, I packaged that with an unpopular opinion. Hence, the censorship doled out by yourself and others. Way to go!",
          "Hey Folks,<p>I&#x27;ve created an add-on for Firefox and Chrome as an attempt to address the problem of password fatigue across websites. There is detailed documentation about the internals at:<p><a href=\"http://manzdagratiano.github.io/gobbledygook/\" rel=\"nofollow\">http:&#x2F;&#x2F;manzdagratiano.github.io&#x2F;gobbledygook&#x2F;</a><p>Download links are available at the bottom of the README from the Firefox add-ons page or the Chrome Web Store. It is currently in the review process for Firefox.<p>The next step is to port it to Android as a standalone app (since Chrome does not have extensions on Android, and the Firefox add-on API for mobile is very limited).<p>The documentation page addresses some concerns that may be raised about JavaScript cryptography.<p>I hope you find it useful. Constructive criticism is welcome. Please raise an issue on GitHub if you find there are any gaping flaws in the design that would leave the user vulnerable.",
          "Irrelevant. Chrome laptops or Android devices are everywhere. And classic Linux desktop such as Ubuntu is very common worldwide.",
          "When away from a power socket, I use Safari instead of Chrome. Saves battery a LOT. Was able to run 11&quot; Air with 19 tabs on Safari and with vim (on iTerm). 2hrs later still had 95% battery left.",
          "Pretty much the only reason I use Chrome over Firefox is because there is only one bar to type things into in Chrome, and it &#x27;knows what I mean&#x27;, where as Firefox has two and it never knows what I mean.",
          "What software is this for?  Chrome?  It&#x27;s not clear from the bug report."
        ]
      },
      {
        "freq": 23,
        "name": "frequency",
        "topComments": [
          "At one point, the post-crash session restore on Firefox actually single handedly made me move to Chrome. Another reason was the fact that I needed to kill its process because the UI became unresponsive.\nChrome was fresh and snappy, not a fair comparison at that point but it was definitely fast. I never <i>wanted</i> to switch away from Firefox but I felt like I had to because it had become unusable.\nI&#x27;ve switched back to Firefox since and all the previous problems were gone. It&#x27;s been very reliable and if it did crash (which can still happen like with all software) it would restore my tabs just fine. I just like it better than I ever did Chrome and I certainly like the organization behind Firefox better than that behind Chrome. :)",
          "And another proprietary service (&quot;make it an offline Chrome app&quot;). It&#x27;s the web, why would I want to be locked to a single vendor?",
          "Basically, it looks like it&#x27;s going to be Opera on the Chrome engine, but with the return all the cool unique features Opera ditched when they switched engines a little while back. And hopefully managed by a group that has the spirit from Opera&#x27;s good old days.",
          "I&#x27;m so glad that I&#x27;m not the only one asking for this.<p>I don&#x27;t understand what the use-case is. Why expend all that energy to make a custom native UI platform when all you end up doing is breaking the standards for my native OS? On Windows, Internet Explorer is the only browser that just gives a simple native window. Chrome and Firefox both cause issues because of their custom drawn windows. I don&#x27;t see any reason to use Vivaldi if they&#x27;re going to follow the same path.",
          "If you want to try multiple Chrome Users see <a href=\"https://support.google.com/chrome/answer/2364824?hl=en\" rel=\"nofollow\">https:&#x2F;&#x2F;support.google.com&#x2F;chrome&#x2F;answer&#x2F;2364824?hl=en</a><p>You can change users by clicking the top right of a chrome window.<p>They may not be obvious to set up, but they are worth learning about if you are going to use stick with Chrome and use multiple Google accounts, or multiple accounts on any service - Twitter, FB, etc.",
          "I also have better luck with tabs in Chrome. Overall CPU usage is lower, and the in-browser task inspector makes it trivial to ID bad tabs and close them.<p>Firefox is a lot better than it used to be, but it can still be brought to its knees across the board by a bad script, at least in my experience, and it&#x27;s hard to find the one bad tab to kill.",
          "Didn&#x27;t they change the spec for Proxies and as of Chrome v40 Proxy doesnt exist in the devtools? I tried it in my Chrome&#x2F;Canary and it wasn&#x27;t there however it did work in Firefox v35",
          "Apps that I explicitly installed on my Nexus 5: Chrome-to-phone, Chromecast, Google Drive (maybe that one came installed?), a metronome, and WhatsApp.<p>What I&#x27;m getting at, is that apps <i>interfaces</i> are generally better than web pages or &quot;web apps&quot;, but <i>everything else about them sucks</i>. They nag you constantly with updates and unsolicited request to do some action, require to think about permissions, and crash often.",
          "have you seen firebox for android? it&#x27;s years ahead of chrome.<p>you can have extensions to begin with. from ad blockers to stylish, which let people with poor vision actually use the browser.<p>also it allows you to disable all sort of asinine tracking that is forced in chrome.<p>expect Google to play a Microsoft on Mozilla harder and harder now.",
          "Unless Firefox opens sites instantly (instead of 1-2 sec wait) then I don&#x27;t see any speed benefit.<p>I&#x27;m gonna go out on a limb and say that the author probably has a lot of heavy addons that do stuff that is not needed. Biggest example probably is AdBlock Plus which bogs down any browser considerably and poking around with family&#x27;s and friends&#x27; Chromes I see that a lot of them have several ad blocking extensions as well as couple privacy extensions is it any wonder Safari or Firefox with no addons is faster?"
        ]
      }
    ],
    "positive": 0.4878048780487805,
    "negative": 0.04878048780487805,
    "neural": 0.45528455284552843
  },
  {
    "theme": "android",
    "frequencies": [
      {
        "freq": 50,
        "name": "frequency",
        "topComments": [
          "&gt; And obviously the same thing holds for the Watch and the bigger iPhone: they were in development for at least a couple of years, iterating and refining them.<p>Sources or guessing?<p>I think the similarity of how the iWatch and the Android watches work is <i>too</i> similar to be a coincidence. There&#x27;s some cool software work on Apple&#x27;s watch, and I believe it&#x27;ll generally be a better product overall. But it looks <i>just</i> like something somebody would make after seeing the competition and iterating an improvement on it. That&#x27;s my assertion and I&#x27;m going to stick with it until somebody proves me wrong.<p>&gt; Second, Samsung only started on their watches when rumours of an iWatch pending had already surfaced<p>IIR that&#x27;s correct. iWatch rumors started and Samsung tossed together the Gear to get it out the door first. Apple didn&#x27;t ship and now we&#x27;re on Gen 2 of Android watches while Apple releases a nearly identical product...even down to some fairly small use-case details. I&#x27;m not poo pooing the device, with Apple&#x27;s polish and tight integration I&#x27;d call it a Gen 2.5 smartwatch. It <i>looks</i> good, and going old-school Blackberry with the knob as an input device is a good idea. It&#x27;s probably a full half-to-full generation ahead of the current Android devices for very Apple-y reasons.<p>But there&#x27;s very little new here, and more important it&#x27;s <i>not</i> all that different. It doesn&#x27;t look like an independently developed device. It looks like a particularly well thought out Android smart watch. Apple could have...<i>should have</i>...gone a <i>completely</i> different direction with the watch, but they didn&#x27;t.<p>Basically your story doesn&#x27;t make any sense. The public story is that all Samsung knew was &quot;Apple is working on a watch&quot;, and with that information, completely independently tossed together (with a little help from Google) a device that, in the Gen 2 version of Android Smartwatches, <i>just so happens</i> to work almost exactly like the iWatch minus the nub. From needing to tether, to use-cases, to display turn-on when raised, etc. There&#x27;s a million different directions each watch development effort <i>could</i> have gone, yet both efforts coincidentally independently arrived at the same conclusion...with both teams operating in secret, probably on opposite sides of the planet.<p>The probably of that happen are only slightly less than throwing a bunch of parts into a dryer and at the end of the cycle getting a clock.<p><i>If</i> Samsung developed the smartwatch based on nothing more than a rumor and just slapped it together, then they did one hell of a job because that&#x27;s the template <i>all</i> new smart watches are currently following and they deserve a little more credit. If they copied Apple outright, then there&#x27;s some serious leaks in Apple&#x27;s R&amp;D department.<p>But neither of those cases fits Occam&#x27;s razor -- there are no coincidences...the similarities are too strong. It&#x27;s more likely Apple has been mulling around a watch for a while. Samsung slapped together a watch based on a rumor, the gen 2 devices were pretty good and Apple simply went the direction with the idea that Samsung had pioneered. The only other conclusion is that Samsung committed one of the greatest acts of industrial espionage since the Soviets stole the designs for the atom bomb.<p>Note: I don&#x27;t know why you&#x27;re getting downvoted, we&#x27;re just having a civil discussion. People get so emotional around Apple&#x27;s stuff.",
          "tl;dr: The only competition (IMO) is the LG G3, and IOS makes the difference (IMO).<p>I&#x27;ve owned a Nexus One, Samsung Galaxy S2, Moto X and LG G2.<p>Only the G2&#x27;s camera was decent, but it seems a fairly broad opinion that the iPhone 5&#x27;s camera is the better of the two.<p>Aside from the original iPhone&#x27;s lack of video recording, I&#x27;ve found iPhone cameras to consistently be best of breed.<p>As far as MicroSD: I rarely felt a pinch at 64GB. With higher resolution video (and bigger apps&#x2F;games over time) I think 128GB will probably serve pretty well.<p>It used to be that the MicroSD expansion on Androids was pretty limited. I&#x27;ve been told that&#x27;s changed, but I wouldn&#x27;t know since my last Android didn&#x27;t have it.<p>As far as battery goes: I much prefer an all-day battery over swapping. I found the iPhone 5&#x27;s battery to last quite a bit longer than the Moto X or G2 with similar usage patterns. It&#x27;s also smaller and much quicker to charge. Sort of like trickle-charging a Tesla vs a Leaf I guess. Bigger isn&#x27;t necessarily always better. If your battery is twice the size, but your phone consumes twice the power under active use, then all things being equal you&#x27;re going to double your charge time.<p>All things aren&#x27;t equal though as the 12w charger will take an iPhone from empty to 80% in what... 30 minutes? The G2 might recover 30% of it&#x27;s charge in that time if I&#x27;m lucky.<p>And no swappable battery.<p>So what does have a swappable battery, a really good camera, has 128GB of storage (or can be expanded to it), and runs Android? That&#x27;s a very short list I think.<p>The Moto X had a terrible camera at launch. After patching it was much improved, but still feel far short of the iPhone. The X+1 only has 32GB of storage (that I can figure out) and no MicroSD.<p>No Nexus device qualifies. Terrible cameras, no SD, no battery replacement.<p>Off the top of my head that leaves the G3, HTC One M8 and Samsung Galaxy S5 (might as well throw in the Note 3&#x2F;4 as well?).<p>Personal tastes and all, and I&#x27;m definitely in the vast majority of opinion on this, but I think the HTC is one of the uglier phones I&#x27;ve seen. Just don&#x27;t care for it at all.<p>The S5&#x27;s shots in the camera reviews I could find seem pretty consistently over saturated and blow out detail, especially in faces. It&#x27;s admittedly one of the best Android cameras I&#x27;ve seen. The 5S camera OTOH does seem less exposed in shaded shots. Maybe it&#x27;s just personal preference, but I feel like I&#x27;d rather preserve the detail and let Google Plus Photos Automagic Enhancement, or iPhoto Enhancement make a photo more punchy if necessary, than losing detail.<p>Plus I don&#x27;t take my kids to a lot of bars. So it&#x27;s important that under sunlight at the zoo the shots aren&#x27;t blown out. Under normal interior lighting conditions the iPhone seems to take the best pictures of people by far from the reviews I could find.<p>The G3 comes closest to meeting the requirements and earning the bonus of &quot;best out-of-box experience&#x2F;least crapware&quot;. Maybe that&#x27;s moving the goal-post a bit, but it&#x27;s still important to me in the same way it&#x27;s important to Nexus users. The Samsung... meh.<p>My biggest frustration with the G2 was slow charging and that <i>STUPID F</i>CKING MENU BUTTON*. I think the G3 is a definite improvement on both counts.<p>That&#x27;s my trouble with Android phones I guess. Lots of them have compelling features. But very few offer the whole package. It&#x27;s not so much Android vs iPhone at this point. It&#x27;s an LG G3 vs iPhone 6.<p>In that case, I think an iPhone 6 Plus with IOS8 wins on everything but price (it&#x27;s easily $300+ more expensive). For me. Simpler interface. Similar storage. Faster. Longer battery life. Quicker charging.<p>Don&#x27;t get me wrong, the G3 seems like a great value, and a legit alternative IMO. But I think the iPhone is the better package overall. I definitely prefer IOS&#x27;s navigation over the app-drawer&#x2F;menu in Android, I can count on 1 hand the number of times I found Google Now relevant or compelling over just using a Weather widget (I use Yelp, not Google, Passbook is better for Airlines IMO, but Google Now had the occasional suggestion for parks&#x2F;museums for the kids on the weekend, which was a nice surprise a few times).<p>This is just me. I&#x27;m a flip-flopper. ;-) But I figure others like myself might find talkin&#x27; it out useful. Or at least consider the LG G3. Which seems like the most Nexus-like device with the most complete package that I&#x27;ve seen on the Android side of the fence.<p>I also like the Day-1 software updates for iPhones though. They age much better IMO, and they&#x27;re supported much better. If you&#x27;re an off-contract user like myself, it might also be nice to know that the $300 price differential probably goes away when it&#x27;s time to trade it in. I just sold a G2 for $160 last night. That&#x27;s a 12 month old phone. I can sell my temporary backup iPhone 4S for the same price. A phone three times it&#x27;s age! Crazy.<p>Also, I&#x27;ve owned a Jeep Grand Cherokee, Nissan Leaf, and now Mazda 3. The iPhone Bluetooth or USB always works flawlessly with them. I&#x27;m lucky to get any Android phone I&#x27;ve used to connect 50% of the time. It feels like I have to reboot the phone more often than not.<p>Apparently this isn&#x27;t a problem for some people. But across different vehicles and different Androids I&#x27;ve found Bluetooth connections to be very flaky. So much that I don&#x27;t bother half the time unless I know I want to make a call on the drive home when I get in the car. Once a connection is established I&#x27;ve never had it disconnect that I can recall. It&#x27;s just that it won&#x27;t make the initial connection without a reboot. Turning on&#x2F;off Bluetooth or Airplane mode seems to have no effect. This is with a Moto X and LG G2.<p>Oh, but one thing I mentioned previously: iMessage. It&#x27;s hard to overstate how superior an experience it is forwarding the video you just recorded to another iPhone user. Hangouts is clunkier than iMessage and while I have a couple Android users in my family, getting them to figure out Hangouts so I can initiate a conversation with the right protocol so I can actually forward a video is something I haven&#x27;t been successful at yet. So I have to upload to Youtube instead and forward them a link. Which takes a minute or two instead of a few seconds. The difference in user-experience is night and day for a parent on the run...",
          "I can definitely agree that the gen 1 kindle fire left a lot to be desired.  The latest offerings are quite nice, though.<p>And, lets be honest, it isn&#x27;t like the earlier versions of any android device are worth writing home about.  Finally moved from a moto droidish era phone up to the moto g.  It is truly impressive how far they have come.",
          "They already have an ARM emulator: The Android emulator. Those who have suffered through it&#x27;s excruciating performance presumably wouldn&#x27;t wish that on their worst enemy..",
          "Also, Android should really start restricting their users to a certain screen size. Preferably very very small. This is a basic design principle that they really should have done their homework on.",
          "The Android Runtime for Chrome (ARC) beta is available for Linux&#x2F;OSX&#x2F;Windows too: <a href=\"http://dfiles.eu/files/i565k9sv8\" rel=\"nofollow\">http:&#x2F;&#x2F;dfiles.eu&#x2F;files&#x2F;i565k9sv8</a> (CRX file)",
          "Having portability to Windows Phone <i>is</i> a concern, and it is something that I am increasingly considering because it looks like an emerging, important platform. I prefer techniques and tools that allow me to cater to a multitude of platforms, because users are my customers, not platforms. I am not beholden to Apple or Google, and I don&#x27;t serve in their name.<p>However your point is comically specious in the context -- Android Play Store sales went from $0.9B, to $2.0B, to $5.0B over successive years (these numbers are in Google&#x27;s yearlies, despite your repeated claims that they&#x27;re mysteriously shrouded. They&#x27;re as transparent as Apple&#x27;s numbers). Android Play Store sales right now are where App Store sales were <i>last year</i>. Where were the people talking about the dire results of the App Store last year? In fact, quite contrary it was held as an incredible, unparamounted success, by people like you. And not only is the Play Store already there, it is seeing extraordinary growth.<p><i>I&#x27;m not sure why that should be an absurd observation</i><p>Your own points are contradictory, holding the dichotomy of the rich Android users (who all apparently were just waiting for a larger iPhone) versus the poor Android user, but then mashing them together into one universally &quot;poorer&quot; Android user.<p>Android is the platform of all demographics. We know that from the famous city analysis of Android&#x2F;iOS usage of twitter, where Android was dominant in the poorer areas of town, and similar to iOS in the rich areas of town. That is a <i>great</i> thing about the platform -- it is inclusive and lifts all boats -- and it is utterly reprehensible when some people hold this as a bizarre negative, as if platform association with the less wealthy brings it down.<p>It seems probable that the people in the richer areas are spending in the store. The people in the poorer areas aren&#x27;t. That&#x27;s life of consumable items and varying spending money. There is no great mystery to it. And your contention is that since all of those Android users with money are going to race to iPhone (the same story we&#x27;ve heard with every iOS release for years), there goes the store.<p>So how does a per capita basis make any sense? Oh because all facts need to be contrived into the message of Ben Evans?<p>I apologize for resorting to &quot;insults&quot;, but it seems that reality has an insult-based bias in the case of analyzing your various creations. You are selling to the converted.",
          "You mean, Android Police, not Associated Press, of course.",
          "There&#x27;s also a really great Android app called DSub that integrates really well with it (<a href=\"https://play.google.com/store/apps/details?id=github.daneren2005.dsub\" rel=\"nofollow\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=github.daneren...</a>)",
          "You haven&#x27;t understand a single damn thing about it, did you?\nNonetheless you&#x27;d be somehow right.\nThe phone is sold with android and then it is up to you to install another OS that goes along with it, may it be WebOS, Ubuntu Touch or Firefox OS.<p>So I guess not as many are sold with Firefox OS rather than Android, because ALL OF THEM ARE SOLD WITH ANDROID AND NONE WITH FIREFOX OS!<p>Other than that, instead of talking trash all over the place about Firefox OS, did you even try it? And if it wasn&#x27;t good enough for you, did you contribute to it? Because you know that half of it is written by volounteers, right? And if you can&#x27;t code, did you file bugs in Bugzilla, right? Because certainly you are not just badmouthing Firefox OS without a clue of what it is and how it works and doing the best to improve it in order to have a better smartphone ecosystem that would benefit everyone, right?"
        ]
      },
      {
        "freq": 42,
        "name": "frequency",
        "topComments": [
          "Likewise, got my wife on iOS to sign up, but shame I can&#x27;t use it on Android yet. Hoping you can launch it there too soon, I really think this could be fun! Great take on picture messaging.",
          "In my experience, it&#x27;s not the amount of software, but the amount of quality software. For instance, I wasn&#x27;t able to find a decent RSS reader that doesn&#x27;t stutter on the Nexus 7 (2013). Not to mention the ridiculous amount of rights some of the readers want. On my iphone, it&#x27;s hard to decide which reader I&#x27;ll use because they are really good (I&#x27;ve tried quite a few).<p>Music apps are still pretty much dominated by iOS. Also some quality games are only available on iOS or are released much later on Android.<p>While I do think that the &quot;app gap&quot; does indeed exist, I believe only dedicated geeks&#x2F;musicians&#x2F;gamers will notice it.",
          "Your link repeats again and again (and again) that his criticisms only apply to <i>password storage</i>. In his own words <i>&quot;as a Key Derivation Function, it is still very much useful and secure&quot;</i>.<p>As GP said, Android uses it as a disk encryption KDF.",
          "This is a perennial submission (<a href=\"http://hn.algolia.com/#!/story/forever/prefix/0/http%3A%2F%2Fwww.joelonsoftware.com%2Farticles%2FStrategyLetterV.html\" rel=\"nofollow\">http:&#x2F;&#x2F;hn.algolia.com&#x2F;#!&#x2F;story&#x2F;forever&#x2F;prefix&#x2F;0&#x2F;http%3A%2F%2...</a>) but hasn&#x27;t shown up in a while. I&#x27;m resubmitting it because it&#x27;s part of the canon: you can&#x27;t understand Silicon Valley big politics&#x2F;business without understanding this concept in some way - otherwise, you&#x27;ll be mystified by moves like Google&#x27;s Android or big tech giants going into fields that seem only tangentially related to their core business.",
          "No, I did not use libhybris. It boots the kernel I&#x27;ve patched and it uses a full Linaro filesystem on a micro SD. The Android FS is not even mounted when running GNU&#x2F;Linux.<p>The SoC is RK3188 and it uses a proprietary bootloader to do some hardware initialization IIRC.<p>The device does have an UART port, which I&#x27;ve used.",
          "&quot;Thanks for all of your feedback on this bug. We’ve heard you loud and clear.&quot;<p>Kudos to Google for hearing loud and clear the 127 people in that thread and potentially helped the numerous chromeOS community!<p>And here [1] are the cries of few thousands of souls that lost full access to their android sdcard. Hope you also hear their feedback louder and clearer! On the upside we learned how &quot;Bring it back&quot; is written in multiple languages.\n[1] <a href=\"https://code.google.com/p/android/issues/detail?id=67570\" rel=\"nofollow\">https:&#x2F;&#x2F;code.google.com&#x2F;p&#x2F;android&#x2F;issues&#x2F;detail?id=67570</a>",
          "I don&#x27;t understand how you come to the conclusion that putting Xorg in pid 1 would be even a remotely fitting comparison.<p>For starters, as an example, I have 100 times as many servers than I have desktops to deal with - for a lot of us Xorg is not an important factor. But the process manager is vital to all of them - server and desktop alike if you want to keep them running. If the process manager fails, it doesn&#x27;t matter if it wasn&#x27;t Xorg that took things down.<p>Secondly, that X clients fail if the server fails is not a good argument for moving Xorg into pid 1 too, because it would not solve anything. If pid 1 crashes, you&#x27;re out of luck - the best case fallback is to try to trigger a reboot.<p>Having (at least minimal) process management in pid 1 on the other hand serves the specific purpose of always retaining the ability to respawn required services - including X if needed. (Note that it is certainly not <i>necessary</i> to have as complicated respawn capabilities in pid 1 as Systemd does).<p>Having Xorg in pid 1 would not serve a comparable purpose at all: if it crashes, the process manager can respawn Xorg. If you then need to respawn X clients, and be able to recover from an Xorg crash, there are a number of ways to achieve that which can work fine as long as your process manager survives, including running the clients under a process manager, and have them interface with X via a solution like Xpra, or write an Xlib replacement to do state tracking in the client and allow for reconnects to the X server.<p>Desktop recoverability is also a lot less important for most people: Every one of our desktops have a human in front of it when it needs to be usable. Most of them are also rebooted regularly in &quot;controlled&quot; ways. Most applications running on them get restarted regularly. People see my usage as a bit weird when I keep my terminals and browsers open for a month or two at a time.<p>On the other hand, our servers are in separate data centres and need to be availably 24x7, and many have not been rebooted for years, and outside of Android and various embedded systems, this is where you find most Linux installs.<p>While we can remote reboot or power cycle most of them, with enough machines there is a substantial likelihood of complications if you reboot or <i>shudder</i> power cycle (last time we lost power to a rack, we lost 8 drives when it was restarted. Even with &quot;just&quot; reboots there is a substantial chance of problems that requires manual intervention to get the server functional again (disk checks running into problems; human error the last time something was updated etc.)<p>That makes it a big deal to increase the odds of the machines being resilient against becoming totally non-responsive.",
          "because using system flashlight app is too edgy, huh? Why you need extra app for thing you have just build in Android ? Check your widgets for &quot;Assistive light&quot;. Problem solved.",
          "Philip K. Dick&#x27;s <i>The Man in the High Castle</i> is definitely worth a read. <i>Valis</i> [or is it <i>VALIS</i>?] is also an interesting read...in the psychotropic sense of &quot;interesting&quot;.<p>I found <i>Do Androids Dream of Electric Sheep</i> worth a read for the way in which it differs from the movie...the importance as status symbols of synthetic animals in the novella and its implications in regard to synthetic human lives a more compelling theme than the straightforward human rights theme of <i>Blade Runner</i> [or <i>Alien</i> from the same period in film].<p>What&#x27;s funny is that I consider <i>God Emperor</i> and beyond to be the <i>Dune</i> series books worth skipping, but that&#x27;s probably because they came out after I had read the first three...at the time, trilogies were the thing due to Tolkien&#x27;s <i>Lord of the Rings</i> and Assimov&#x27;s <i>Foundation</i> series [later to also be extended like Herbert&#x27;s epic opus].",
          "Yeah but if you want to watch online stuff on your tv at this point you probably have about 6000 things that can run netflix etc, including the other google tv boxes, the amazon box, generic android boxes, the rokus, the apple tv, ps3&#x2F;ps4, xbox360&#x2F;xbox one, ps tv, chromecast, a hdmi cable or htpc etc."
        ]
      },
      {
        "freq": 38,
        "name": "frequency",
        "topComments": [
          "I looked in the logs on my public web server I host different sites on. I only found one UIDH record in my modsec_audit logs, but most worryingly it was it was for a personal injury trial lawyer. Made some records semi-anonymous.<p>--eee7b544-A--\n[25&#x2F;Sep&#x2F;2014:15:33:19 --0500] VCR8D6wUChkAAG-HuKQAAAAH 70.209.73.XXX 32675 X.X.X.X 80\n--eee7b544-B--\nGET &#x2F;wp-content&#x2F;uploads&#x2F;2012&#x2F;07&#x2F;XXXXXXXXXXX.jpg HTTP&#x2F;1.1\nX-UIDH: MTU4NTI5Mjg3AKafKcbQqnDdCMuP+UbmoCyKvEu8MnDsqV0I+AQ2K&#x2F;M+\nUser-Agent: Mozilla&#x2F;5.0 (Linux; Android 4.4.4; XT1030 Build&#x2F;SU4.21) AppleWebKit&#x2F;537.36 (KHTML, like Gecko) Version&#x2F;4.0 Chrome&#x2F;33.0.0.0 Mobile Safari&#x2F;537.36 GSA&#x2F;3.4.16.1149292.arm\nHost: www.XXXXXXXXX.com\nConnection: Keep-Alive\nAccept-Encoding: gzip",
          "There&#x27;s also Java -&gt; GWT -&gt; JS, using libGDX to target iOS&#x2F;Android&#x2F;WebGL:<p><a href=\"http://blog.puzzlingplans.com/post/100992521086/building-a-cross-platform-game-with-libgdx-part-4\" rel=\"nofollow\">http:&#x2F;&#x2F;blog.puzzlingplans.com&#x2F;post&#x2F;100992521086&#x2F;building-a-c...</a>",
          "From the article:<p><pre><code>  With Visual Studio 2015 Preview you can target Android and edit-compile-debug regardless\n  of your choice of programming models:\n\n  JavaScript (or TypeScript) with Cordova, C++, or C# with Xamarin.</code></pre>",
          "I imagine that like most of their devices, it&#x27;s running on the FireOS (Amazon&#x27;s fork of Android)",
          "Indeed. It looks nice, but I need to code in it a little before releasing a conclusion. I still have HighCharts as the standard for this.<p>Nice to hear that, I am looking at some right now...<p>What would you recommend for maximum compatibility?  (IOS, Android, Browsers) ?",
          "Not every tablet is an iPad-knockoff.<p>The original Kindle Fire blew the market for Android tablets wide open.",
          "The developer browser also includes Firefox Tools Adaptor which supports remote device debugging of mobile browsers like Chrome on Android and Safari on iOS:<p><a href=\"https://hacks.mozilla.org/2014/09/firefox-tools-adapter/\" rel=\"nofollow\">https:&#x2F;&#x2F;hacks.mozilla.org&#x2F;2014&#x2F;09&#x2F;firefox-tools-adapter&#x2F;</a>",
          "I think so, the app is purely focussed on OmniFocus integration and reuses their backend.<p>Most of my customers pay for the app because they are heavy OmniFocus users on the Mac and recently switched to Android.",
          "it&#x27;s a good reason to buy iphones.  Apple will let a poisoned ca cert on their phones about the same time hell freezes over.  Android can probably only be trusted if it&#x27;s a nexus phone.",
          "How else do you interpret &#x27;Andy you&#x27;re not the head of Android anymore, we&#x27;re giving your job to Sundar.&#x27;?"
        ]
      },
      {
        "freq": 34,
        "name": "frequency",
        "topComments": [
          "JSON is just banging strings together on the server side.<p>Rendering HTML on the server side is just banging (somewhat bigger) strings together.<p>JSON has lighter-weight transfer than HTML, but after compression the real-world impact is probably pretty marginal.<p>Say the JSON request was 50% fewer bytes though. It&#x27;s probably only 20% faster to generate server-side (WAG). If TTFB is 50ms for HTML, maybe it&#x27;s 40ms for JSON then. But then you render the HTML with a very fast renderer, while you must first parse the JSON into a JavaScript object. Then you create HTML elements paying most of the same rendering costs.<p>If your requests are fairly small and update only a small portion of the page, maybe the JSON is faster. I think you could consider this the &quot;traditional&quot; use-case for AJAX. The JSON isn&#x27;t really the important part there.<p>If your requests are large, then it&#x27;s probably much quicker to deliver HTML, and outright skip the interim parsing&#x2F;programatic-markup-construction penalty. IME. Which seems to be the strategy of sites like Twitter.<p>I think that&#x27;s a much simpler to reason about and execute solution as well.<p>My theory is that the only way that formula really swings in favor of JS, SPA, etc is if your application is a platform for multiple clients, wether that&#x27;s businesses or end-points (JS&#x2F;SPA, iOS, Android, etc), so you get a lot of mileage out of your API. But there&#x27;s no scenario in which that&#x27;s the _simpler_ overall solution I think. Though you might get benefits from teams dedicated to each platform, allowing them to ignore the complexities of the API, simplifying their individual domains overall. Which seems like a balancing act I suppose.<p>But circling back around to your comment, for the majority of platforms, rendering on the server allows you to write less code, and burn fewer total CPU cycles to render a request. If, like me, your typical applications are business oriented content-management or reporting based.<p>I think XML makes more sense than JSON for <i>data transport</i> in most cases. Richer types (you can actually represent Dates for example), faster transformations, you get to avoid programmatic generation and slow client-side templating. OTOH if your responses are <i>messages</i> instead of <i>data</i>, and you&#x27;re going to be handling them programmatically anyway, it&#x27;s hard to beat the convenience of JSON.<p>&#x2F;end-rambling",
          "Android is the best argument for the AGPL.",
          "It would also be good if users could install the app but without approving the full set of permissions. Developers would have to catch an exception, but it&#x27;s worth it. (Supposedly with one of the recent Android releases this feature was planned and made it to some users but Google quickly reverted.)",
          "Hi everyone!<p>We just launched Friends4Tonight! The app is on both iOS and Android. Please send us feedback at webcontact@friends4tonight.com or text&#x2F;call (917) 720-0983<p>Thanks!<p>Friends4Tonight Team",
          "True for iOS, certainly<p>And for good reasons. Reminds me of the initial complaint about &quot;no flash in iPhone&quot;, then someone managed to put it in an Android tablet and then they realised what a bad idea it is.",
          "&gt; The same people that would prefer if you give all permissions. I still see no reason why Google doesn&#x27;t implement more granular permissions models.<p>In fact they have gone the other way with &quot;permission groups&quot;<p>&gt; Has the latest Android given you the ability to restrict an apps permissions after install without resorting to trusting 3rd party tools like xPrivacy or uninstalling the app?<p>The hidden &quot;AppOps&quot; (post-install management of permissions) appeared in 4.3 but was removed in 4.4.2, so no.",
          "W3C has good basic info on what internationalization and localization each mean:\n<a href=\"http://www.w3.org/International/questions/qa-i18n.en\" rel=\"nofollow\">http:&#x2F;&#x2F;www.w3.org&#x2F;International&#x2F;questions&#x2F;qa-i18n.en</a><p>Many developers will make a start by:<p>- Internationalizing their strings.  In the case of Android, this is typically achieved by moving hard coded strings from the code to a separate strings.xml file<p>- Localizing those strings: Having one or more professional or volunteer translators create localized versions.<p>Different platforms use different file formats for localized strings.  For example, a lot of web frameworks use .po files: <a href=\"https://www.drupal.org/node/1814954\" rel=\"nofollow\">https:&#x2F;&#x2F;www.drupal.org&#x2F;node&#x2F;1814954</a><p>Best practices:<p>- Don&#x27;t re-invent the wheel.  Use libraries provided by others, e.g. <a href=\"https://developers.google.com/international/i18n\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;international&#x2F;i18n</a><p>- Decide which languages you will want to support over the long term, and think about what it will take for you to be successful (e.g. local support staff, marketing effort, ...)<p>- Don&#x27;t stop at translation.  Do all the other stuff (number&#x2F;date formats, support for right-to-left languages)<p>- Of course, use UTF-8 or UTF-16<p>- Choose the right platforms&#x2F;partners for translation.  Google offers a service targeted at Android apps[0] and there are crowdsourcing platforms which may work if your users are willing to translate for you [1][2].  These work for web apps as well as native.<p>- Get a native speaker to do QA on the output (on the app itself, not just by looking at the strings file)<p>[0] <a href=\"http://android-developers.blogspot.com/2013/11/app-translation-service-now-available.html\" rel=\"nofollow\">http:&#x2F;&#x2F;android-developers.blogspot.com&#x2F;2013&#x2F;11&#x2F;app-translati...</a><p>[1] <a href=\"https://www.transifex.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;www.transifex.com&#x2F;</a><p>[2] <a href=\"https://crowdin.com/\" rel=\"nofollow\">https:&#x2F;&#x2F;crowdin.com&#x2F;</a><p>FYI - I work for Google",
          "I wonder what kind of &quot;license issues&quot; are present in the current software?<p><i>&quot;U-boot&#x2F;Kernel&#x2F;Linux source code will be released 15-Dec-2014. Android source code will be published in February after cleaning some license issues.&quot;</i><p>Looks like the biggest problem with most of these ARM boards (raspberry pi included) is the dependency on some closed-source binary blobs, at least for boot, and sometimes even the entire kernel is a closed branch off some old release.",
          "Why would you want to ? Can you develop Windows apps on a Windows RT device? What about iOS apps on an iPhone? Or Blackberry apps on a Blackberry?\nDespite the fact that you can with tools like AIDE on Android, the devices are meant to be low-powered convenience devices, not developer workstations. I think you might be misinterpreting their purpose?",
          "I have an Android phone that&#x27;s not rooted, an Acer. Turning off shutter sound is in the camera settings, it&#x27;s one of the first things I do with a camera as I prefer natural photos of family to posed ones."
        ]
      },
      {
        "freq": 33,
        "name": "frequency",
        "topComments": [
          "FireTV was a much, much easier product to develop. It was pretty clear an Android STB was worth doing. In this case, Amazon wisely took the simplest path to get there: Google TV + better content deals and updated hardware and software.",
          "Ah, the &quot;Android&quot; model. Dump your car as soon as it&#x27;s out of warranty and you&#x27;re safe :)",
          "That workaround didn&#x27;t work for me.<p>Auth from either &#x2F; or &#x2F;logout both come back with:<p>&quot;Twitter is currently down for maintenance.\nWe expect to be back shortly. For more information, check out Twitter Status. Thanks for your patience!&quot;<p>I first noticed this when the mobile app (Android) notified me of an auth error.<p>Still no word on <a href=\"http://status.twitter.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;status.twitter.com&#x2F;</a>",
          "&gt; makes it seem like you&#x27;re not open to dialogue.<p>Complaining about downvotes without replies makes it seem like I&#x27;m not open to dialogue? I think it makes some people in here seem like they live in a bubble, to each their own huh?<p>&gt; But this thread isn&#x27;t about $40 smartphones<p>Actually, it is; GGP said he &quot;knows people too cheap to pay $1 for apps&quot; and that is completely valid for Android as well. The rest of your post&#x27;s premise is wrong on that basis. I&#x27;m not claiming iphones are popular amongst that sector of the population. But even if I did, as someone else said below, actual pirated&#x2F;resold iphones do cost around 30-40 USD making them just as accessible.<p>Edit: And I don&#x27;t mean to be rude, it just disgusts me how some people here are so full of money it doesn&#x27;t even register that for some, $1 is a big deal.",
          "Yep. The power button on my Nexus 5 just went up and I had the choice of throwing money at a 14-month-old phone (which is a bit sooner than I had hoped to replace it but old enough that I had to think twice about paying for maintenance) or buying a new phone.  Nexus 6 at $650 and in a larger form factor than I would like got me to buy a Moto X instead.  $200 cheaper and in a more reasonable size made it the closest thing to a Nexus 5 replacement I ran across.<p>I would have gladly considered something from Amazon if it had been along the lines of an updated Nexus 5 (under $400, stock or virtually stock like the Moto X) even if, like the Nexus line, it sacrificed a bit of that premium &quot;Cadillac&quot; polish like the wooden back and metal edged frame.  Only reason I even bothered with that is because there wasn&#x27;t a cheaper Nexus that wasn&#x27;t the year+ old N5.<p>Hell...don&#x27;t even bundle gapps if you want to include the Amazon store...just as long as someone can build AOSP for it and I can install it myself.<p>When the Nexus 7 came out it was roughly equivalent to the Kindle Fire in terms of price and specs but other than fellow Android fans and tech site readers, I didn&#x27;t know anyone else who bought a Nexus 7.  Everyone I knew who wanted an affordable (read: cheaper than an iPad) but functional small tablet bought Kindle Fires so clearly their brand awareness and marketing is worth something if people were willing to buy an slightly inferior device for $50 more.",
          "When I first saw them I assumed Magic Cap was also influential in some early Android pre-1.0 concepts.<p>Rubin was an engineer on Magic Cap either at General Magic or when it was still Apple if I recall correctly.",
          "I wouldn&#x27;t be surprised if they started checking the GPS in the future, though - like you, I thought they would be.<p>The full list is:<p><pre><code>   &lt;uses-permission android:name=&quot;com.netflix.mediaclient.permission.C2D_MESSAGE&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.ACCESS_NETWORK_STATE&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.ACCESS_WIFI_STATE&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.BLUETOOTH&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.CHANGE_WIFI_MULTICAST_STATE&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.GET_ACCOUNTS&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.GET_TASKS&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.INTERNET&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.READ_PHONE_STATE&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;android.permission.WAKE_LOCK&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;com.amazon.permission.SET_FLAG_NOSOFTKEYS&quot;&#x2F;&gt;\n   &lt;uses-permission android:name=&quot;com.google.android.c2dm.permission.RECEIVE&quot;&#x2F;&gt;</code></pre>",
          "Hey Folks,<p>I&#x27;ve created an add-on for Firefox and Chrome as an attempt to address the problem of password fatigue across websites. There is detailed documentation about the internals at:<p><a href=\"http://manzdagratiano.github.io/gobbledygook/\" rel=\"nofollow\">http:&#x2F;&#x2F;manzdagratiano.github.io&#x2F;gobbledygook&#x2F;</a><p>Download links are available at the bottom of the README from the Firefox add-ons page or the Chrome Web Store. It is currently in the review process for Firefox.<p>The next step is to port it to Android as a standalone app (since Chrome does not have extensions on Android, and the Firefox add-on API for mobile is very limited).<p>The documentation page addresses some concerns that may be raised about JavaScript cryptography.<p>I hope you find it useful. Constructive criticism is welcome. Please raise an issue on GitHub if you find there are any gaping flaws in the design that would leave the user vulnerable.",
          "Irrelevant. Chrome laptops or Android devices are everywhere. And classic Linux desktop such as Ubuntu is very common worldwide.",
          " &gt; A lot of other stuff happened instead<p>But before that happened something else happened (which is more important, and you forgot about it, it seems) and that is GCC, Linux and other free software.  Linux runs on tiniest embedded devices, Android phones, military hardware, servers, and so on. It was possible in large by GCC and GNU.<p>Have you been around in the early 90s and 80s. Having high grade OSes or compilers that were free as in beer or speech would have sounded ridiculous. You&#x27;d sound like you were from Mars if you talked about such things.<p>Yet here we are. We have reliable, high grade operating systems based on ideas of fruits of free software movement -- CentOS, Ubuntu, Deb etc.  Because of GPL in large anyone can take advantage and reap the benefits of shared work (such as by using CentOS instead of RHEL) while letting Redhat employees still put bread on the table.<p>Show me Apple&#x27;s OS X code that was modified for NetBSD and FreeBSD projects? Where are those improvements? I haven&#x27;t seen them.<p>So yes now this &quot;service&quot; and &quot;cloud&quot; stuff is happening. But let not forget that for this to happen the even the idea of &quot;open source&quot; and &quot;free software&quot; as viable alternative had to take root. I believe if it were not for GPL and Stallman we wouldn&#x27;t have had this culture of sharing between large corportations."
        ]
      },
      {
        "freq": 44,
        "name": "frequency",
        "topComments": [
          "Obtaining multiple electrons by forcing a single one to bounce back and forth all the way across the time line a zillion times seems like a major design smell. That would be the worst hack ever, or at least the worst one before Facebook devs hacked Dalvik just to get their app to run on Android: <a href=\"http://jaxenter.com/facebooks-completely-insane-dalvik-hack-105776.html\" rel=\"nofollow\">http:&#x2F;&#x2F;jaxenter.com&#x2F;facebooks-completely-insane-dalvik-hack-...</a> ;)<p>Perhaps our universe is one created by a junior, or an intern, and this &quot;creative&quot; workaround got mocked on TheDailyWTF somewhere.",
          "That sounds like a huge hassle to be honest. My android phone had a feature that made the screen stay on as long as I was looking at it - it was a disaster. It just did not work properly. I ended up deactivating all that crap and just set the screen to never go off, unless I explicitly press the button.",
          "Maybe this is an issue on iOS, but on Android you would just hit the back button. It&#x27;s not the ideal experience, although the last time that I viewed the Play Store from a browser on mobile that was also pretty far from ideal.",
          "Kinda. It would be nicer to limit permissions on a per-&quot;application&quot; level, requiring one-time explicit grants from the user, kinda like how a lot of platforms already do it (web browsers, Android APK, etc).",
          "were you expecting Go to have a large role in code shared by ios&#x2F;android&#x2F;web?",
          "Android ones? Care to name a few?",
          "Android already does this. It&#x27;s called Smart Lock. Just set your computer as a trusted device:<p><a href=\"https://support.google.com/nexus/answer/6093922?hl=en-CA\" rel=\"nofollow\">https:&#x2F;&#x2F;support.google.com&#x2F;nexus&#x2F;answer&#x2F;6093922?hl=en-CA</a>",
          "You can check out Adobe AIR; it uses Actionscript 3 and it deploys to web, desktop, Android, and iOS. In practice you can straight up copy-paste an AS3 codebase into an AIR project and have it work 99%. And I like to think that Adobe is more committed to supporting AIR since it&#x27;s available for mobile.",
          "The article is about speeding up a Rails app. Unless you&#x27;re planning on hosting that web server on OS X, iOS or an Android device, RubyMotion is not going to be of much use.",
          "In China, everyone reads books on their phone and China Mobile is the biggest telephone service provider and e-bookseller. What is iPhone penetration like in China? The iBooks store won&#x27;t permit Chinese language books. Better think of an Android app as well."
        ]
      }
    ],
    "positive": 0.562962962962963,
    "negative": 0,
    "neural": 0.43703703703703706
  },
  {
    "theme": "advertisement",
    "frequencies": [
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 4,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 3,
        "name": "frequency",
        "topComments": []
      },
      {
        "freq": 2,
        "name": "frequency",
        "topComments": []
      }
    ],
    "positive": 0.5,
    "negative": 0.5,
    "neural": 0
  },
  {
    "theme": "google",
    "frequencies": [
      {
        "freq": 136,
        "name": "frequency",
        "topComments": [
          "You could make an argument that CloudFlare is centralization, but you could ALSO make an argument that CloudFlare, by letting smaller sites continue self-hosting but using CloudFlare for scaling, is also more decentralized than the realistic alternatives.<p>I&#x27;d ALSO prefer a world where everyone can get 10G to the home&#x2F;office, great power, and global anycast with a bunch of sites around the world, from an infinity of vendors without strong content controls.  Unfortunately, the alternatives to CloudFlare-like services seem to be:<p>1) Inability to resist DDoS&#x2F;traffic surges&#x2F;etc. -- if you&#x27;re popular or controversial, this isn&#x27;t great.<p>2) Hosting with large global entities (AWS, Google, etc.) with much more restrictive content policies, and with greater control over the technical stack you use.<p>3) Setting a pretty high floor for cost or technical competence to host a site (you&#x27;re a clear outlier on the technical competence side in 2014, with colo&#x27;d boxes.  sadly)<p>I love being able to spin up a random VM on my personal colo&#x27;d hardware, behind CloudFlare, and know it can deal with attacks or load; it would cost me a lot to build every random thing entirely on its own.<p>There are some potential issues with using CloudFlare for certain kinds of sites (turning over SSL keys, for instance, if you want us to handle your https traffic), but we have technical solutions to those, some of which we&#x27;ve presented over the past year, such as &quot;keyless ssl&quot;, where you continue to retain custody of the private key and we just ask you every time we need to open a session to a new user.<p>It&#x27;s not a perfect solution, but I think using CloudFlare is actually the best available choice for a lot of sites, and we&#x27;re trying to make it better all the time.<p>And yes -- the end of Net Neutrality probably wouldn&#x27;t hurt CloudFlare very much; it would arguably make it harder to run a site without it, or without going to some kind of provider who has also negotiated with the access networks.  This isn&#x27;t really a commercial decision so much as a &quot;we like the free Internet and support it&quot; decision.",
          "Google responds to legal requests for information. The whole PRISM scandal was indicating that the NSA had some kind of direct link into the databases themselves. This assertion is what Google denied, and still denies.<p>There&#x27;s been a bit of a wandering definition for PRISM, from &quot;they have NSA software with root access to all machines!&quot; to &quot;they receive LEO requests for information, which they review, and sometimes fulfill.&quot; The former is untrue, and the latter is true.",
          "&gt; And obviously the same thing holds for the Watch and the bigger iPhone: they were in development for at least a couple of years, iterating and refining them.<p>Sources or guessing?<p>I think the similarity of how the iWatch and the Android watches work is <i>too</i> similar to be a coincidence. There&#x27;s some cool software work on Apple&#x27;s watch, and I believe it&#x27;ll generally be a better product overall. But it looks <i>just</i> like something somebody would make after seeing the competition and iterating an improvement on it. That&#x27;s my assertion and I&#x27;m going to stick with it until somebody proves me wrong.<p>&gt; Second, Samsung only started on their watches when rumours of an iWatch pending had already surfaced<p>IIR that&#x27;s correct. iWatch rumors started and Samsung tossed together the Gear to get it out the door first. Apple didn&#x27;t ship and now we&#x27;re on Gen 2 of Android watches while Apple releases a nearly identical product...even down to some fairly small use-case details. I&#x27;m not poo pooing the device, with Apple&#x27;s polish and tight integration I&#x27;d call it a Gen 2.5 smartwatch. It <i>looks</i> good, and going old-school Blackberry with the knob as an input device is a good idea. It&#x27;s probably a full half-to-full generation ahead of the current Android devices for very Apple-y reasons.<p>But there&#x27;s very little new here, and more important it&#x27;s <i>not</i> all that different. It doesn&#x27;t look like an independently developed device. It looks like a particularly well thought out Android smart watch. Apple could have...<i>should have</i>...gone a <i>completely</i> different direction with the watch, but they didn&#x27;t.<p>Basically your story doesn&#x27;t make any sense. The public story is that all Samsung knew was &quot;Apple is working on a watch&quot;, and with that information, completely independently tossed together (with a little help from Google) a device that, in the Gen 2 version of Android Smartwatches, <i>just so happens</i> to work almost exactly like the iWatch minus the nub. From needing to tether, to use-cases, to display turn-on when raised, etc. There&#x27;s a million different directions each watch development effort <i>could</i> have gone, yet both efforts coincidentally independently arrived at the same conclusion...with both teams operating in secret, probably on opposite sides of the planet.<p>The probably of that happen are only slightly less than throwing a bunch of parts into a dryer and at the end of the cycle getting a clock.<p><i>If</i> Samsung developed the smartwatch based on nothing more than a rumor and just slapped it together, then they did one hell of a job because that&#x27;s the template <i>all</i> new smart watches are currently following and they deserve a little more credit. If they copied Apple outright, then there&#x27;s some serious leaks in Apple&#x27;s R&amp;D department.<p>But neither of those cases fits Occam&#x27;s razor -- there are no coincidences...the similarities are too strong. It&#x27;s more likely Apple has been mulling around a watch for a while. Samsung slapped together a watch based on a rumor, the gen 2 devices were pretty good and Apple simply went the direction with the idea that Samsung had pioneered. The only other conclusion is that Samsung committed one of the greatest acts of industrial espionage since the Soviets stole the designs for the atom bomb.<p>Note: I don&#x27;t know why you&#x27;re getting downvoted, we&#x27;re just having a civil discussion. People get so emotional around Apple&#x27;s stuff.",
          "Points 2-4 would involve Google violating (likely) their own Ts&amp;Cs with customers and (possibly?) state&#x2F;federal law.<p>But I think your Point 1 is highly likely.  How many startups are going to build on Google&#x27;s Cloud Platform, then after a year port everything to AWS, particularly if Google can prove that they&#x27;re cheaper or at least cost-competitive with similar feature set.  (Assuming that&#x27;s true, of course, and that you don&#x27;t need something <i>specific</i> to AWS)",
          "Attilla Danko has some really useful information on his website <a href=\"http://cleardarksky.com/csk/\" rel=\"nofollow\">http:&#x2F;&#x2F;cleardarksky.com&#x2F;csk&#x2F;</a><p>He can generate clear sky charts for most of Canada and the U.S.  You can see light pollution maps and there are links to this Google Maps light pollution overlay:<p><a href=\"http://djlorenz.github.io/astronomy/lp2006/overlay/dark.html\" rel=\"nofollow\">http:&#x2F;&#x2F;djlorenz.github.io&#x2F;astronomy&#x2F;lp2006&#x2F;overlay&#x2F;dark.html</a>",
          "&gt; Google does not host a forum dedicated to spreading nude pictures of celebrities.<p>Sure there&#x27;s no Google Group (not just a Usenet group) dedicated to hosting such images?  Or a Blogger site that does similar?",
          "Most people think that they are better drivers than other people.  Even the terrible drivers think this.<p>And, really, you want other drivers to be better so Google&#x27;s cars probably are what you want.",
          "See <a href=\"http://www.youtube.com/watch?v=zsXP8qeFF6A\" rel=\"nofollow\">http:&#x2F;&#x2F;www.youtube.com&#x2F;watch?v=zsXP8qeFF6A</a> for a video that made me build this.<p>Google for &quot;ayumu chimp&quot; for a number of articles on the subject.",
          "It&#x27;s a cache problem, and it&#x27;s clearly visible once you click on specific image.<p>Here&#x27;s an &quot;official&quot; thread: <a href=\"https://productforums.google.com/forum/#!topic/websearch/gNvWXP4-0JE/discussion\" rel=\"nofollow\">https:&#x2F;&#x2F;productforums.google.com&#x2F;forum&#x2F;#!topic&#x2F;websearch&#x2F;gNv...</a>",
          "tl;dr: The only competition (IMO) is the LG G3, and IOS makes the difference (IMO).<p>I&#x27;ve owned a Nexus One, Samsung Galaxy S2, Moto X and LG G2.<p>Only the G2&#x27;s camera was decent, but it seems a fairly broad opinion that the iPhone 5&#x27;s camera is the better of the two.<p>Aside from the original iPhone&#x27;s lack of video recording, I&#x27;ve found iPhone cameras to consistently be best of breed.<p>As far as MicroSD: I rarely felt a pinch at 64GB. With higher resolution video (and bigger apps&#x2F;games over time) I think 128GB will probably serve pretty well.<p>It used to be that the MicroSD expansion on Androids was pretty limited. I&#x27;ve been told that&#x27;s changed, but I wouldn&#x27;t know since my last Android didn&#x27;t have it.<p>As far as battery goes: I much prefer an all-day battery over swapping. I found the iPhone 5&#x27;s battery to last quite a bit longer than the Moto X or G2 with similar usage patterns. It&#x27;s also smaller and much quicker to charge. Sort of like trickle-charging a Tesla vs a Leaf I guess. Bigger isn&#x27;t necessarily always better. If your battery is twice the size, but your phone consumes twice the power under active use, then all things being equal you&#x27;re going to double your charge time.<p>All things aren&#x27;t equal though as the 12w charger will take an iPhone from empty to 80% in what... 30 minutes? The G2 might recover 30% of it&#x27;s charge in that time if I&#x27;m lucky.<p>And no swappable battery.<p>So what does have a swappable battery, a really good camera, has 128GB of storage (or can be expanded to it), and runs Android? That&#x27;s a very short list I think.<p>The Moto X had a terrible camera at launch. After patching it was much improved, but still feel far short of the iPhone. The X+1 only has 32GB of storage (that I can figure out) and no MicroSD.<p>No Nexus device qualifies. Terrible cameras, no SD, no battery replacement.<p>Off the top of my head that leaves the G3, HTC One M8 and Samsung Galaxy S5 (might as well throw in the Note 3&#x2F;4 as well?).<p>Personal tastes and all, and I&#x27;m definitely in the vast majority of opinion on this, but I think the HTC is one of the uglier phones I&#x27;ve seen. Just don&#x27;t care for it at all.<p>The S5&#x27;s shots in the camera reviews I could find seem pretty consistently over saturated and blow out detail, especially in faces. It&#x27;s admittedly one of the best Android cameras I&#x27;ve seen. The 5S camera OTOH does seem less exposed in shaded shots. Maybe it&#x27;s just personal preference, but I feel like I&#x27;d rather preserve the detail and let Google Plus Photos Automagic Enhancement, or iPhoto Enhancement make a photo more punchy if necessary, than losing detail.<p>Plus I don&#x27;t take my kids to a lot of bars. So it&#x27;s important that under sunlight at the zoo the shots aren&#x27;t blown out. Under normal interior lighting conditions the iPhone seems to take the best pictures of people by far from the reviews I could find.<p>The G3 comes closest to meeting the requirements and earning the bonus of &quot;best out-of-box experience&#x2F;least crapware&quot;. Maybe that&#x27;s moving the goal-post a bit, but it&#x27;s still important to me in the same way it&#x27;s important to Nexus users. The Samsung... meh.<p>My biggest frustration with the G2 was slow charging and that <i>STUPID F</i>CKING MENU BUTTON*. I think the G3 is a definite improvement on both counts.<p>That&#x27;s my trouble with Android phones I guess. Lots of them have compelling features. But very few offer the whole package. It&#x27;s not so much Android vs iPhone at this point. It&#x27;s an LG G3 vs iPhone 6.<p>In that case, I think an iPhone 6 Plus with IOS8 wins on everything but price (it&#x27;s easily $300+ more expensive). For me. Simpler interface. Similar storage. Faster. Longer battery life. Quicker charging.<p>Don&#x27;t get me wrong, the G3 seems like a great value, and a legit alternative IMO. But I think the iPhone is the better package overall. I definitely prefer IOS&#x27;s navigation over the app-drawer&#x2F;menu in Android, I can count on 1 hand the number of times I found Google Now relevant or compelling over just using a Weather widget (I use Yelp, not Google, Passbook is better for Airlines IMO, but Google Now had the occasional suggestion for parks&#x2F;museums for the kids on the weekend, which was a nice surprise a few times).<p>This is just me. I&#x27;m a flip-flopper. ;-) But I figure others like myself might find talkin&#x27; it out useful. Or at least consider the LG G3. Which seems like the most Nexus-like device with the most complete package that I&#x27;ve seen on the Android side of the fence.<p>I also like the Day-1 software updates for iPhones though. They age much better IMO, and they&#x27;re supported much better. If you&#x27;re an off-contract user like myself, it might also be nice to know that the $300 price differential probably goes away when it&#x27;s time to trade it in. I just sold a G2 for $160 last night. That&#x27;s a 12 month old phone. I can sell my temporary backup iPhone 4S for the same price. A phone three times it&#x27;s age! Crazy.<p>Also, I&#x27;ve owned a Jeep Grand Cherokee, Nissan Leaf, and now Mazda 3. The iPhone Bluetooth or USB always works flawlessly with them. I&#x27;m lucky to get any Android phone I&#x27;ve used to connect 50% of the time. It feels like I have to reboot the phone more often than not.<p>Apparently this isn&#x27;t a problem for some people. But across different vehicles and different Androids I&#x27;ve found Bluetooth connections to be very flaky. So much that I don&#x27;t bother half the time unless I know I want to make a call on the drive home when I get in the car. Once a connection is established I&#x27;ve never had it disconnect that I can recall. It&#x27;s just that it won&#x27;t make the initial connection without a reboot. Turning on&#x2F;off Bluetooth or Airplane mode seems to have no effect. This is with a Moto X and LG G2.<p>Oh, but one thing I mentioned previously: iMessage. It&#x27;s hard to overstate how superior an experience it is forwarding the video you just recorded to another iPhone user. Hangouts is clunkier than iMessage and while I have a couple Android users in my family, getting them to figure out Hangouts so I can initiate a conversation with the right protocol so I can actually forward a video is something I haven&#x27;t been successful at yet. So I have to upload to Youtube instead and forward them a link. Which takes a minute or two instead of a few seconds. The difference in user-experience is night and day for a parent on the run..."
        ]
      },
      {
        "freq": 120,
        "name": "frequency",
        "topComments": [
          "Google Now does the same with commute times, and seems to automatically work out where you live and work. Same with appointment reminders, assuming you added a specific location to your calendar event - it&#x27;s a bit hit and miss for me whether these reminders actually come up, but sometimes it tells me &quot;Leave now to get to this appointment on time&quot;.<p>Things like these are a much more useful part of it than voice detection, I very rarely interact with it via voice, and tend to just do searches through my normal browser. It also hooks into Gmail and can give you reminders about things like flights you&#x27;ve booked, although that raises questions about privacy, and whether you really want Google to be trawling through your emails.",
          "This is a perennial submission (<a href=\"http://hn.algolia.com/#!/story/forever/prefix/0/http%3A%2F%2Fwww.joelonsoftware.com%2Farticles%2FStrategyLetterV.html\" rel=\"nofollow\">http:&#x2F;&#x2F;hn.algolia.com&#x2F;#!&#x2F;story&#x2F;forever&#x2F;prefix&#x2F;0&#x2F;http%3A%2F%2...</a>) but hasn&#x27;t shown up in a while. I&#x27;m resubmitting it because it&#x27;s part of the canon: you can&#x27;t understand Silicon Valley big politics&#x2F;business without understanding this concept in some way - otherwise, you&#x27;ll be mystified by moves like Google&#x27;s Android or big tech giants going into fields that seem only tangentially related to their core business.",
          "&quot;Thanks for all of your feedback on this bug. We’ve heard you loud and clear.&quot;<p>Kudos to Google for hearing loud and clear the 127 people in that thread and potentially helped the numerous chromeOS community!<p>And here [1] are the cries of few thousands of souls that lost full access to their android sdcard. Hope you also hear their feedback louder and clearer! On the upside we learned how &quot;Bring it back&quot; is written in multiple languages.\n[1] <a href=\"https://code.google.com/p/android/issues/detail?id=67570\" rel=\"nofollow\">https:&#x2F;&#x2F;code.google.com&#x2F;p&#x2F;android&#x2F;issues&#x2F;detail?id=67570</a>",
          "I don&#x27;t understand the downvote, because I can easily think of non-altruistic reasons for this move.<p>1) I have no doubt Google already tracks their contractors&#x27; staff turnover. <i>Every</i> industry has institutional knowledge, and if staff turnover is high, not enough of the knowledge gets transferred. If the prestige of being a Googler is enough to counter that trend, it may be well worth a lot more than the monetary cost.<p>2) Assuming the detail about &quot;gbus&quot; access is true, the security guards traveling on the buses will have personal incentives for keeping them safer.<p>3) This move may attract the kinds of people Google wants for their physical security. (Related to point #1.)<p>So while Google may well be riding the social awareness wave for PR purposes, there are bound to be real corporate reasons behind the move too.",
          "<a href=\"https://support.google.com/websearch/answer/465?hl=en\" rel=\"nofollow\">https:&#x2F;&#x2F;support.google.com&#x2F;websearch&#x2F;answer&#x2F;465?hl=en</a>\n&quot;When you delete items from your Search History, they are no longer associated with your Google Account.&quot;<p>Whether you think that&#x27;s sufficient or not, at least I have the option. And the last octet in my IP address is automatically modified after 9 months and deleted after 18 months even if I don&#x27;t do anything. If you can tell me how I can do the same thing with Apple&#x27;s search log files, and what Apple&#x27;s IP address retention policy for its search log files, I&#x27;d be much obliged...",
          "Yeah, there are some suckers in this post who do nothing better than complain.\nAuthor did not copy anyone&#x27;s content rather simply linked and compiled the list. \nBy that logic you should also complain about Google because all they do is show results for query and link to other people&#x27;s content.<p>Does anyone have link to cached version ?",
          "From a linked article off this article...<p>&gt;Moreover, Google lodges takedown notices it receives at ChillingEffects.org, so Verlander&#x27;s demand now is public. That creates another issue because Google has in effect provided a road map for any voyeur looking for sites that refuse to remove stolen photos. Google has contributed to ChillingEffects.org for the sake of &quot;transparency&quot; — a funny word in the context of a now infamous privacy breach — but IP attorney Jon Steinsapir says Google &quot;could use some discretion here for good manners and good taste.&quot;<p>No, Google cannot. Transparency that is not transparent does not work, every single removal demand will also come with a anti-transparency demand. While this is bad for a few people that have lost their privacy due to issues such as the listed in this article, the vast number of removal requests are by corporations seeking to control media they may or may not actually have rights to control and such actions need to be in the public eye.",
          "How is that any different from trusting Google Drive with your data? Or Dropbox? Or any other cloud backup services?<p>I&#x27;m not saying that it&#x27;s not a problem, because it clearly is, but it sounds like it&#x27;s a bit too late to be this worried about our business-related files stored on remote servers&#x2F;services.",
          "Why would that be the case? If somebody wants to sell me fishing poles, the only data that&#x27;s valuable to them is data that predicts how likely I am to buy fishing poles. And I don&#x27;t think there&#x27;s <i>any</i> data an advertiser could capture that would do a better job of that than what Google and Facebook already have on offer.",
          "It&#x27;s stated pretty clear on the page, isn&#x27;t it? But if you are asking if there is an approval screen, than yes, there is. It&#x27;s a regular OAuth2 token, and I make use of Google Contacts API. Naturally, I don&#x27;t really have access to your Gmail..."
        ]
      },
      {
        "freq": 147,
        "name": "frequency",
        "topComments": [
          "Why in the world would Google disclose information about you to its customers when it can probably make more money by being squarely in the middle?<p>&gt;&gt; Hello, do you need to find someone who might be interested in buying Toyota cars? What&#x27;s the message that you&#x27;d want plastered all over the Internet for this guy? OK, just sign this check and it will be done.",
          "There were plenty of &quot;non-techies&quot; who used Google Reader before it shut down. And at least in my circles there are plenty of non-techies who say that they don&#x27;t get the concept of twitter.<p>EDIT: Both, Twitter and RSS, have their own terms and concepts which need some kind of introduction for most, especially non-tech people. For Twitter its hashtag, TL, DM, etc for RSS its stuff like Feed, Reader, etc",
          "Release early, release often, iterate fast. Google&#x27;s doing these things.<p>Just because you have the resources to do something doesn&#x27;t make it a wise use of resources.",
          "Add satellites to a quickly growing list of unforeseen options that includes google fiber, municipal broadband, etc. and collectively they will soon be enough to make slow&#x2F;fast lanes a suicidal proposition for major ISPs. The whole raison d&#x27;etre for net neutrality is D.O.A. and trying to shove through a bloated set of internet regulations tainted by the corporate lobbying process that defines American politics is unnecessarily and likely damaging to openness and freedom.",
          "CoreOs (etcd team) is currently rewriting their raft implementation because it had a lot of problems.  I don&#x27;t believe there is a &quot;good&quot; implementation out there yet, because it&#x27;s all very new.  And should an implantation be &quot;good&quot;, AKA implement the spec without introducing incidental errors, will it still have edge cases because the spec has edge cases?  This is all currently unknown. It&#x27;s precisely these assumptions that I&#x27;m pointing out.<p>A quick google search brings up libpaxos and other open paxos implementations, so it appears that they exist.",
          "Well, this is one &quot;newbie&quot;, but not all &quot;newbies&quot; are the same. I also think it depends on the time span during which a post gathers upovotes and comments. You can&#x27;t derive the position of a post based on points, comments and actuality of a post.<p>I think some things changes since pg posted the algorithm [0], but I can&#x27;t find anything. Also make sure to check Google for &quot;Hackernews ranking algorithm&quot;. [1] [2] [3]<p>[0] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=231209\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=231209</a><p>[1] <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=1781013\" rel=\"nofollow\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=1781013</a><p>[2] <a href=\"http:&#x2F;&#x2F;www.righto.com&#x2F;2013&#x2F;11&#x2F;how-hacker-news-ranking-really-works.html\" rel=\"nofollow\">http:&#x2F;&#x2F;www.righto.com&#x2F;2013&#x2F;11&#x2F;how-hacker-news-ranking-really...</a><p>[3] <a href=\"http:&#x2F;&#x2F;www.quora.com&#x2F;Whats-Hacker-News-ranking-algorithm\" rel=\"nofollow\">http:&#x2F;&#x2F;www.quora.com&#x2F;Whats-Hacker-News-ranking-algorithm</a>",
          "Hi, your site is good. AT first glance it looks like a Google product.<p>Maybe you should try to land a web designer job in a company, before looking for customers. I&#x27;m sure there are some decent web design companies in Slovenia. So get a junior web developer and build experience. You&#x27;ll come in touch with clients during your work. Maybe one of them could be your customer, when you decide it&#x27;s time to go solo.",
          "I wonder how much effort it would be to support C# as well, without Xamarin. Would they ever do that? Or would they prefer to not hurt Xamarin (or maybe Google&#x2F;Apple) too much by offering their own C# crossplatform development?",
          "&gt; Programming languages you don&#x27;t know are harder to read than programming languages you do know.<p>I will definitely agree with you there.  It would help our team significantly if we had a Scala expert we could consult but there&#x27;s not enough in the budget (monetary or political) to hire one.  We are pretty much left to fend for ourselves with Google, Stack Overflow and a couple reference books.  This project also contains a C++ component that would probably have been just as impenetrable to my teammates (who have C but no C++ experience) if I hadn&#x27;t already been fairly familiar with the language.<p>&gt; Unlike &quot;bad perl&quot;, you have types that tell you exactly what something does.<p>Static typing doesn&#x27;t help always when you actively try to subvert it.  There are casts to and from Any all over this codebase.  Reflection is used everywhere even when it&#x27;s not necessary.  There are even places where they convert between types by serializing an instance of one type and deserializing it as an instance of another (with similar fields but not actually related in the type system).  They also loved Option[] types which might not be so bad if they weren&#x27;t also storing Some(null) into them in just enough places you forget to check for it but it still blows up in your face at least a once a month.  Basically, the original authors of this code tried their best to destroy the usefulness of the Scala type system and succeeded fairly well.<p>&gt; Calling Scala from Java is not beginner level material that winds up in a tutorial, and it&#x27;s a bad idea to begin with; you&#x27;re stuck speaking a pidgin Scala using Java-only constructs just to maintain Java interop.<p>By mandate of our management we are not allowed to write any new Scala code except where absolutely necessary.  The contractors went behind our management&#x27;s back to write it in the first place (we told them they could use Java 8 which they interpreted to mean they could use anything that would run on a Java 8 JVM).  After that was found out (about a 1&#x2F;3 of the way through the contract and too late to rewrite everything without blowing our contractual deadline with <i>our</i> customer) new Scala code was banned and they had to (and we have to) use Java as much as possible after that point.  This is also not helped by the fact that at the time they handed the code over it was barely half-baked and performing at less than 25% of the needed throughput and we&#x27;re left trying to finish and fix it.<p>Of course, when it can take three or four developers (with a combined background in Java, C#, C, C++, Python, Javascript, and an academic familiarity with OCaml-family functional languages) a half hour or more to figure out what a some of the methods in this codebase even do (at both a syntatic and conceptual level) I am going to put (a small) part of the blame on Scala for allowing such impenetrable code to be written in the first place.  I&#x27;m certainly not placing all or even a significant amount of the blame for this project&#x27;s problems on Scala but it is certainly not helping.<p>Thanks for letting me vent.",
          "That&#x27;s great!<p>Add-on has access only to files in which the add-on is used.\nMore information can be found here <a href=\"https://developers.google.com/apps-script/guides/services/authorization#manual_authorization_scopes_for_sheets_docs_and_forms\" rel=\"nofollow\">https:&#x2F;&#x2F;developers.google.com&#x2F;apps-script&#x2F;guides&#x2F;services&#x2F;au...</a><p>In addition your document is shared with an editor, but only after you agree to work with him."
        ]
      },
      {
        "freq": 135,
        "name": "frequency",
        "topComments": [
          "<a href=\"https://play.google.com/store/apps/details?id=net.supware.tipro\" rel=\"nofollow\">https:&#x2F;&#x2F;play.google.com&#x2F;store&#x2F;apps&#x2F;details?id=net.supware.ti...</a>",
          "Yes. <a href=\"http://books.google.com/books?id=ephPAAAAYAAJ&amp;q=%22no+one+ever+got+fired+for%22&amp;dq=%22no+one+ever+got+fired+for%22&amp;hl=en&amp;sa=X&amp;ei=Z2V0VLqVE8e7ygP9-ICwBg&amp;redir_esc=y\" rel=\"nofollow\">http:&#x2F;&#x2F;books.google.com&#x2F;books?id=ephPAAAAYAAJ&amp;q=%22no+one+ev...</a> shows an IBM example from 1978.<p>&gt; And so the conventional wisdom became &quot;No one every got fired for buying IBM equipment.&quot;",
          "Mainly because your comment: &quot;...they&#x27;re publishing others&#x27; content without their permission and without paying them.&quot; is false. The publications can choose to add or remove themselves from google news, meaning google has permission. Also because google news points to the publications and does not re-publish in whole.",
          "To be fair, this isn&#x27;t a Synology package, it is provided by one guy who works hard to try and get the Java Crashplan code to work on Synology. When Synology upgrades the DSM it stops working. Check out the forums to see the pain points people have to address to keep this headless client working:<p><a href=\"https://www.google.com/search?q=synology+crashplan+not+Working\" rel=\"nofollow\">https:&#x2F;&#x2F;www.google.com&#x2F;search?q=synology+crashplan+not+Worki...</a><p>It is a hack. There should be an official release from Crashplan or Synology. Same for the other big backup cloud providers. If there was something better and supported on Synology than Amazon S3 or Glacier, I&#x27;d personally be prepared to get my wallet out. These companies are missing a big market of Synology owners who are desperate for an alternative, and no I don&#x27;t want to use HiDrive.",
          "This looks like the typical Google interview and they had that going for a long time[1].<p>My theory is that some companies want to be google-like and hope that by trying to apply the same interview practices they might be successful in finding and attracting the same top talent as Google attracted&#x2F;attracts.<p>[1] I interviewed with them a while back.",
          "Good point.<p>But since some of the best password managers are already open source, I wonder what&#x27;s preventing browser vendors from integrating at least some of the functionality. A good password manager not only helps contain the damage of leaked passwords, but also does a very good job at protecting users from phishing attacks at similar-looking domains.<p>All the browsers have been pretty stagnant on this front for the last few years. I suspect they&#x27;ve been hoping that everyone will move to an SSO platform in which the browser vendors themselves have a vested interest (Mozilla Persona, Google account, Microsoft account).",
          "Nothing at all.<p>Apparently Google is waiting that JetBrains eventually releases CLion.<p>It is anyone&#x27;s guess when it will achieve parity with CDT.",
          "Not specific to PeerPub, but I helped work on a prototype of a federated login system based on OpenID that used blind signatures in a similar fashion:<p><a href=\"http://private-idp.appspot.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;private-idp.appspot.com&#x2F;</a><p><a href=\"https://code.google.com/p/pseudoid/\" rel=\"nofollow\">https:&#x2F;&#x2F;code.google.com&#x2F;p&#x2F;pseudoid&#x2F;</a><p><a href=\"http://blind-signer.appspot.com/\" rel=\"nofollow\">http:&#x2F;&#x2F;blind-signer.appspot.com&#x2F;</a><p>I haven&#x27;t touched it for years and it looks like the login flow is broken now with the demo sites.<p>Also, this uses unsafe server-side JS crypto for demo purposes only.",
          "&gt; It&#x27;s not all that different to the advantages of vertically integrating iTunes&#x2F;iOS&#x2F;Apple Ax-based hardware.<p>It&#x27;s different due to the fact that Internet is a &quot;utility&quot; now in the same way gas, electricity and water are (isn&#x27;t it considered a human right in the USA now?). An Apple iPhone is not in any way a utility, and its functionality can be made up, 1:1 (fanboyism aside, thank you) by another device. iTunes (the store) is not a utility, and its functionality can be made up, 1:1, by purchasing CDs or using Google Play &#x2F; Spotify &#x2F; Rdio. iTunes (the app) is not a utility for obvious reasons.<p>Yes Apple locks you into an ecosystem, however that ecosystem is not a fundamental &quot;requirement&quot; to function as a business. There&#x27;s simply no replacement for the Internet and, in a lot of places, there&#x27;s no replacement for $ISP.",
          "Yes, no I read that bit, I guess I was just interested in whether Google started the DD and they were waiting for the formal offer or what part in the process it fell through at – 30 days isn&#x27;t very long for an acquisition process."
        ]
      },
      {
        "freq": 126,
        "name": "frequency",
        "topComments": [
          "it&#x27;s not a scam in the sense of an illegal scam, but it certainly is trying to prey on someone who might not know better.<p>If you are a lone engineer, but is capable of making a successful app, you have a certain aptitude for programming. This is useful to google. The recruiter is making a bet that this lone engineer is not business savvy enough to know how much their true worth is, and if the bet worked, google would&#x27;ve been able to low-ball hire a really good engineer. They failed this time, but you don&#x27;t hear about the times this strategy succeeds, because those &#x27;acqui-hires&#x27; might&#x27;ve even been celebrated by the &quot;victim&quot; as success!",
          "&gt; How the hell does <a href=\"https://help.github.com/articles/dealing-with-non-fast-forwa..\" rel=\"nofollow\">https:&#x2F;&#x2F;help.github.com&#x2F;articles&#x2F;dealing-with-non-fast-forwa...</a>. relate to their movies?<p>It doesn&#x27;t.  This outfit, per Chilling Effect&#x27;s search, pumps out notices by the hundreds.  Most likely they use some script or tool to grab a bunch of URLs from various Google searches, then dump them into a form letter.  I&#x27;m not sure if anyone was supposed to weed out the obviously bogus output, but I think we can all see that nothing of the sort happened.<p>They churn these out fast enough that nobody is actually paying any real attention to what they&#x27;re doing from what I&#x27;ve seen.",
          "From the article:<p>&gt; <i>Here’s an exercise: The next time you see someone talking about algorithms, replace the term with “God” and ask yourself if the sense changes any.</i><p>This comes immediately after a paragraph that lists four instances of people saying things about &quot;algorithms&quot; ... not one of which would have meant the same thing if it had said &quot;God&quot; instead.<p>Most of the recent occasions when I have used the word &quot;algorithm&quot; it&#x27;s been in contexts like &quot;We can probably come up with an algorithm to distinguish this case from that case&quot; and &quot;I spend a lot of my time designing and tweaking algorithms&quot;. Replacing &quot;algorithm&quot; with &quot;God&quot; doesn&#x27;t make much sense there, either.<p>I suppose the author isn&#x27;t really thinking about people who actually work with algorithms every day, but about the general public. I would hazard a guess that at least 75% of the general public have no idea what &quot;algorithm&quot; even means, are not familiar with (e.g.) the fact that Google&#x27;s search engine is (kinda) executing one, and as a consequence don&#x27;t have an attitude to &quot;algorithms&quot; that remotely resembles that of religious people towards their gods.<p>The sentence I quoted seems like the kind of thing people say to sound clever and insightful, without actually paying too much attention to whether it makes any sense.<p>There are (I think) some good points in the article, but having such overblown bullshit so prominent so early in it really doesn&#x27;t encourage me to read it with the care the author presumably thinks it deserves.",
          "It could be a typo or other mistake. To be clear, &quot;medium income&quot; was the phrase used by Philip Longman in the cited PDF. I also wonder if he actually meant &quot;median income.&quot; I googled on &quot;define medium income&quot;, and it seems P.L. isn&#x27;t alone in using that term, but it&#x27;s not clear to me if it&#x27;s taken the same as median, or if it&#x27;s a unique term all its own.<p>In the book, &quot;Children in America: National Indicator of Well-being&quot;, edited by Ryan H. Nobbins, in Appendix A (page 121), &quot;medium income&quot; is given a definition (see <a href=\"https://books.google.com/books?id=ALccZ2yFq9UC&amp;pg=PA121&amp;lpg=PA121&amp;dq=define+medium+income&amp;source=bl&amp;ots=WKBXiHsEgU&amp;sig=1NqUR_0MjpIJ1X_QuSRqHSClLSc&amp;hl=en&amp;sa=X&amp;ei=xf6aVJucFMGigwTYnYCIDQ&amp;ved=0CEQQ6AEwBg#v=onepage&amp;q=define%20medium%20income&amp;f=false\" rel=\"nofollow\">https:&#x2F;&#x2F;books.google.com&#x2F;books?id=ALccZ2yFq9UC&amp;pg=PA121&amp;lpg=...</a>), although I don&#x27;t know if P.L. means it this way: Medium Income is between 200 and 399 percent of the poverty threshold (e.g. from $37620 thru $75239 for a family of 4 in 2003).",
          "I guess we are playing with words here. A specific <i>google-device</i> will have its OS update earlier than a similar <i>non-google-device</i>. Catch is, more recent google or non-google devices usually get the update earlier.<p>Google would like you to believe that you will get your update as soon as a newer version has been released, sort of in an Apple IOS update way. The reality is very different.",
          "FireTV was a much, much easier product to develop. It was pretty clear an Android STB was worth doing. In this case, Amazon wisely took the simplest path to get there: Google TV + better content deals and updated hardware and software.",
          "unlikely we will know the true internal discussion, but it seems unlikely it realistically took MSFT 92 days to put together a patch.<p>It seems far more likely they sat on the disclosure and did not prioritize it appropriately, after google continued to push for an estimated release date (which they never got). Then when the clock was running out, MSFT asked for extension, and Google being tired of getting put off, said no and stuck to their 90-day policy.<p>all of the above is speculation, and I don&#x27;t necessarily agree it was the right thing to do. However, I could see folks @ googles sec group being a bit pissed MSFT wasnt taking it seriously, and then decided to stand on their policy just to make an example (surely, MSFT wont drag feet on future disclosures after this, right?).",
          "This is the first post mortem I found online relating to Google Foobar. I just ran out of problems today, in the middle of level 8.<p>The questions were certainly interesting, and I agree with the summary of the person who wrote the blog post at the link. This is not a cryptanalyst recruiting tool, has nothing to do with a movie, and it doesn&#x27;t really lead anywhere. It&#x27;s just a fun set of problems to solve.<p>They do send your details to a recruiter at the end of level 3 (the hard problems are at levels 5 and 6). And you get a chance to look at some interesting articles written by Googlers on problems they solved within the company.<p>The challenge was very well done, on the whole, and it is clear some very intelligent people work at Google.<p>I did encounter a number of errors in problem statements, and found a bug in the online Python editor that is used for the challenge. I also managed to submit an incorrect solution that passed all the tests, which I only recognised after I submitted. The test cases were not very thorough. And for some of the problems you could simply precompute a table of all the answers and include it in the solution, though I personally chose not to do that.<p>As far as I can tell, for those who are curious, there is no secret pot of gold at the end of this rainbow. I had been hoping for at least an ascii graphic of rabbits escaping the clutches of the evil Doctor Boolean, and a link to share &quot;I finished Google Foobar&quot; on social media or something. But unfortunately, one simply exhausts the problem pool and it just stops mid....",
          "Yes it will. I am fully aware that the handsets are bought contract-free from Google (I am a long time Nexus user and purchaser), I am not suggesting that the carrier will replace or repair the handset.<p>The handset that attaches to a GSM network has to conform to many standards set out by the GSMA (GSM association) as well as many other local certification bodies and associations (one example is the handset must have the ability to call emergency services).<p>If complaints are made to the technical department of the carrier being used, the calls will <i>eventually</i> be escalated to a vendor&#x2F;manufacturer of Google&#x27;s size.<p>I&#x27;ve worked for various different cellular providers and I have personally seen such tickets.",
          "I&#x27;m just going to be honest, because the honest answer is simple.<p>It is not my job, or anyone else&#x27;s, to square the circle of sound cryptography with good UX. Advice not to use broken crypto doesn&#x27;t become bad advice simply because the good crypto options have crappy UX. If you care about security, good crypto trumps bad UX. If you don&#x27;t care about security, just use Google Chat. Seriously: you are probably better off <i>even from a security perspective</i> using Google Chat than you are by using fly-by-night crypto.<p>If you asking, &quot;why don&#x27;t more of the people who strongly believe we need better encrypted messaging contribute UX work to the good crypto projects like TextSecure instead of inventing their own broken systems?&quot;, I&#x27;m as confused as you are by that phenomenon."
        ]
      },
      {
        "freq": 121,
        "name": "frequency",
        "topComments": [
          "Please don&#x27;t be condescending when you don&#x27;t know the basic terminology for the topic being discussed especially when the info is a Google search away.<p>TDEE (Total Daily Energy Expenditure) = BMR + Energy expended in a day.<p>It is very clear concept. Have the self control to master the mental elements and eat less calories than your TDEE and you lose weight. My question do you have research&#x2F;evidence that disputes this? In my opinion as long as the truth is that being overweight is caused by eating more food than you need, the mentality of &quot;fatty has no self control&quot; is reasonable.<p>It was certainly true of me 40lbs ago.",
          "From what I understand, they don&#x27;t have ISPs treat their traffic any differently inside their networks. They just take that traffic off the ISP networks early onto their own. If that is correct and they don&#x27;t do anything to hinder others from doing the same, then no, they don&#x27;t violate Net Neutrality.<p>Its the same thing every CDN or large site does, moving their own presence closer to the customers. Google isn&#x27;t violating net neutrality by having servers in the US AND Europe.",
          "I assure you its not hypothetical.<p>You would be wrong to assume large companies beat every other offer. Large companies rarely beat other offers. Even Google does not do it unless you are a rock star.<p>Also I never pitched them against each other ... I dont see that as a professional behavior, I negotiate separately. But I agree I did not do a good job of negotiating with A, maybe I was starstruck",
          "&gt; Okay. Fair enough. I concede that efficiency is important and that SPDY &#x2F; HTTP&#x2F;2 can improve upon it.<p>Great, I appreciate you recognize this.<p>&gt; Why include tons of small resources on your page if they&#x27;re not necessary?<p>But it _is_ necessary. In every single of the examples I gave in my reply to dlubarov, it is necessary:<p>- There are 100+ small images, icons, etc and all are displayed on the nytimes.com homepage.<p>- All of the thumbnail pictures of ebay items on a listing are displayed to the user.<p>- The 50+ maps tiles downloaded when browsing Google Maps are all necessary.<p>- Etc<p>You seem to fail to realize that in 2015, not every web page can be dumbed down to a blob of static HTML and no more than 2-3 images. The modern web is complex. We needed a protocol that can serve it efficiently.",
          "Well not pure profit because the servers cost money. The customer base is so large now that they have way more capacity than they would need for themselves.<p>The matching of Google&#x27;s prices when they released was a good indicator of how much was profit though.",
          "Feed your confirmation bias!<p>Blocking out the &#x27;noise&#x27; for a filtered stream of what someone else thinks is important is a terrible way to improve your thinking. You <i>need</i> things that challenge the way you think in order to see whether or not you&#x27;re actually right or just delusional. The best way to get that is to randomly dip in to an unfiltered list of everything, so read HN&#x27;s &quot;new&quot; page, Medium&#x27;s recommended articles, Product Hunt, a few good news sources (BBC, WaPo, WSJ[1], HuffPo), follow a <i>variety</i> of people on Twitter, etc.<p>[1] Dodge the paywall by copying the article title in to Google.",
          "The problem is that as soon as you tie the ability to send someone an email to your bank account you immediately put poor people at a grotesque disadvantage. I wouldn&#x27;t presume to speak for pg, but I doubt any savvy investor would be happy passing up the opportunity to be the first to hear about the next Google&#x2F;Uber&#x2F;Facebook because the founder couldn&#x27;t afford to send you an email. If you want to limit the number of emails people can send then you need to tie the ability to something else.<p>That&#x27;s why Bill Gates&#x27; idea was so good - his plan was to make people&#x27;s computers have to do useful work (say, Folding At Home or the distributed Seti search client) rather than merely transferring money around. Wealthy people wouldn&#x27;t be at an advantage because the work unit would be <i>time</i>: a rich person with a fast laptop that can test 1,000,000 protein folds in 2 minutes has to do 1,000,000 tests to send their email while a poorer person whose hardware can only do 1,000 folds in 2 minutes only has to do 1,000 tests to send their email. Time is effectively the same for everyone. It&#x27;s a <i>beautiful</i> solution. Far better than boring old money.",
          "&gt; The fact that Evernote uses its own cloud storage instead of say an encrypted folder in Google Drive&#x2F;Dropbox etc is a negative of the service.<p>I hate this trend towards supporting only one or another kind of proprietary service.[1] What is wrong with WebDAV? That way, you can use a cloud hosting provider, or self-host.<p>[1] I&#x27;m looking at you Scrivener.",
          "The business model of Facebook and Google is about getting to know as much as possible about you. Apple makes most money without your data.",
          "I mean, I respect the effort, but at the risk of sounding dismissive: what&#x27;s the point?<p>Part of why DNSSEC hasn&#x27;t been widely deployed is indeed because it&#x27;s complex to deploy (though its advocates vigorously contest that, and claim it&#x27;s as simple to deploy as TLS. Heh.) Cloudflare seems to have done a great job of solving that problem.<p>But there are other reasons why DNSSEC isn&#x27;t deployed:<p>* We don&#x27;t need the DNS to be secure to solve real security problems any more than we need to authenticate IPv4 header options. TLS assumes the DNS is insecure and works anyways.  Meanwhile: even email spammers can spoof connections at a level lower than DNS, by using BGP4 to reroute the IP addresses DNS points to.<p>* DNSSEC exacerbates Internet trust issues. It&#x27;s a rigidly centralized system whose roots are dominated by world governments, a tree whose most important branches are controlled (literally) by NSA and GCHQ.<p>* It&#x27;s interesting, and a demonstration of skillful engineering, that Cloudflare can use DNSSEC ECDSA to reduce response sizes. But the roots of the tree still use RSA; the tree is still littered with insecure 1024 bit keys. Moreover, the ECC variant Cloudflare uses is itself outmoded, and experts suggest it would be optimistic to see it replaced within 10 years.<p>* Cloudflare might make it easier for organizations to flip the switch for the domains, but they can&#x27;t solve the software adoption problems of DNSSEC. DNSSEC breaks lookups, adding a bunch of new failure cases nobody is prepared to solve. For instance, every piece of software affected by the GHOST vulnerability is using an API that can&#x27;t communicate DNSSEC resolution success or failure.<p>* The most important application on the Internet is, obviously, HTTP via web browsers. And web browsers are not adopting DNSSEC. Browser teams at Google and Mozilla have both declared their efforts kaput. Apple removed their DNSSEC code from the most recent update of the OS. End-users are vulnerable to exactly the same kinds of attacks before and after DNSSEC deployment.<p>I see how adoption of DNSSEC helps Cloudflare: it&#x27;s yet another reason you&#x27;d outsource the operation of your Internet presence. That&#x27;s not a sinister motive, but it also shouldn&#x27;t be an animating motive behind a unnecessary and harmful forklift update of Internet infrastructure.<p>When I got started, in my first &quot;real&quot; job, you could set up the infrastructure for mailing lists on a FreeBSD 486 and be off to the races. Today, getting a mailing list running is such a nightmare of deliverability hacks and monitoring that most people (sensibly) give up and delegate the task to things like Mailchimp and Mailgun. More companies than not are hesitant to even host their own internal mail. Are we meant to be happy at the prospect of the same thing happening for DNS?"
        ]
      }
    ],
    "positive": 0.8108,
    "negative": 0.0135,
    "neural": 0.1757
  }
]